[{"article":"46.pdf","title":"PURCHASE BIDDING STRATEGY FOR A RETAILER WITH FLEXIBLE DEMANDS IN DAY-AHEAD ELECTRICITY MARKET ","authors":["MENG SONG"," MIKAEL AMELIN"],"institutions":[],"abstract":"ABSTRACT—THE PAPER AIMS TO DETERMINE THE DAY-AHEAD MARKETBIDDING STRATEGIES FOR RETAILERS WITH FLEXIBLE DEMANDS TO MAXIMIZETHE SHORT-TERM PROFIT. IT PROPOSES A SHORT-TERM PLANNING FRAMEWORKTO FORECAST THE LOAD UNDER DYNAMIC TARIFFS AND CONSTRUCT BIDINGCURVES. STOCHASTIC PROGRAMMING IS APPLIED TO MANAGE THE UNCER-TAINTIES OF SPOT PRICE, REGULATING PRICE, CONSUMPTION BEHAVIORS, ANDRESPONSIVENESS TO DYNAMIC TARIFFS. A CASE STUDY BASED ON DATA FROMSWEDEN IS CARRIED OUT. IT DEMONSTRATES THAT A REAL-TIME SELLING PRICECAN AFFECT THE AGGREGATE LOAD OF A RESIDENTIAL CONSUMER GROUP ANDLEAD TO LOAD SHIFT TOWARD LOW-PRICE PERIODS. THE OPTIMAL BIDDINGCURVES FOR SPECIFIC TRADING PERIODS ARE ILLUSTRATED. THROUGH COM-PARING THE BIDDING STRATEGIES UNDER DIFFERENT RISK FACTORS, THE CASESTUDY SHOWS THAT A RISK-AVERSE RETAILER TENDS TO ADOPT THE STRATE-GIES WITH LARGER IMBALANCES. THE BENEFIT LIES IN THE REDUCTION OFLOW-PROFIT RISK. HOWEVER, THE AVERSION TO RISK CAN ONLY BE KEPT IN ACERTAIN LEVEL. A LARGER IMBALANCE MAY LEAD TO A QUICK REDUCTION OFPROFIT IN ALL SCENARIOS.","objective":[],"problem":"","methodology":["BE MUCH LOWER AFTER A LONG DELAY"],"contributes":"","references":["[1] R. H. BOROUMAND AND G. ZACHMANN, \"'RETAILERS' RISK MANAGEMENT ANDVERTICAL ARRANGEMENTS IN ELECTRICITY MARKETS,\" ENERGY POLICY, VOL. 40,PP. 465–472, 2012.","[2] E. A. FEINBERG AND D. GENETHLIOU, \"LOAD FORECASTING,\" IN MATHEMATICS FORRESTRUCTURED ELECTRIC POWER SYSTEMS: OPTIMIZATION CONTROL, AND COMPU-TATIONAL INTELLIGENCE. NEW YORK, NY, USA: SPRINGER, 2005, PP. 269–285.[3] A. FARUQUI AND S. SERGICI, \"HOUSEHOLD RESPONSE TO DYNAMIC PRICING OFELECTRICITY: A SURVEY OF 15 EXPERIMENTS,\" J. REGUL. ECON., VOL. 38, NO. 2,PP. 193–225, 2010.","[3] A. FARUQUI AND S. SERGICI, \"HOUSEHOLD RESPONSE TO DYNAMIC PRICING OFELECTRICITY: A SURVEY OF 15 EXPERIMENTS,\" J. REGUL. ECON., VOL. 38, NO. 2,PP. 193–225, 2010.","[4] D. HAMMERSTROM, \"PACIFIC NORTHWEST GRIDWISE TESTBED DEMONSTRATIONPROJECTS,\" PACIFIC NORTHWEST NAT. LAB., RICHLAND, WA, USA, TECH. REP.PNNL-17167, 2007.","[5] IBM, \"ONTARIO ENERGY BOARD SMART PRICE PILOT—FINAL REPORT,\" ONTARIOENERGY BOARD, TORONTO, ON, CANADA, TECH. REP., 2007.","[6] D. VIOLETTE, J. ERICKSON, AND M. KLOS, \"FINAL REPORT FOR THE MYPOWER PRIC-ING SEGMENTS EVALUATION,\" PUBLIC SERVICE ELECT. GAS COMPANY, NEWARK,NJ, USA, TECH. REP., 2007.","[7] C. BARTUSCH, F. WALLIN, M. ODLARE, I. VASSILEVA, AND L. WESTER, \"INTRODUCINGA DEMAND-BASED ELECTRICITY DISTRIBUTION TARIFF IN THE RESIDENTIAL SECTOR:DEMAND RESPONSE AND CUSTOMER PERCEPTION,\" ENERGY POLICY, VOL. 39, NO. 9,PP. 5008–5025, 2011.","[8] SEDC, \"MAPPING DEMAND RESPONSE IN EUROPE TODAY,\" SMART ENERGY DE-MAND COALITION, BRUSSELS, BELGIUM, TECH. REP. SEDC-MAPPING-DR-IN-EUROPE-2014 0411, APR. 2014.","[9] D. S. KIRSCHEN AND S. MEMBER, \"DEMAND-SIDE VIEW OF ELECTRICITY MARKETS,\"IEEE TRANS. POWER SYST., VOL. 18, NO. 2, PP. 520–527, MAY 2003.","[10] C. TRIKI AND A. VIOLI, \"DYNAMIC PRICING OF ELECTRICITY IN RETAIL MARKETS,\"4OR—QUART. J. OPER. RES., VOL. 7, NO. 1, PP. 21–36, OCT. 2007.","[11] A. HATAMI, H. SEIFI, AND M. K. SHEIKH-EL-ESLAMI, \"A STOCHASTIC-BASEDDECISION-MAKING FRAMEWORK FOR AN ELECTRICITY RETAILER: TIME-OF-USE PRICINGAND ELECTRICITY PORTFOLIO OPTIMIZATION,\" IEEE TRANS. POWER SYST., VOL. 26,NO. 4, PP. 1808–1816, NOV. 2011.","[12] S. E. FLETEN AND E. PETTERSEN, \"CONSTRUCTING BIDDING CURVES FOR A PRICE-TAKING RETAILER IN THE NORWEGIAN ELECTRICITY MARKET,\" IEEE TRANS. POWERSYST., VOL. 20, NO. 2, PP. 701–708, MAY 2005.","[13] A. BADRI AND H. KASHEFI, \"OPTIMAL BIDDING STRATEGY OF RETAILERS IN A MIXEDPOOL-BILATERAL MARKET CONSIDERING DEMAND RESPONSE PROGRAMS,\" IN PROC.IEEE SMART GRID CONF., 2013, PP. 131–137.[14] H. A. AALAMI, M. P. MOGHADDAM, AND G. R. YOUSEFI, \"MODELING ANDPRIORITIZING DEMAND RESPONSE PROGRAMS IN POWER MARKETS,\" ELECT. POWERSYST. RES., VOL. 80, PP. 426–435, 2010.","[14] H. A. AALAMI, M. P. MOGHADDAM, AND G. R. YOUSEFI, \"MODELING ANDPRIORITIZING DEMAND RESPONSE PROGRAMS IN POWER MARKETS,\" ELECT. POWERSYST. RES., VOL. 80, PP. 426–435, 2010.","[15] N. MAHMOUDI, M. EGHBAL, AND T. K. SAHA, \"EMPLOYING DEMAND RESPONSEIN ENERGY PROCUREMENT PLANS OF ELECTRICITY RETAILERS,\" INT. J. ELECT. POWERENERGY SYST., VOL. 63, PP. 455–460, 2014.","[16] C. GORRIA, J. JIMENO, I. LARESGOITI, M. LEZAUN, AND N. RUIZ, \"FORECASTINGFLEXIBILITY IN ELECTRICITY DEMAND WITH PRICE/CONSUMPTION VOLUME SIGNALS,\"ELECT. POWER SYST. RES., VOL. 95, PP. 200–205, 2013.","[17] M. SKILLBÄCK AND H. IBRAHIM, \"EVALUATION METHODS FOR MARKET MODELSUSED IN SMART GRIDS: AN APPLICATION FOR THE STOCKHOLM ROYAL SEAPORT,\" M.S.THESIS, DEPT. ELECT. POWER SYST., KTH, STOCKHOLM, SWEDEN, 2012.","[18] J. G. KASSAKIAN ET AL., \"THE IMPACT OF DISTRIBUTED GENERATION AND ELECTRICVEHICLES,\" IN THE FUTURE OF THE ELECTRIC GRID: AN INTERDISCIPLINARY MITSTUDY, MIT, CAMBRIDGE, MA, USA, 2011, CH. 5, PP. 109–126.[19] S. GOTTWALT, W. KETTER, C. BLOCK, J. COLLINS, AND C. WEINHARDT, \"DEMANDSIDE MANAGEMENT: A SIMULATION OF HOUSEHOLD BEHAVIOR UNDER VARIABLEPRICES,\" ENERGY POLICY, VOL. 39, NO. 12, PP. 8163–8174, 2011.","[19] S. GOTTWALT, W. KETTER, C. BLOCK, J. COLLINS, AND C. WEINHARDT, \"DEMANDSIDE MANAGEMENT: A SIMULATION OF HOUSEHOLD BEHAVIOR UNDER VARIABLEPRICES,\" ENERGY POLICY, VOL. 39, NO. 12, PP. 8163–8174, 2011.","[20] P. GRAHN, J. ROSENLIND, P. HILBER, K. ALVEHAG, AND L. SÖDER, \"A METHOD FOREVALUATING THE IMPACT OF ELECTRIC VEHICLE CHARGING ON TRANSFORMER HOTSPOTTEMPERATURE,\" IN PROC. IEEE PES INT. CONF. EXHIB. INNOV. SMART GRIDTECHNOL., 2011, PP. 1–8.[21] N. JEWELL, L. BAI, J. NABER, AND M. L. MCINTYRE, \"ANALYSIS OF ELECTRICVEHICLE CHARGE SCHEDULING AND EFFECTS ON ELECTRICITY DEMAND COSTS,\" ENERGY","[21] N. JEWELL, L. BAI, J. NABER, AND M. L. MCINTYRE, \"ANALYSIS OF ELECTRICVEHICLE CHARGE SCHEDULING AND EFFECTS ON ELECTRICITY DEMAND COSTS,\" ENERGYSYST., VOL. 5, PP. 767–786, 2014.","[22] J. LUJANO-ROJAS, C. MONTEIRO, R. DUFO-LOPEZ, AND J. BERNAL-AGUSTIN,\"OPTIMUM RESIDENTIAL LOAD MANAGEMENT STRATEGY FOR REAL TIME PRICINGDEMAND RESPONSE PROGRAMS,\" ENERGY POLICY, VOL. 45, PP. 671–679, 2012.","[23] C. ROE, S. MELIOPOULOS, R. ENTRIKEN, AND S. CHHAYA, \"SIMULATED DEMANDRESPONSE OF A RESIDENTIAL ENERGY MANAGEMENT SYSTEM,\" IN PROC. IEEE CONF.ENERGYTECH, 2011, PP. 1–6.[24] H. WU, M. SHAHIDEHPOUR, A. ALABDULWAHAB, AND A. ABUSORRAH, \"A GAMETHEORETIC APPROACH TO RISK-BASED OPTIMAL BIDDING STRATEGIES FOR ELECTRICVEHICLE AGGREGATORS IN ELECTRICITY MARKETS WITH VARIABLE WIND ENERGYRESOURCES,\" IEEE TRANS. SUSTAIN. ENERGY, VOL. 7, NO. 1, PP. 374–385,","[24] H. WU, M. SHAHIDEHPOUR, A. ALABDULWAHAB, AND A. ABUSORRAH, \"A GAMETHEORETIC APPROACH TO RISK-BASED OPTIMAL BIDDING STRATEGIES FOR ELECTRICVEHICLE AGGREGATORS IN ELECTRICITY MARKETS WITH VARIABLE WIND ENERGYRESOURCES,\" IEEE TRANS. SUSTAIN. ENERGY, VOL. 7, NO. 1, PP. 374–385,JAN. 2016.","[25] M. G. VAYÁ AND G. ANDERSSON, \"OPTIMAL BIDDING STRATEGY OF A PLUG-IN ELEC-TRIC VEHICLE AGGREGATOR IN DAY-AHEAD ELECTRICITY MARKET UNDER UNCERTAINTY,\"IEEE TRANS. POWER SYST., VOL. 30, NO. 5, PP. 2375–2385, SEP. 2015.","[26] S. I. VAGROPOULOS AND A. G. BAKIRTZIS, \"OPTIMAL BIDDING STRATEGY FORELECTRIC VEHICLE AGGREGATORS IN ELECTRICITY MARKETS,\" IEEE TRANS. POWERSYST., VOL. 28, NO. 4, PP. 4031–4041, NOV. 2013.","[27] A. J. CONEJO, M. CARRION, AND J. M. MORALES, \"RISK MANAGEMENT,\" INDECISION MAKING UNDER UNCERTAINTY IN ELECTRICITY MARKETS. NEW YORK,NY, USA, SPRINGER, 2010, CH. 4, PP. 121–152.[28] C. BANG, F. FOCK, AND M. TOGEBY, \"THE EXISTING NORDIC REGULATING POWERMARKET,\" ENERGY ANALYSIS, COPENHAGEN, DENMARK, TECH. REP. FLEXPOWERWP1-REPORT 1, 2012.","[28] C. BANG, F. FOCK, AND M. TOGEBY, \"THE EXISTING NORDIC REGULATING POWERMARKET,\" ENERGY ANALYSIS, COPENHAGEN, DENMARK, TECH. REP. FLEXPOWERWP1-REPORT 1, 2012.","[29] B. BIEGEL, L. H. HANSEN, J. STOUSTRUP, P. ANDERSEN, AND S. HARBO, \"VALUEOF FLEXIBLE CONSUMPTION IN THE ELECTRICITY MARKETS,\" ENERGY, VOL. 66,PP. 354–362, 2014.","[30] K. C. SOU, J. WEIMER, H. SANDBERG, AND K. H. JOHANSSON, \"SCHEDULINGSMART HOME APPLIANCES USING MIXED INTEGER LINEAR PROGRAMMING,\" IN PROC.IEEE CONF. DECISION CONTROL EUR. CONTROL CONF., 2011, PP. 5144–5149.","[31] K. C. SOU, K. MIKAEL, J. WU, H. SANDBERG, AND K. H. JOHANSSON, \"ENERGYAND CO2 EFFICIENT SCHEDULING OF SMART HOME APPLIANCES,\" IN PROC. IEEEEUR. CONTROL CONF., 2013, PP. 4051–4058.","[32] R. STAMMINGER, \"SYNERGY POTENTIAL OF SMART APPLIANCES,\" UNIV. BONN,BONN, GERMANY, TECH. REP. EIE/06/185/SI2.447477, 2008.","[33] M. OLSSON AND L. SÖDER, \"MODELING REAL-TIME BALANCING POWER MARKETPRICES USING COMBINED SARIMA AND MARKOV PROCESSES,\" IEEE TRANS. POWERSYST., VOL. 23, NO. 2, PP. 443–450, MAY 2008.","[34] J. ZIMMERMANN, \"END-USE METERING CAMPAIGN IN 400 HOUSEHOLDS IN SWE-DEN ASSESSMENT OF THE POTENTIAL ELECTRICITY SAVINGS,\" FLINES-RIMANDOULE,ENERTECH, TECH. REP. 17-05-2743, VOL. 17, 2009.","[35] M. SONG, K. ALVEHAG, J. WIDÉN, AND A. PARISIO, \"ESTIMATING THE IMPACTSOF DEMAND RESPONSE BY SIMULATING HOUSEHOLD BEHAVIOURS UNDER PRICE ANDCO2 SIGNALS,\" ELECT. POWER SYST. RES., VOL. 111, PP. 103–114, 2014.","[36] L. ABRAMOWSKI AND A. HOLMSTRÖM, \"RES 2005–2006 DEN NATIONELLA RESVA-NEUNDERSÖKNINGEN,\" STATENS INSTITUT KOMMUNIKATIONSANALYS, STOCKHOLM,SWEDEN, TECH. REP. TK1101BR0601, 2007.","[37] J. DUPAČOÁ, N. GRÖWE-KUSKA, AND W. RÖMISCH, \"SCENARIO REDUCTION INSTOCHASTIC PROGRAMMING: AN APPROACH USING PROBABILITY METRICS,\" MATH.PROGRAM. SER. A, VOL. 95, PP. 493–511, 2003.","[38] H. HEITSCH AND W. RÖMISCH, \"SCENARIO REDUCTION ALGORITHMS IN STOCHASTICPROGRAMMING,\" COMPUT. OPTIM. APPL., VOL. 24, PP. 187–206, 2003."],"terms":["PRICE","SCENARIO","DEMAND","MARKET","BIDDING","IMBALANCE","POWER","AHEAD","RETAILER","CYCLE"]},{"article":"13.pdf","title":"FEEDBACK CONTROLLERS AS FINANCIAL ADVISORS FOR LOW-INCOME INDIVIDUALS ","authors":[" GONZALEZ VILLASANTI AND KEVIN M. PASSINO"," FELLOW"],"institutions":[],"abstract":"ABSTRACT—FEEDBACK CONTROLLERS ARE INTRODUCED TO HELP MANAGEAN INDIVIDUAL'S OR HOUSEHOLD'S FINANCIAL LIFE AND BUILD SAVINGS. THECONTROLLERS CAN BE VIEWED AS FINANCIAL ADVISORS FOR AN INDIVIDUAL'SRESOURCE ALLOCATION PROBLEM, WHICH IS MODELED AS A NONLINEARDISCRETE TIME STOCHASTIC SYSTEM WITH INCOME UNCERTAINTIES, ASSETLOSSES, AND CONSTRAINTS ON CASH FLOW AND CREDIT. WE INTRODUCE AMODEL PREDICTIVE CONTROLLER (MPC) AND A PROPORTIONAL-INTEGRAL-DERIVATIVE (PID) CONTROLLER, AND COMPARE THEM WITH A BENCHMARKMETHOD EMPLOYED IN FINANCE AND ECONOMICS, STOCHASTIC DYNAMICPROGRAMMING (DP). BOTH MPC AND PID PRODUCE SIMILAR CONSIS-TENCY IN FINANCIAL MANAGEMENT COMPARED WITH DP. THEY ALSOOFFER THE ADVANTAGE OF LOW COMPUTATIONAL COMPLEXITY RELATIVETO DP, WHICH ALLOWS US TO EFFICIENTLY PERFORM ASSESSMENTS OFROBUSTNESS (RELIABILITY) AND DISTURBANCE REJECTION (E.G., EFFECTS OFUNCERTAINTIES), BOTH OF WHICH ARE OF SIGNIFICANT PRACTICAL ENGINEER-ING IMPORTANCE. IN ADDITION, THIS FLEXIBILITY ENABLES US TO UNCOVERTHE SYSTEM'S PROPERTIES, SUCH AS THE EXISTENCE OF A \"POVERTYTRAP\" CAUSED BY CONSTRAINTS IN THE CONTROL SPACE AND DYNAMICS.THE EFFECTIVENESS OF A PID-BASED AID INTERVENTION FOR LOW-SKILLEDAND LOW-ENDOWED AGENTS THAT LIE WITHIN THE TRAP IS ASSESSEDAND CONTRASTED WITH OTHER EXISTING CASH TRANSFER PROGRAMS, WITHRESULTS THAT SUPPORT A FURTHER IMPLEMENTATION ANALYSIS. THESEASSESSMENTS CONSTITUTE A NOVEL APPLICATION OF FEEDBACK CONTROLLERSTHAT, BESIDES EFFECTIVELY DEALING WITH SCARCITY CONSTRAINTS, PRESENTPRACTICAL ADVANTAGES THAT ARE SHOWN TO TRANSLATE INTO AN ABILITYTO IMPLEMENT THE MPC OR PID CONTROLLER IN A VARIETY OF WAYSFOR LOW-INCOME INDIVIDUALS VIA COMPUTER-ASSISTIVE METHODS (E.G.,A CELL PHONE).","objective":[],"problem":"","methodology":[],"contributes":"","references":["[1] K. M. PASSINO, HUMANITARIAN ENGINEERING: ADVANCING TECHNOLOGIESFOR SUSTAINABLE DEVELOPMENT, 3ND ED. COLUMBUS, OH, USA: BEDEPUBLISHING, 2016.","[2] A. PAWASUTIPAISIT AND R. M. TOWNSEND, \"WEALTH ACCUMULATION ANDFACTORS ACCOUNTING FOR SUCCESS,\" J. ECON., VOL. 161, NO. 1, PP. 56–81,2011.","[3] S. RUTHERFORD, THE POOR AND THEIR MONEY. OXFORD, U.K.:OXFORD UNIV. PRESS, 2001.","[4] R. C. MERTON, \"OPTIMUM CONSUMPTION AND PORTFOLIO RULES IN ACONTINUOUS-TIME MODEL,\" J. ECON. THEORY, VOL. 3, NO. 4, PP. 373–413,1971.","[5] J. Y. CAMPBELL AND L. M. VICEIRA, \"CONSUMPTION AND PORTFOLIO DECISIONSWHEN EXPECTED RETURNS ARE TIME VARYING,\" NAT. BUREAU ECON. RES.,TECH. REP. 5857, VOL. 114, PP. 433–495, 1999.","[6] F. J. ZIMMERMAN AND M. R. CARTER, \"ASSET SMOOTHING, CONSUMPTIONSMOOTHING AND THE REPRODUCTION OF INEQUALITY UNDER RISK AND SUBSISTENCECONSTRAINTS,\" J. DEVELOP. ECON., VOL. 71, NO. 2, PP. 233–260, 2003.","[7] D. COLLINS, J. MORDUCH, S. RUTHERFORD, AND O. RUTHVEN, PORTFOLIOS OF THEPOOR: HOW THE WORLD'S POOR LIVE ON TWO DOLLARS A DAY. PRINCETON, NJ,USA: PRINCETON UNIV. PRESS, 2009.","[8] D. HULME AND P. MOSLEY, FINANCE AGAINST POVERTY. EVANSTON, IL, USA:ROUTLEDGE, 1996.","[9] J. ZOLLMANN, \"KENYA FINANCIAL DIARIES: SHILINGI KWA SHILINGI—THEFINANCIAL LIVES OF THE POOR,\" FSD KENYA, NAIROBI, KENYA, TECH. REP.,2014.","[10] D. A. KENDRICK, STOCHASTIC CONTROL FOR ECONOMIC MODELS. NEW YORK,NY, USA: MCGRAW-HILL, 1981.","[11] J. SEGUPTA AND P. FANCHON, CONTROL THEORY METHODS IN ECONOMICS.NORWELL, MA, USA: SPRINGER, 1997.","[12] T. F. COSIMANO, \"OPTIMAL EXPERIMENTATION AND THE PERTURBATION METHODIN THE NEIGHBORHOOD OF THE AUGMENTED LINEAR REGULATOR PROBLEM,\" J. ECON.DYN. CONTROL, VOL. 32, NO. 6, PP. 1857–1894, 2008.","[13] F. HERZOG, G. DONDI, AND H. P. GEERING, \"STOCHASTIC MODEL PREDICTIVECONTROL AND PORTFOLIO OPTIMIZATION,\" INT. J. THEOR. APPL. FINANCE, VOL. 10,NO. 2, PP. 203–233, 2007.","[14] V. V. DOMBROVSKII, D. V. DOMBROVSKII, AND E. A. LYASHENKO, \"PREDICTIVECONTROL OF RANDOM-PARAMETER SYSTEMS WITH MULTIPLICATIVE NOISE. APPLI-CATION TO INVESTMENT PORTFOLIO OPTIMIZATION,\" AUTOM. REMOTE CONTROL,VOL. 66, NO. 4, PP. 583–595, 2005.","[15] D. KARLAN, A. L. RATAN, AND J. ZINMAN, \"SAVINGS BY AND FOR THE POOR:A RESEARCH REVIEW AND AGENDA,\" REV. INCOME WEALTH, VOL. 60, NO. 1,PP. 36–78, 2014.","[16] J. E. TAYLOR AND I. ADELMAN, \"AGRICULTURAL HOUSEHOLD MODELS: GENE-SIS, EVOLUTION, AND EXTENSIONS,\" REV. ECON. HOUSEHOLD, VOL. 1, NO. 1,PP. 33–58, 2003.","[17] P. A. SAMUELSON, \"LIFETIME PORTFOLIO SELECTION BY DYNAMIC STOCHASTICPROGRAMMING,\" REV. ECON. STATIST., VOL. 51, NO. 3, PP. 239–246, 1969.","[18] A. MAS-COLELL, M. D. WHINSTON, AND J. R. GREEN, MICROECONOMICTHEORY. NEW YORK, NY, USA: OXFORD UNIV. PRESS, 1995.","[19] D. P. BERTSEKAS, DYNAMIC PROGRAMMING AND OPTIMAL CONTROL, VOL. 1.BELMONT, MA, USA: ATHENA SCIENTIFIC, 1995.","[20] D. P. BERTSEKAS AND J. N. TSITSIKLIS, NEURO-DYNAMIC PROGRAMMING.BELMONT, MA, USA: ATHENA SCIENTIFIC, 1996.","[21] H. J. KUSHNER AND P. G. DUPUIS, NUMERICAL METHODS FOR STO-CHASTIC CONTROL PROBLEMS IN CONTINUOUS TIME. HAMBURG, GERMANY:SPRINGER-VERLAG, 2001.","[22] K. PASSINO, BIOMIMICRY FOR OPTIMIZATION, CONTROL, AND AUTOMATION.LONDON, U.K.: SPRINGER-VERLAG, 2005.","[23] S. J. QIN AND T. A. BADGWELL, \"A SURVEY OF INDUSTRIAL MODEL PREDICTIVECONTROL TECHNOLOGY,\" CONTROL ENG. PRACT., VOL. 11, NO. 7, PP. 733–764,2003.","[24] C. B. BARRETT, M. R. CARTER, AND M. IKEGAMI, \"POVERTY TRAPS AND SOCIALPROTECTION,\" WORLD BANK, SOCIAL PROTECTION, WASHINGTON, DC, USA,TECH. REP. 0804, 2008.","[25] P. M. R. CARTER AND C. B. BARRETT, \"THE ECONOMICS OF POVERTY TRAPSAND PERSISTENT POVERTY: AN ASSET-BASED APPROACH,\" J. DEVELOP. STUDIES,VOL. 42, NO. 2, PP. 178–199, 2006.","[26] F. BORRELLI, A. BEMPORAD, AND M. MORARI. (2015). PREDICTIVE CON-TROL FOR LINEAR AND HYBRID SYSTEMS, 2015."],"terms":["FINANCIAL","CONTROLLERS","CONTROLLER","CONTROL","CONSUMPTION","RELIABILITY","RELIABILITY","RELIABILITY","RELIABILITY","RELIABILITY"]},{"article":"50.pdf","title":"FILTERING OF A DISCRETE-TIME HMM-DRIVEN MULTIVARIATE ORNSTEIN-UHLENBECK MODEL WITH APPLICATION TO FORECASTING MARKET LIQUIDITY REGIMES ","authors":["ANTON TENYAKOV"," ROGEMAR MAMON"," MATT DAVISON"],"institutions":[],"abstract":"ABSTRACT—THIS PAPER INVESTIGATES THE MODELING OF RISK DUE TOMARKET AND FUNDING LIQUIDITY BY CAPTURING THE JOINT DYNAMICSOF THREE TIME SERIES: THE TREASURY-EURODOLLAR SPREAD, THE VIX,AND A METRIC DERIVED FROM THE S&P 500 SPREAD. WE PROPOSE ATWO-REGIME MEAN-REVERTING MODEL FOR EXPLAINING THE BEHAVIOUR OFTHREE TIME SERIES, WHICH MIRROR LIQUIDITY LEVELS FOR FINANCIAL MAR-KETS. AN EXPECTATION-MAXIMISATION ALGORITHM IN CONJUNCTION WITHMULTIVARIATE FILTERS IS EMPLOYED TO CONSTRUCT OPTIMAL PARAMETERESTIMATES OF THE PROPOSED MODEL. THE SELECTION OF THE MODELINGSET-UP IS JUSTIFIED BY BALANCING THE BEST-FIT CRITERION AND MODELCOMPLEXITY. THE MODEL PERFORMANCE IS DEMONSTRATED ON HISTORICALMARKET DATA, AND A DESCRIPTIVE ANALYSIS OF THE DIFFERENT LIQUIDITYMEASURES SHOWS THE PRESENCE OF CLEAR HIGH AND LOW STATES.","objective":["IN THIS PAPER, WE PROPOSE A METHOD OF QUANTIFYING ANDFORECASTING ILLIQUIDITY IN THE FINANCIAL MARKET","QUICKLY UPON THE ARRIVAL OF NEW DATA","THE MAIN PURPOSE OF THIS RESEARCH IS NOT TO ACCURATELY PREDICTTHE DYNAMICS OF INDIVIDUAL VARIABLES, BUT TO CAPTURE THE JOINTEFFECTS OF THESE VARIABLES TO FORECAST ILLIQUIDITY","IN THIS PAPER, WE COMBINE THE ABOVE-MENTIONED APPROACHES TOGENERATE REASONABLE INITIAL ESTIMATES"],"problem":"","methodology":["WE MADE CONTRIBUTIONS IN TERMS OF METHODOLOGY IN MODELLINGTHE REGIME SWITCHES IN A MULTIVARIATE OU MODEL AND UNDER-STANDING THE DYNAMICS OF LIQUIDITY","NOMIC RECOVERY","OR LIQUIDITY","THIS APPROACH PROVIDES A QUANTITATIVE METHODOLOGY THAT SUP-PORTS ECONOMIC INTERPRETATION OF OUR LIQUIDITY PROXY VARIABLES","UIDITY"],"contributes":"","references":["[1] A. ABIAD, \"EARLY WARNING SYSTEMS FOR CURRENCY CRISES: A REGIME-SWITCHING APPROACH,\" IN HIDDEN MARKOV MODELS IN FINANCE, R. MAMONAND R. ELLIOTT, EDS. NEW YORK, NY, USA: SPRINGER, 2007, PP. 155–184.[2] H. AKAIKE, \"A NEW LOOK AT THE STATISTICAL MODEL IDENTIFICATION,\" IEEETRANS. AUTOM. CONTROL, VOL. AC-19, NO. 6, PP. 716–723, DEC. 1974.","[2] H. AKAIKE, \"A NEW LOOK AT THE STATISTICAL MODEL IDENTIFICATION,\" IEEETRANS. AUTOM. CONTROL, VOL. AC-19, NO. 6, PP. 716–723, DEC. 1974.","[3] BANK OF INTERNATIONAL SETTLEMENT. (2010). GROUP OF GOVERNORS AND HEADSOF SUPERVISION ANNOUNCES HIGHER GLOBAL MINIMUM CAPITAL STANDARDS[ONLINE]. AVAILABLE: HTTP://WWW.BIS.ORG/PRESS/P100912.","[4] R. BIANCHI, M. DREW, AND T. WIJERATNE, \"SYSTEMIC RISK, THE TED SPREADAND HEDGE FUND RETURNS,\" INT. J. BUS. ECON., VOL. 1, NO. 1, PP. 59–78, 2009.","[5] N. BLOOM AND M. FLOETOTTO, \"GOOD NEWS AT LAST? THE RECESSION WILLBE OVER SOONER THAN YOU THINK,\" CENTRE FOR ECONOMIC POLICY RESEARCH,LONDON, U.K., 2009 [ONLINE]. AVAILABLE: HTTP://WWW.VOXEU.ORG/ARTICLE/GOOD-NEWS-LAST-RECESSION-WILL-BE-OVER-SOONER-YOU-THINK[6] K. BOUDT, E. PAULUS, AND R. ROSENTHAL, \"FUNDING LIQUIDITY, MARKET LIQ-UIDITY AND TED SPREAD: A TWO-REGIME MODEL,\" WORKING PAPER, 2010[ONLINE]. AVAILABLE: HTTP://DX.DOI.ORG/10.2139/SSRN.1668635","[6] K. BOUDT, E. PAULUS, AND R. ROSENTHAL, \"FUNDING LIQUIDITY, MARKET LIQ-UIDITY AND TED SPREAD: A TWO-REGIME MODEL,\" WORKING PAPER, 2010[ONLINE]. AVAILABLE: HTTP://DX.DOI.ORG/10.2139/SSRN.1668635[7] M. BRUNNERMEIER, \"DECIPHERING THE LIQUIDITY AND CREDIT CRUNCH 2007–2008,\" J. ECON. PERSPECT., VOL. 23, NO. 1, PP. 77–100, 2009.","[7] M. BRUNNERMEIER, \"DECIPHERING THE LIQUIDITY AND CREDIT CRUNCH 2007–2008,\" J. ECON. PERSPECT., VOL. 23, NO. 1, PP. 77–100, 2009.","[8] M. BRUNNERMEIER AND L. PEDERSEN, \"MARKET LIQUIDITY AND FUNDING LIQUID-ITY,\" REV. FINANCIAL STUD., VOL. 22, NO. 6, PP. 2201–2238, 2008.","[9] K. BULTEEL, T. WILDERJANS, F. TUERLINCKX, AND E. CEULEMANS, \"CHULL AS ANALTERNATIVE TO AIC AND BIC IN THE CONTEXT OF MIXTURES OF FACTOR ANALYZERS,\"BEHAV. RES. METHODS, VOL. 45, PP. 782–791, 2013.","[10] R. CAMPBELL, K. KOEDIJK, AND P. KOFMAN, \"INCREASED CORRELATION IN BEARMARKETS,\" FINANCIAL ANAL. J., VOL. 58, NO. 1, PP. 87–94, 2002.","[11] E. CEULEMANS AND H. KIERS, \"SELECTING AMONG THREE-MODE PRINCIPAL COM-PONENT MODELS OF DIFFERENT TYPES AND COMPLEXITIES: A NUMERICAL CONVEXHULL BASED METHOD,\" BRIT. J. MATH. STAT. PSYCHOL., VOL. 59, PP. 133–150,2006.","[12] P. DATE AND K. PONOMAREVA, \"LINEAR AND NONLINEAR FILTERING IN MATHEMAT-ICAL FINANCE: A REVIEW,\" IMA J. MANAGE. MATH., VOL. 22, PP. 195–211,2011.","[13] P. DATE, R. MAMON, AND A. TENYAKOV, \"FILTERING AND FORECASTING COM-MODITY FUTURES PRICES UNDER AN HMM FRAMEWORK,\" ENERGY ECON., VOL. 40,PP. 1001–1013, 2013.","[14] A. DEMPSTER, N. LAIRD, AND D. RUBIN, \"MAXIMUM LIKELIHOOD FROM INCOM-PLETE DATA VIA THE EM ALGORITHM,\" J. ROY. STAT. SOC. B, METHODOL., VOL. 39,NO. 1, PP. 1–38, 1977.","[15] G. DIONNE AND O. M. CHUN, \"DEFAULT AND LIQUIDITY REGIMES IN THE BONDMARKET DURING THE 2002-2012 PERIOD,\" CAN. J. ECON., VOL. 46, NO. 4,PP. 1160–1195, 2013.","[16] R. ELLIOTT, L. AGGOUN, AND J. MOORE, HIDDEN MARKOV MODELS: ESTIMATIONAND CONTROL. NEW YORK, NY, USA: SPRINGER, 1995.","[17] R. ELLIOTT, W. HUNTER, AND B. JAMIESON, \"FINANCIAL SIGNAL PROCESSING: ASELF-CALIBRATING MODEL,\" INT. J. THEOR. APPL. FINANCE, VOL. 4, PP. 567–584,2001.","[18] R. ELLIOTT AND C. WILSON, \"THE TERM STRUCTURE OF INTEREST RATES IN A HIDDENMARKOV SETTING,\" IN HIDDEN MARKOV MODELS IN FINANCE, R. MAMON ANDR. ELLIOTT, EDS. NEW YORK, NY, USA: SPRINGER, 2007.","[19] C. ERLWEIN AND R. MAMON, \"AN ONLINE ESTIMATION SCHEME FOR HULL-WHITEMODEL WITH HMM-DRIVEN PARAMETERS,\" STAT. METHODS APPL., VOL. 18, NO. 1,PP. 87–107, 2009.","[20] C. ERLWEIN, F. BENTH, AND R. MAMON, \"HMM FILTERING AND PARAMETER ESTI-MATION OF AN ELECTRICITY SPOT PRICE MODEL,\" ENERGY ECON., VOL. 32, NO. 5,PP. 1034–1043, 2010.","[21] C. ERLWEIN, R. MAMON, AND M. DAVISON, \"AN EXAMINATION OF HMM-BASED INVESTMENT STRATEGIES FOR ASSET ALLOCATION,\" APPL. STOCHASTIC MODELSBUS. IND., VOL. 27, PP. 204–221, 2011.","[22] G. GORTON, MISUNDERSTANDING FINANCIAL CRISES: WHY WE DON'T SEE THEMCOMING. LONDON, U.K.: OXFORD UNIV. PRESS, 2012.","[23] R. GOYENKO. (2013). TREASURY LIQUIDITY AND FUNDING LIQUIDITY:EVIDENCE FROM MUTUAL FUND RETURNS [ONLINE]. AVAILABLE:HTTP://DX.DOI.ORG/10.2139/SSRN.2023187[24] J. HAMILTON, TIME SERIES ANALYSIS. PRINCETON, NJ, USA: PRINCETON UNIV.PRESS, 1994.","[24] J. HAMILTON, TIME SERIES ANALYSIS. PRINCETON, NJ, USA: PRINCETON UNIV.PRESS, 1994.","[25] M. HARDY, \"A REGIME-SWITCHING MODEL OF LONG-TERM STOCK RETURNS,\" NORTHAMER. ACTUARIAL J., VOL. 6, NO. 1, PP. 171–173, 2002.","[26] N. HUGHES. (2005). A TRADE WAR WITH CHINA. FOREIGN AFFAIRS [ONLINE].AVAILABLE: HTTP://WWW.FOREIGNAFFAIRS.COM/ARTICLES/60825/NEIL-C-HUGHES/A-TRADE-WAR-WITH-CHINA[27] J. JAMES AND N. WEBBER, INTEREST RATE MODELLING. HOBOKEN, NJ, USA:WILEY, 2000.","[27] J. JAMES AND N. WEBBER, INTEREST RATE MODELLING. HOBOKEN, NJ, USA:WILEY, 2000.","[28] P. KRUGMAN, \"THE COINCIDENCE OF A LIBERAL—MISSION NOT ACCOM-PLISHED, NOT YET ANYWAY,\" NEW YORK TIMES, MAR. 12, 2008 [ONLINE].AVAILABLE: HTTP://KRUGMAN.BLOGS.NYTIMES.COM/2008/03/12/MISSION-NOT-ACCOMPLISHED-NOT-YET-ANYWAY/[29] F. LONGIN AND B. SOLNIK, \"EXTREME CORRELATION OF INTERNATIONAL EQUITYMARKETS,\" J. FINANCE, VOL. 56, NO. 2, PP. 649–676, 2001.","[29] F. LONGIN AND B. SOLNIK, \"EXTREME CORRELATION OF INTERNATIONAL EQUITYMARKETS,\" J. FINANCE, VOL. 56, NO. 2, PP. 649–676, 2001.","[30] L. MANCINI, A. RANALDO, AND J. WRAMPELMEYER. (2012). THE FOREIGNEXCHANGE MARKET: NOT AS LIQUID AS YOU MAY THINK [ONLINE]. AVAILABLE:HTTP://WWW.VOXEU.ORG/ARTICLE/FOREIGN-EXCHANGE-MARKET-NOT-LIQUID-YOU-MAY-THINK[31] G. SCHWARZ, \"ESTIMATING THE DIMENSION OF A MODEL,\" ANN. STATIST., VOL. 6,NO. 2, PP. 461–464, 1978.","[31] G. SCHWARZ, \"ESTIMATING THE DIMENSION OF A MODEL,\" ANN. STATIST., VOL. 6,NO. 2, PP. 461–464, 1978.","[32] S. SHREVE, STOCHASTIC CALCULUS FOR FINANCE II: CONTINUOUS TIME MODELS.NEW YORK, NY, USA: SPRINGER, 2004.","[33] R. SIPLEY, MARKET INDICATORS: THE BEST-KEPT SECRET TO MORE EFFECTIVETRADING AND INVESTING. NEW YORK, NY, USA: BLOOMBERG PRESS, 2009.","[34] J. W. VAN DER END AND M. TABBAE, \"WHEN LIQUIDITY RISK BECOMES A SYS-TEMIC ISSUE: EMPIRICAL EVIDENCE OF BANK BEHAVIOUR,\" J. FINANCIAL STAB.,VOL. 8, PP. 107–120, 2012.","[35] D. VAYANOS AND J. WAND, \"MARKET LIQUIDITY—THEORY AND EMPIRI-CAL EVIDENCE,\" IN HANDBOOK OF THE ECONOMICS OF FINANCE: FINANCIALMARKETS AND ASSET PRICING, G. CONSTANTINIDES, R. STULZ, AND M. HARRIS.AMSTERDAM, THE NETHERLANDS: ELSEVIER, 2013, PP. 1289–1361.","[36] X. XI AND R. MAMON, \"PARAMETER ESTIMATION OF AN ASSET PRICE MODELDRIVEN BY A WEAK HIDDEN MARKOV CHAIN,\" ECON. MODELL., VOL. 28, PP. 36–46, 2011.","[37] X. XI AND R. MAMON, \"YIELD CURVE MODELLING USING A MULTIVARIATE HIGHER-ORDER HMM,\" IN STATE-SPACE MODELS AND APPLICATIONS IN ECONOMICS ANDFINANCE, Y. ZENG AND S. WU, EDS. NEW YORK, NY, USA: SPRINGER, 2013,PP. 185–202.[38] N. ZHOU AND R. MAMON, \"AN ACCESSIBLE IMPLEMENTATION OF INTEREST RATEMODELS WITH MARKOV-SWITCHING,\" EXPERT SYST. APPL., VOL. 39, PP. 4679–","[38] N. ZHOU AND R. MAMON, \"AN ACCESSIBLE IMPLEMENTATION OF INTEREST RATEMODELS WITH MARKOV-SWITCHING,\" EXPERT SYST. APPL., VOL. 39, PP. 4679–4689, 2012."],"terms":["LIQUIDITY","MODEL","STATE","MARKET","SPREAD","PROCESS","FINANCIAL","REGIME","FILTERING","REGIME"]},{"article":"21.pdf","title":"MULTIOBJECTIVE INVESTMENT POLICY FOR A NONLINEAR STOCHASTIC FINANCIAL SYSTEM: A FUZZY APPROACH ","authors":["CHIEN-FENG WU"," BOR-SEN CHEN"," LIFE FELLOW"," WEIHAI ZHANG"],"institutions":[],"abstract":"ABSTRACT—THE FINANCIAL MARKET ALWAYS SUFFERS FROM CONTINUOUSAND DISCONTINUOUS (JUMP) CHANGES AND CAN BE REGARDED AS ANONLINEAR STOCHASTIC JUMP DIFFUSION SYSTEM. MOST INVESTORS EXPECTTHEIR INVESTMENT POLICIES TO BE NOT ONLY HIGHER BENEFITS BUT ALSOLOWER RISK AS A MULTIOBJECTIVE OPTIMIZATION PROBLEM (MOP). IN THISSTUDY, A MULTIOBJECTIVE H2 /H FUZZY INVESTMENT IS PROPOSED FORNONLINEAR STOCHASTIC JUMP DIFFUSION FINANCIAL SYSTEMS TO ACHIEVETHE DESIRED TARGET WITH MINIMUM INVESTMENT COST AND RISK INPARETO OPTIMAL SENSE, SIMULTANEOUSLY. THE TAKAGI–SUGENO (T–S)FUZZY MODEL IS USED TO APPROXIMATE THE NONLINEAR STOCHASTIC JUMPDIFFUSION FINANCIAL SYSTEM TO SIMPLIFY THE MULTIOBJECTIVE H2 /H INVESTMENT POLICY DESIGN PROCEDURE. BY THE HELP OF THE T–S FUZZYMODEL, THE MULTIOBJECTIVE H2 /H FUZZY INVESTMENT POLICY PROB-LEM OF NONLINEAR STOCHASTIC FINANCIAL SYSTEM CAN BE TRANSFORMEDTO A LINEAR-MATRIX-INEQUALITY-CONSTRAINED (LMI-CONSTRAINED)MOP TO AVOID SOLVING THE ANNOYING HAMILTON–JACOBI INEQUALITIES.BECAUSE THE LMI-CONSTRAINED MOP IS NOT EASY TO DIRECTLY CALCULATEITS PARETO OPTIMAL SOLUTIONS, AN INDIRECT METHOD IS PROPOSED TOSOLVE THIS MOP FOR THE MULTIOBJECTIVE H2 /H FUZZY INVESTMENTPOLICY DESIGN OF NONLINEAR STOCHASTIC JUMP DIFFUSION FINANCIALSYSTEMS. AN LMI-CONSTRAINED MULTIOBJECTIVE EVOLUTION ALGORITHM(LMI-CONSTRAINED MOEA) IS ALSO DEVELOPED TO EFFICIENTLY SOLVETHE PARETO OPTIMAL SOLUTIONS OF THE LMI-CONSTRAINED MOP FORTHE MULTIOBJECTIVE H2 /H FUZZY INVESTMENT POLICY DESIGN OFNONLINEAR STOCHASTIC JUMP DIFFUSION FINANCIAL SYSTEMS. WHEN THEPARETO OPTIMAL REGULATION SOLUTIONS ARE SOLVED BY THE PROPOSEDLMI-CONSTRAINED MOEA, INVESTORS CAN SELECT ONE INVESTMENTPOLICY TO ACHIEVE THEIR DESIRED TARGET WITH MINIMUM INVESTMENTCOST AND RISK ACCORDING TO HIS/HER OWN PREFERENCE.","objective":["IT IS NECESSARY TO NOTE THAT IN THIS PAPER, WE ASSUME ALL THE EMER-GENCIAL INCIDENTS ARE MUTUALLY EXCLUSIVE EVENT (I"],"problem":"","methodology":[],"contributes":"","references":["[1] J. H. MA AND Y. S. CHEN, \"STUDY FOR THE BIFURCATION TOPOLOGICAL STRUCTUREAND THE GLOBAL COMPLICATED CHARACTER OF A KIND OF NONLINEAR FINANCE SYSTEM(I),\" APPL. MATH. MECH., VOL. 22, NO. 11, PP. 1240–1251, 2001.","[2] J. H. MA AND Y. S. CHEN, \"STUDY FOR THE BIFURCATION TOPOLOGICAL STRUCTUREAND THE GLOBAL COMPLICATED CHARACTER OF A KIND OF NONLINEAR FINANCE SYSTEM(II),\" APPL. MATH. MECH., VOL. 22, NO. 11, PP. 1240–1251, 2001.","[3] S. H. STROGATZ, NONLINEAR DYNAMICS AND CHAOS: WITH APPLICATIONS TOPHYSICS, BIOLOGY, CHEMISTRY, AND ENGINEERING. READING, MA, USA:ADDISON-WESLEY, 1994.","[4] H. W. LORENZ, NONLINEAR ECONOMIC DYNAMICS AND CHAOTIC MOTION. NEWYORK, NY, USA: SPRINGER, 1993.","[5] W. C. CHEN, \"NONLINEAR DYNAMICS AND CHAOS IN A FRACTIONAL-ORDER FINANCIALSYSTEM,\" CHAOS, SOLITONS FRACTALS, VOL. 36, NO. 5, PP. 1305–1314, 2008.","[6] B. ØKSENDAL AND A. SULEM, APPLIED STOCHASTIC CONTROL OF JUMP DIFFUSIONS,2ND ED. BERLIN, GERMANY: SPRINGER, 2007.","[7] F. HANSON, APPLIED STOCHASTIC PROCESSES AND CONTROL FOR JUMP-DIFFUSIONS:MODELING, ANALYSIS AND COMPUTATION, 2ND ED. PHILADELPHIA, PA, USA:SIAM, 2007.","[8] N. C. FRAMSTAD, B. ØKSENDAL, AND A. SULEM, \"OPTIMAL CONSUMPTION ANDPORTFOLIO IN A JUMP DIFFUSION MARKET WITH PROPORTIONAL TRANSACTION COSTS,\"J. MATH. ECON., VOL. 35, PP. 233–257, APR. 2001.","[9] R. CONT AND P. TANKOV, FINANCIAL MODELLING WITH JUMP PROCESSES. BOCARATON, FL, USA: CRC PRESS, 2004.","[10] I. PAN, S. DAS, AND S. DAS, \"MULTI-OBJECTIVE ACTIVE CONTROL POLICY DESIGNFOR COMMENSURATE AND INCOMMENSURATE FRACTIONAL ORDER CHAOTIC FINANCIALSYSTEMS,\" APPL. MATH. MODEL., VOL. 39, NO. 2, PP. 500–514, 2015.","[11] B. S. CHEN, C. S. TSENG, AND H. J. UANG, \"ROBUSTNESS DESIGN OF NONLIN-EAR DYNAMIC SYSTEMS VIA FUZZY LINEAR CONTROL,\" IEEE TRANS. FUZZY SYST.,VOL. 7, NO. 5, PP. 571–585, OCT. 1999.","[12] C. S. TSENG, B. S. CHEN, AND H. J. UANG, \"FUZZY TRACKING CONTROL DESIGNFOR NONLINEAR DYNAMIC SYSTEMS VIA T-S FUZZY MODEL,\" IEEE TRANS. FUZZYSYST., VOL. 9, NO. 3, PP. 381–392, JUN. 2001.","[13] F. L. LEWIS, L. XIE, AND D. POPA, OPTIMAL AND ROBUST ESTIMATION: WITH ANINTRODUCTION TO STOCHASTIC CONTROL THEORY. BOCA RATON, FL, USA: CRCPRESS, 2008.","[14] D. P. BERTSEKAS AND S. E. SHREVE, STOCHASTIC OPTIMAL CONTROL: THE DISCRETETIME CASE, VOL. 139. NEW YORK, NY, USA: ACADEMIC, 1978.","[15] R. F. STENGEL, STOCHASTIC OPTIMAL CONTROL: THEORY AND APPLICATION. HOBO-KEN, NJ, USA: WILEY, 1986.","[16] R. L. HAUPT AND S. E. HAUPT, PRACTICAL GENETIC ALGORITHMS, 2ND ED. NEWYORK, NY, USA: WILEY, 2004.","[17] S. H. ZAK, SYSTEM AND CONTROL. NEW YORK, NY, USA: OXFORD UNIV. PRESS,2003[18] K. TANAKA AND H. O. WANG, FUZZY CONTROL SYSTEMS DESIGN AND ANALYSIS:A LINEAR MATRIX INEQUALITY APPROACH. NEW YORK, NY, USA: WILEY, 2001.","[18] K. TANAKA AND H. O. WANG, FUZZY CONTROL SYSTEMS DESIGN AND ANALYSIS:A LINEAR MATRIX INEQUALITY APPROACH. NEW YORK, NY, USA: WILEY, 2001.","[19] H. C. SUNG, D. W. KIM, J. B. PARK, AND Y. H. JOO, \"ROBUST DIGITAL CONTROL OFFUZZY SYSTEMS WITH PARAMETRIC UNCERTAINTIES: LMI-BASED DIGITAL REDESIGNAPPROACH,\" FUZZY SETS SYS., VOL. 161, PP. 919–933, 2010.","[20] C. S. TSENG AND C. K. HWANG, \"FUZZY OBSERVER-BASED FUZZY CONTROL DESIGNFOR NONLINEAR SYSTEMS WITH PERSISTENT BOUNDED DISTURBANCES,\" FUZZY SETSSYST., VOL. 158, NO. 2, PP. 164–179, JAN. 2007.","[21] R. KHASMINSKII AND G. N. MILSTEIN, STOCHASTIC STABILITY OF DIFFERENTIALEQUATIONS, 2ND ED. BERLIN, GERMANY: SPRINGER, 2011.","[22] S. BOYD, L. EL GHAOUI, E. FERON, AND V. BALAKRISHNAN, LINEAR MATRIXINEQUALITIES IN SYSTEM AND CONTROL THEORY. PHILADELPHIA, PA, USA: SIAM,1994.","[23] B. S. CHEN AND W. ZHANG, \"STOCHASTIC H2 /H CONTROL WITH STATE DEPEN-DENT NOISE,\" IEEE TRANS. AUTOMAT. CONTROL, VOL. 49, NO. 1, PP. 45–57, JAN.2004.","[24] D. HINRICHSEN AND A. PRITCHARD, \"STOCHASTIC H ,\" SIAM J. CONTROL OPTIM.,VOL. 36, PP. 1504–1538, 1998[25] X. LIN AND R. ZHANG, \"H CONTROL FOR STOCHASTIC SYSTEMS WITH POISSONJUMPS,\" J. SYST. SCI. COMPLEXITY, VOL. 24, NO. 4, PP. 683–700, 2011.","[25] X. LIN AND R. ZHANG, \"H CONTROL FOR STOCHASTIC SYSTEMS WITH POISSONJUMPS,\" J. SYST. SCI. COMPLEXITY, VOL. 24, NO. 4, PP. 683–700, 2011.","[26] G. CHEN, G. CHEN, AND S. H. HSU, LINEAR STOCHASTIC CONTROL SYSTEMS.BOCA RATON, FL, USA: CRC PRESS, 1995.","[27] G. P. LIU, J. B. YANG, AND J. F. WHIDBORNE, MULTIOBJECTIVE OPTIMISATION &CONTROL. HERTFORDSHIRE, U.K.: RSP LTD, 2002[28] L. RACHMAWATI AND D. SRINIVASAN,\"MULTIOBJECTIVE EVOLUTIONARY ALGORITHMWITH CONTROLLABLE FOCUS ON THE KNEES OF THE PARETO FRONT,\" IEEE TRANS.EVOL. COMPUT., VOL. 13, NO. 4, PP. 810–824, AUG. 2009.","[28] L. RACHMAWATI AND D. SRINIVASAN,\"MULTIOBJECTIVE EVOLUTIONARY ALGORITHMWITH CONTROLLABLE FOCUS ON THE KNEES OF THE PARETO FRONT,\" IEEE TRANS.EVOL. COMPUT., VOL. 13, NO. 4, PP. 810–824, AUG. 2009.","[29] K. DEB, MULTI-OBJECTIVE OPTIMIZATION USING EVOLUTIONARY ALGORITHMS, 1STED. CHICHESTER, U.K.: WILEY, 2001.","[30] K. DEB, A. PRATAP, S. AGARWAL, AND T. MEYARIVAN, \"A FAST AND ELITISTMULTIOBJECTIVE GENETIC ALGORITHM: NSGA-II,\" IEEE TRANS. EVOL. COMPUT.,VOL. 6, NO. 2, PP. 182–197, APR. 2002.","[31] A. ABRAHAM, L. C. JAIN, AND R. GOLDBERG, EVOLUTIONARY MULTIOBJECTIVEOPTIMIZATION: THEORETICAL ADVANCES AND APPLICATIONS. NEW YORK, NY,USA: SPRINGER, 2005.","[32] E. BRANKE, K. DEB, H. DIEROLF, AND M. OSSWALD, \"FINDING KNEES INMULTI-OBJECTIVE OPTIMIZATION,\" PARALLEL PROBLEM SOLVING NATURE, VOL. 3242,PP. 722–731, 2004.","[33] W. H. ZHANG AND G. FENG, \"NONLINEAR STOCHASTIC H2 /H CONTROL WITH (X,U, V)-DEPENDENT NOISE: INFINITE HORIZON CASE,\" IEEE TRANS. AUTOM. CONTROL,VOL. 53, NO. 5, PP. 1323–1328, JUN. 2008.","[34] B. S. CHEN, C. S. TSENG, AND H. J. UANG, \"MIXED H2 /H FUZZY OUTPUTFEEDBACK CONTROL FOR NONLINEAR DYNAMIC SYSTEMS: AN LMI APPROACH,\" IEEETRANS. FUZZY SYST., VOL. 8, NO. 3, PP. 249–265, JUN. 2000.","[35] B. S. CHEN, H. C. LEE, AND C. F. WU, \"PARETO OPTIMAL FILTER DESIGN FORNONLINEAR STOCHASTIC FUZZY SYSTEMS VIA MULTIOBJECTIVE OPTIMIZATION,\" IEEETRANS. FUZZY SYST., VOL. 23, NO. 2, PP. 387–399, APR. 2015.","[36] A. GULISASHVILI, ANALYTICALLY TRACTABLE STOCHASTIC STOCK PRICE MODELS.NEW YORK, NY, USA: SPRINGER, 2012.","[37] E. M. STEIN AND J. C. STEIN, \"STOCK PRICE DISTRIBUTIONS WITH STOCHASTICVOLATILITY: AN ANALYTIC APPROACH,\" REV. FINANCIAL STUD., 4.4, PP. 727–752,1991.","[38] J. STOYANOV, \"STOCHASTIC FINANCIAL MODELS,\" J. ROY. STATIST. SOC.: SER. A(STATIST. SOC.) VOL. 174, NO. 2, PP. 510–511, 2011.","[39] H. ZHANG, H. YAN, F. YANG, AND Q. CHEN, \"QUANTIZED CONTROL DESIGN FORIMPULSIVE FUZZY NETWORKED SYSTEMS,\" IEEE TRANS. FUZZY SYST., VOL. 19,NO. 6, PP. 1153–1162, DEC. 2011.","[40] H. K. LAM, \"LMI-BASED STABILITY ANALYSIS FOR FUZZY-MODEL-BASED CON-TROL SYSTEMS USING ARTIFICIAL T–S FUZZY MODEL,\" IEEE TRANS. FUZZY SYST.,VOL. 19, NO. 3, PP. 505–513, JUN. 2011.","[41] D. HASAN, N. GÜZEL, AND M. SIVRI, \"A FUZZY SET-BASED APPROACHTO MULTI-OBJECTIVE MULTI-ITEM SOLID TRANSPORTATION PROBLEM UNDER UN-CERTAINTY,\" INT. J. FUZZY SYST., PP. 1–14, 2015."],"terms":["SYSTEM","STOCHASTIC","FINANCIAL","INVESTMENT","NONLINEAR","POLICY","FUZZY","MULTIOBJECTIVE","PARETO","DIFFUSION"]},{"article":"49.pdf","title":"DATA-DRIVEN STOCHASTIC PRICING AND APPLICATION TO ELECTRICITY MARKET ","authors":["SAAHIL SHENOY"," DIMITRY GORINEVSKY"," FELLOW"],"institutions":[],"abstract":"ABSTRACT—THIS PAPER DEVELOPS A NOVEL APPROACH TO COMPUTATIONOF THE PROBABILITY INTEGRALS ENCOUNTERED IN DERIVATIVE PRICINGUSING STOCHASTIC MODELS ESTIMATED FROM HISTORICAL DATA. FIRST,NONPARAMETRIC PROBABILITY DISTRIBUTION MODELS ARE BUILT DIRECTLYFROM THE DATA AS A SOLUTION OF A CONVEX OPTIMIZATION PROBLEMSCALABLE TO VERY BIG DATASETS. SECOND, THESE MODELS ARE USED FORNUMERICAL CALCULUS OF PROBABILITY INTEGRALS, WHERE THE QUADRATUREINCLUDES LONG TAILS OF THE PROBABILITY DISTRIBUTIONS. THE APPLICATIONEXAMPLE IS THE PROCUREMENT CONTRACT IN THE DAY-AHEAD BULK MARKETFOR ELECTRICITY. THE DATA FOR PJM UTILITY LOADS AND PRICES IN THE DAY-AHEAD AND SPOT MARKETS WERE USED TO ESTIMATE THE RISK AND TO PRICETHE CONTRACT. THE DATA-DRIVEN FORWARD CONTRACT PRICING ALLOWS TOOPTIMIZE THE CONTRACT COST AND REDUCE IT BY 2% COMPARED TO THEBASELINE; THIS CORRESPONDS TO ABOUT $0.6B/YEAR IN POTENTIAL UTILITYSAVINGS.","objective":[],"problem":"","methodology":["DEMONSTRATES APPLICATIONS OF THE METHODOLOGY TO THE MOTIVATINGEXAMPLE OF THE LOAD FOLLOWING CONTRACTS IN THE ELECTRICITY MARKET","FIG","THIS SECTION APPLIES THE DEVELOPED METHODOLOGY TO A FEWPROBLEMS RELATED TO THE DESCRIBED DAY-AHEAD ELECTRICITY PRO-CUREMENT SETUP"],"contributes":"","references":["[1] K. VARSHNEY AND A. MOJSILOVIC, \"BUSINESS ANALYTICS BASED ON FINANCIALTIME SERIES,\" IEEE SIGNAL PROCESS. MAG., VOL. 28, NO. 5, PP. 83–93,SEP. 2011.","[2] F. BLACK AND M. SCHOLES, \"THE PRICING OF OPTIONS AND CORPORATE LIABILITIES,\"J. POLITICAL ECONOMY, VOL. 81, NO. 3, PP. 637–654, 1973.","[3] M. CARRIÓN, A. B. PHILPOTT, A. J. CONEJO, AND J. M. ARROYO, \"A STOCHAS-TIC PROGRAMMING APPROACH TO ELECTRIC ENERGY PROCUREMENT FOR LARGE CON-SUMERS,\" IEEE TRANS. POWER SYST., VOL. 22, NO. 2, PP. 744–754, MAY 2007.","[4] N. SECOMANDI AND S. KEKRE, \"OPTIMAL ENERGY PROCUREMENT IN SPOT ANDFORWARD MARKETS,\" MANUF. SERV. OPER. MANAG., VOL. 16, NO. 2, PP. 270–282,2014.","[5] F. E. BENTH, J. S. BENTH, AND S. KOEKEBAKKER, STOCHASTIC MODELLING OFELECTRICITY AND RELATED MARKETS, VOL. 11. SINGAPORE: WORLD SCIENTIFIC,2008.","[6] M. STUTZER, \"A SIMPLE NONPARAMETRIC APPROACH TO DERIVATIVE SECURITY VAL-UATION,\" J. FINANCE, VOL. 51, NO. 5, PP. 1633–1652, 1996.","[7] Y. AÏT-SAHALIA AND A. W. LO, \"NONPARAMETRIC ESTIMATION OF STATE-PRICEDENSITIES IMPLICIT IN FINANCIAL ASSET PRICES,\" J. FINANCE, VOL. 53, NO. 2,PP. 499–547, 1998.","[8] P. DIKO, S. LAWFORD, AND V. LIMPENS, \"RISK PREMIA IN ELECTRICITY FOR-WARD PRICES,\" STUD. NONLINEAR DYN. ECONOMETRICS, VOL. 10, NO. 3, 2006,ART. NO. 7.[9] E. HJALMARSSON, \"DOES THE BLACK–SCHOLES FORMULA WORK FOR ELECTRIC-ITY MARKETS? A NONPARAMETRIC APPROACH,\" UNIV. GOTHENBURG, DEPT. ECO-NOMICS, GOTHENBURG, SWEDEN, WORKING PAPERS IN ECONOMICS, NO. 101,","[9] E. HJALMARSSON, \"DOES THE BLACK–SCHOLES FORMULA WORK FOR ELECTRIC-ITY MARKETS? A NONPARAMETRIC APPROACH,\" UNIV. GOTHENBURG, DEPT. ECO-NOMICS, GOTHENBURG, SWEDEN, WORKING PAPERS IN ECONOMICS, NO. 101,2003.","[10] L. MELIGKOTSIDOU, I. D. VRONTOS, AND S. D. VRONTOS, \"QUANTILE REGRES-SION ANALYSIS OF HEDGE FUND STRATEGIES,\" J. EMPIR. FINANCE, VOL. 16, NO. 2,PP. 264–279, 2009.","[11] M. L. BARNES AND A. T. W. HUGHES, \"A QUANTILE REGRESSION ANALYSIS OFTHE CROSS SECTION OF STOCK MARKET RETURNS,\" FEDERAL RESERVE BANK BOSTON,BOSTON, MA, USA, WORKING PAPER, NO. 02-2, 2002.","[12] I.-C. TSAI, \"THE RELATIONSHIP BETWEEN STOCK PRICE INDEX AND EXCHANGE RATEIN ASIAN MARKETS: A QUANTILE REGRESSION APPROACH,\" J. INT. FINANC. MARKETS,INST. MONEY, VOL. 22, NO. 3, PP. 609–621, 2012.","[13] K. YU, Z. LU, AND J. STANDER, \"QUANTILE REGRESSION: APPLICATIONS ANDCURRENT RESEARCH AREAS,\" J. ROYAL STAT. SOC. D (THE STATISTICIAN), VOL. 52,NO. 3, PP. 331–350, 2003.","[14] I. TAKEUCHI, K. NOMURA, AND T. KANAMORI, \"NONPARAMETRIC CONDI-TIONAL DENSITY ESTIMATION USING PIECEWISE-LINEAR SOLUTION PATH OF KER-NEL QUANTILE REGRESSION,\" NEURAL COMPUT., VOL. 21, NO. 2, PP. 533–559,2009.","[15] J. W. TAYLOR, \"A QUANTILE REGRESSION NEURAL NETWORK APPROACH TO ESTIMATINGTHE CONDITIONAL DENSITY OF MULTIPERIOD RETURNS,\" JOURNAL OF FORECASTING,VOL. 19, NO. 4, PP. 299–311, 2000.","[16] F. ASNICAR, \"OPTIMIZATION OF ELECTRICITY RESERVED CAPACITY,\" PH.D.DISSERTATION, TECH. UNIV. DENMARK, KONGENS LYNGBY, DENMARK,2006.","[17] S. ARORA AND J. W. TAYLOR, \"FORECASTING ELECTRICITY SMART METER DATA US-ING CONDITIONAL KERNEL DENSITY ESTIMATION,\" OMEGA, VOL. 59, PP. 47–59,2016.","[18] S. BENTAIEB, R. HUSER, R. J. HYNDMAN, AND M. G. GENTON, \"FORECASTINGUNCERTAINTY IN ELECTRICITY SMART METER DATA BY BOOSTING ADDITIVE QUANTILEREGRESSION,\" IEEE TRANS. SMART GRID, TO BE PUBLISHED.[19] S.-K. CHAO, W. K. HÄRDLE, AND W. WANG, \"QUANTILE REGRESSION IN RISKCALIBRATION,\" IN HANDBOOK OF FINANCIAL ECONOMETRICS AND STATISTICS. NEWYORK, NY, USA: SPRINGER, 2015, PP. 1467–1489.","[19] S.-K. CHAO, W. K. HÄRDLE, AND W. WANG, \"QUANTILE REGRESSION IN RISKCALIBRATION,\" IN HANDBOOK OF FINANCIAL ECONOMETRICS AND STATISTICS. NEWYORK, NY, USA: SPRINGER, 2015, PP. 1467–1489.","[20] Y. FAN, W. K. HÄRDLE, W. WANG, AND L. ZHU, \"COMPOSITE QUANTILE RE-GRESSION FOR THE SINGLE-INDEX MODEL\", HUMBOLDT-UNIVERSITÄT ZU BERLIN,WIRTSCHAFTSWISSENSCHAFTLICHE FAKULTÄT, TECH. REP., 2013.","[21] M. BERNARDI ET AL., \"BAYESIAN TAIL RISK INTERDEPENDENCE USING QUANTILEREGRESSION,\" BAYESIAN ANAL., VOL. 10, NO. 3, PP. 553–603, 2015.","[22] V. A. EPANECHNIKOV, \"NON-PARAMETRIC ESTIMATION OF A MULTIVARIATE PROB-ABILITY DENSITY,\" THEORY PROBAB. APPL., VOL. 14, NO. 1, PP. 153–158,1969.","[23] R. KOENKER, P. NG, AND S. PORTNOY, \"QUANTILE SMOOTHING SPLINES,\"BIOMETRIKA, VOL. 81, NO. 4, PP. 673–680, 1994.","[24] I. TAKEUCHI, Q. V. LE, T. D. SEARS, AND A. J. SMOLA, \"NONPARAMETRICQUANTILE ESTIMATION,\" J. MACH. LEARN. RES., VOL. 7, PP. 1231–1264, 2006.","[25] X. HE, \"QUANTILE CURVES WITHOUT CROSSING,\" AMER. STATIST., VOL. 51, NO. 2,PP. 186–192, 1997.","[26] J. ZHUANG, I. W. TSANG, AND S. C. HOI, \"A FAMILY OF SIMPLE NON-PARAMETRICKERNEL LEARNING ALGORITHMS,\" J. MACH. LEARN. RES., VOL. 12, PP. 1313–1347,2011.","[27] J. V. ROSENBERG, \"NONPARAMETRIC PRICING OF MULTIVARIATE CONTINGENTCLAIMS,\" J. DERIVATIVES, VOL. 10, PP. 9–26, 2003.","[28] E. JONDEAU, S.-H. POON, AND M. ROCKINGER, FINANCIAL MODELING UNDERNON-GAUSSIAN DISTRIBUTIONS. NEW YORK, NY, USA: SPRINGER, 2007.","[29] P. EMBRECHTS AND H. SCHMIDLI, \"MODELLING OF EXTREMAL EVENTS IN INSURANCEAND FINANCE,\" ZEITSCHRIFT FÜR OPER. RES., VOL. 39, NO. 1, PP. 1–34, 1994.","[30] A. J. MCNEIL, \"ESTIMATING THE TAILS OF LOSS SEVERITY DISTRIBUTIONS USINGEXTREME VALUE THEORY,\" ASTIN BULL., VOL. 27, NO. 01, PP. 117–137, 1997.","[31] L. K. HOTTA, E. C. LUCAS, AND H. P. PALARO, \"ESTIMATION OF VAR USINGCOPULA AND EXTREME VALUE THEORY,\" MULTINAT. FINANCE J., VOL. 12, NOS. 3/4,PP. 205–218, 2008.","[32] A. J. MCNEIL, \"EXTREME VALUE THEORY FOR RISK MANAGERS,\" DEPARTEMENTMATHEMATIK, ETH ZENTRUM, ZURICH, SWITZERLAND, 1999.","[33] S. SHENOY AND D. GORINEVSKY, \"ESTIMATING LONG TAIL MODELS FOR RISK TRENDS,\"IEEE SIGNAL PROCESS. LETT., VOL. 22, NO. 7, PP. 968–972, JUL. 2015.","[34] H. N. BYSTRÖM, \"EXTREME VALUE THEORY AND EXTREMELY LARGE ELECTRIC-ITY PRICE CHANGES,\" INT. REV. ECON. FINANCE, VOL. 14, NO. 1, PP. 41–55,2005.","[35] S. SHENOY, D. GORINEVSKY, AND S. BOYD, \"NON-PARAMETRIC REGRESSION MOD-ELING FOR STOCHASTIC OPTIMIZATION OF POWER MARKET FORECAST,\" PRESENTED ATTHE AMERICAN CONTROL CONF., CHICAGO, IL, USA, JUL. 2015.","[36] S. SHENOY AND D. GORINEVSKY, \"STOCHASTIC OPTIMIZATION OF POWER MARKETFORECAST USING NON-PARAMETRIC REGRESSION MODELS,\" IN PROC. IEEE POWERENERGY SYST., 2015, PP. 1–5.[37] R. CARMONA AND V. DURRLEMAN, \"PRICING AND HEDGING SPREAD OPTIONS,\"SIAM REV., VOL. 45, NO. 4, PP. 627–685, 2003.","[37] R. CARMONA AND V. DURRLEMAN, \"PRICING AND HEDGING SPREAD OPTIONS,\"SIAM REV., VOL. 45, NO. 4, PP. 627–685, 2003.","[38] R. KOENKER, QUANTILE REGRESSION (ECONOMETRIC SOCIETY MONOGRAPHS).CAMBRIDGE, U.K.: CAMBRIDGE UNIV. PRESS, 2005.","[39] N. PARIKH AND S. BOYD, \"BLOCK SPLITTING FOR DISTRIBUTED OPTIMIZATION,\"MATH. PROGRAM. COMPUT., VOL. 6, NO. 1, PP. 77–102, 2014.","[40] L. DE HAAN AND A. FERREIRA, EXTREME VALUE THEORY: AN INTRODUCTION. NEWYORK, NY, USA: SPRINGER, 2006.","[41] METERED LOAD DATA, PJM, NORRISTOWN, PA, USA. [ONLINE]. AVAILABLE:HTTP://WWW.PJM.COM/MARKETS-AND-OPERATIONS/OPS-ANALYSIS/HISTORICAL-LOAD- DATA.ASPX[42] ENERGY PRICING, PJM, NORRISTOWN, PA, USA. [ONLINE]. AVAILABLE:HTTPS://DATAMINER.PJM.COM/DATAMINERUI/PAGES/PUBLIC/ENERGYPRICING.JSF[43] M. ROSENBLATT, \"REMARKS ON A MULTIVARIATE TRANSFORMATION,\" ANNALS MATH.","[42] ENERGY PRICING, PJM, NORRISTOWN, PA, USA. [ONLINE]. AVAILABLE:HTTPS://DATAMINER.PJM.COM/DATAMINERUI/PAGES/PUBLIC/ENERGYPRICING.JSF[43] M. ROSENBLATT, \"REMARKS ON A MULTIVARIATE TRANSFORMATION,\" ANNALS MATH.STAT., VOL. 23, NO. 3, PP. 470–472, 1952.","[43] M. ROSENBLATT, \"REMARKS ON A MULTIVARIATE TRANSFORMATION,\" ANNALS MATH.STAT., VOL. 23, NO. 3, PP. 470–472, 1952.","[44] J. GEWEKE AND G. AMISANO, \"COMPARING AND EVALUATING BAYESIAN PRE-DICTIVE DISTRIBUTIONS OF ASSET RETURNS,\" INT. J. FORECAST., VOL. 26, NO. 2,PP. 216–230, 2010.","[45] S. SHENOY AND D. GORINEVSKY, \"RISK ADJUSTED FORECASTING OF ELECTRICPOWER LOAD,\" IN PROC. AMER. CONTROL CONF., PORTLAND, OR, USA, 2014,PP. 914–919.[46] NERC, \"2013 SUMMER RELIABILITY ASSESSMENT,\" TECH. REP., MAY 2013.","[46] NERC, \"2013 SUMMER RELIABILITY ASSESSMENT,\" TECH. REP., MAY 2013.SAAHIL SHENOY (SM'14) IS WORKING TOWARD THEPH.D. DEGREE IN PHYSICS AT STANFORD UNIVERSITY, STAN-FORD, CA, USA, WHERE HE IS AN ARCS FOUNDATIONSCHOLAR. HE COMPLETED THE MS REQUIREMENTS IN PAR-TICLE PHYSICS AT THE AGE OF 20. HIS STANFORD RESEARCHIS IN BIG DATA ANALYTICS FOR EXTREME EVENTS, WITH AP-"],"terms":["QUANTILE","MODEL","WHERE","MODELS","SECTION","CONTRACT","DISTRIBUTION","PRICING","PROBABILITY","INTEGRAL"]},{"article":"48.pdf","title":"AN ENVIRONMENT FOR RAPID DERIVATIVES DESIGN AND EXPERIMENTATION ","authors":["DANNY CROOKES"," SEAN TRAINOR"," RICHARD JIANG"],"institutions":[],"abstract":"ABSTRACT—IN THE HIGHLY COMPETITIVE WORLD OF MODERN FINANCE,NEW DERIVATIVES ARE CONTINUALLY REQUIRED TO TAKE ADVANTAGE OFCHANGES IN FINANCIAL MARKETS, AND TO HEDGE BUSINESSES AGAINST NEWRISKS. THE RESEARCH DESCRIBED IN THIS PAPER AIMS TO ACCELERATE THEDEVELOPMENT AND PRICING OF NEW DERIVATIVES IN TWO DIFFERENT WAYS.FIRST, NEW DERIVATIVES CAN BE SPECIFIED MATHEMATICALLY WITHIN AGENERAL FRAMEWORK, ENABLING NEW MATHEMATICAL FORMULAE TO BESPECIFIED RATHER THAN JUST NEW PARAMETER SETTINGS. THIS GENERICPRICING ENGINE (GPE) IS EXPRESSIVELY POWERFUL ENOUGH TO SPECIFYA WIDE RANGE OF STANDARD PRICING ENGINES. SECOND, THE ASSOCIATEDPRICE SIMULATION USING THE MONTE CARLO METHOD IS ACCELERATED US-ING GPU OR MULTICORE HARDWARE. THE PARALLEL IMPLEMENTATION (INOPENCL) IS AUTOMATICALLY DERIVED FROM THE MATHEMATICAL DESCRIP-TION OF THE DERIVATIVE. AS A TEST, FOR A BASKET OPTION PRICING ENGINE(BOPE) GENERATED USING THE GPE, ON THE LARGEST PROBLEM SIZE, ANNVIDIA GPU RUNS THE GENERATED PRICING ENGINE AT 45 TIMES THESPEED OF A SEQUENTIAL, SPECIFIC HAND-CODED IMPLEMENTATION OF THESAME BOPE. THUS, A USER CAN MORE RAPIDLY DEVISE, SIMULATE, ANDEXPERIMENT WITH NEW DERIVATIVES WITHOUT ACTUAL PROGRAMMING","objective":[],"problem":"","methodology":[],"contributes":"","references":["[1] S. M. BARTRAM, G. W. BROWN, AND F. R. FEHLE, \"INTERNATIONAL EVI-DENCE ON FINANCIAL DERIVATIVES USAGE,\" FINANCIAL MANAGE., VOL. 38, NO. 1,PP. 185–206, 2009.","[2] A. DEVENOW AND I. WELCH, \"RATIONAL HERDING IN FINANCIAL ECONOMICS,\" EUR.ECON. REV., VOL. 40, PP. 603–615, 1996.","[3] F. BLACK AND M. SCHOLES, \"THE PRICING OF OPTIONS AND CORPORATE LIABILITIES,\"J. POLITICAL ECONOMY, VOL. 81, PP. 637–654, 1973.","[4] L. H. EDERINGTON AND W. GUAN, \"WHY ARE THOSE OPTIONS SMILING?\"J. DERIVATIVES, VOL. 10, NO. 2, PP. 9–34, 2002.","[5] O. A. VASICEK, \"AN EQUILIBRIUM CHARACTERIZATION OF THE TERM STRUCTURE,\"J. FINANCIAL ECON., VOL. 5, PP. 177–188, 1977.","[6] J. C. COX, J. E. INGERSOLL, AND S. A. ROSS, \"A THEORY OF THE TERM STRUCTUREOF INTEREST RATES,\" ECONOMETRICA, VOL. 53, PP. 129–151, 1985.","[7] J. C. HULL, OPTIONS, FUTURES AND OTHER DERIVATIVES, 8TH ED. BOSTON, MA,USA: PRENTICE-HALL, 2012.","[8] P. GLASSERMAN, MONTE CARLO METHODS IN FINANCIAL ENGINEERING. NEWYORK, NY, USA: SPRINGER-VERLAG, 2004, P. 548.[9] S. I. HESTON, \"A CLOSED-FORM SOLUTION FOR OPTIONS WITH STOCHASTIC VOLATILITYWITH APPLICATIONS TO BOND AND CURRENCY OPTIONS,\" REV. FINANCIAL STUD.,VOL. 6, PP. 327–343, 1993.","[9] S. I. HESTON, \"A CLOSED-FORM SOLUTION FOR OPTIONS WITH STOCHASTIC VOLATILITYWITH APPLICATIONS TO BOND AND CURRENCY OPTIONS,\" REV. FINANCIAL STUD.,VOL. 6, PP. 327–343, 1993.","[10] D. DUFFIE AND R. KAN, \"A YIELD-FACTOR MODEL OF INTEREST RATES,\" MATH.FINANCE, VOL. 6, NO. 4, PP. 379–406, 1996.","[11] B. OKSENDAL, \"THE ITO FORMULA AND THE MARTINGALE REPRESENTATION THEO-REM,\" IN STOCHASTIC DIFFERENTIAL EQUATIONS. NEW YORK, NY, USA: SPRINGER-VERLAG, 2005, PP. 43–49.[12] L. A. ABBAS-TURKI AND B. LAPEYRE, \"AMERICAN OPTIONS PRICING ON MULTI-CORE GRAPHIC CARDS,\" IN PROC. INT. CONF. BUS. INTELL. FINANCIAL ENG., BEIJING,CHINA, 2009, PP. 307–311.[13] M. S. JOSHI, \"GRAPHICAL ASIAN OPTIONS,\" WILMOTT J., VOL. 2, NO. 2,","[12] L. A. ABBAS-TURKI AND B. LAPEYRE, \"AMERICAN OPTIONS PRICING ON MULTI-CORE GRAPHIC CARDS,\" IN PROC. INT. CONF. BUS. INTELL. FINANCIAL ENG., BEIJING,CHINA, 2009, PP. 307–311.[13] M. S. JOSHI, \"GRAPHICAL ASIAN OPTIONS,\" WILMOTT J., VOL. 2, NO. 2,PP. 97–107, 2010.","[13] M. S. JOSHI, \"GRAPHICAL ASIAN OPTIONS,\" WILMOTT J., VOL. 2, NO. 2,PP. 97–107, 2010.","[14] S. SOLOMON, R. K. THULASIRAM, AND P. THULASIRAMAN, \"OPTION PRICING ONTHE GPU,\" IN PROC. 12TH IEEE INT. CONF. HIGH PERFORM. COMPUT. COMMUN.,MELBOURNE, VIC., AUSTRALIA, 2010, PP. 289–296.[15] D. EGLOFF, \"HIGH PERFORMANCE FINITE DIFFERENCE PDE SOLVERS ON GPUS,\"QUANTALEA GMBH, TECH. REP., ZURICH, SWITZERLAND, (2010, FEB.). [ONLINE].AVAILABLE: HTTP://DOWNLOAD.QUANTALEA.NET/ FDM-GPU.PDF[16] D. EGLOFF, \"PRICING FINANCIAL DERIVATIVES WITH HIGH PERFORMANCE FINITE DIF-","[15] D. EGLOFF, \"HIGH PERFORMANCE FINITE DIFFERENCE PDE SOLVERS ON GPUS,\"QUANTALEA GMBH, TECH. REP., ZURICH, SWITZERLAND, (2010, FEB.). [ONLINE].AVAILABLE: HTTP://DOWNLOAD.QUANTALEA.NET/ FDM-GPU.PDF[16] D. EGLOFF, \"PRICING FINANCIAL DERIVATIVES WITH HIGH PERFORMANCE FINITE DIF-FERENCE SOLVERS ON GPUS,\" IN GPU COMPUTING GEMS JADE EDITION, W.HWU, ED. BURLINGTON, MA, USA: MORGAN KAUFMANN, 2011.","[16] D. EGLOFF, \"PRICING FINANCIAL DERIVATIVES WITH HIGH PERFORMANCE FINITE DIF-FERENCE SOLVERS ON GPUS,\" IN GPU COMPUTING GEMS JADE EDITION, W.HWU, ED. BURLINGTON, MA, USA: MORGAN KAUFMANN, 2011.","[17] M. FATICA AND E. PHILLIPS, \"PRICING AMERICAN OPTIONS WITH LEAST SQUARESMONTE CARLO ON GPUS,\" PROC. 6TH WORKSHOP HIGH PERFORM. COMPUT.FINANCE, DENVER, 2013.","[18] C. DE SCHRYVER ET AL., \"AN ENERGY EFFICIENT FPGA ACCELERATOR FOR MONTECARLO OPTION PRICING WITH THE HESTON MODEL,\" IN PROC. INT. CONF. RECON-FIGURABLE COMPUT. FPGAS, CANCUN, MEXICO, 2011, PP. 468–474.[19] N. A. WOODS AND T. VANCOURT, \"FPGA ACCELERATION OF QUASI-MONTE CARLOIN FINANCE,\" IN PROC. INT. CONF. FIELD PROGRAM. LOGIC APPL., HEIDELBERG,GERMANY, 2008, PP. 335–340.[20] A. KAGANOV, P. CHOW, AND A. LAKHANY, \"FPGA ACCELERATION OF MONTE-","[19] N. A. WOODS AND T. VANCOURT, \"FPGA ACCELERATION OF QUASI-MONTE CARLOIN FINANCE,\" IN PROC. INT. CONF. FIELD PROGRAM. LOGIC APPL., HEIDELBERG,GERMANY, 2008, PP. 335–340.[20] A. KAGANOV, P. CHOW, AND A. LAKHANY, \"FPGA ACCELERATION OF MONTE-CARLO BASED CREDIT DERIVATIVE PRICING,\" IN PROC. INT. CONF. FIELD PROGRAM.LOGIC APPL., HEIDELBERG, GERMANY, 2008, PP. 329–334.[21] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"RECONFIGURABLE","[20] A. KAGANOV, P. CHOW, AND A. LAKHANY, \"FPGA ACCELERATION OF MONTE-CARLO BASED CREDIT DERIVATIVE PRICING,\" IN PROC. INT. CONF. FIELD PROGRAM.LOGIC APPL., HEIDELBERG, GERMANY, 2008, PP. 329–334.[21] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"RECONFIGURABLECONTROL VARIATE MONTE-CARLO DESIGNS FOR PRICING EXOTIC OPTIONS,\" IN PROC.INT. CONF. FIELD PROGRAM. LOGIC APPL., MILANO, ITALY, 2010, PP. 364–367.[22] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"EFFICIENT RECON-","[21] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"RECONFIGURABLECONTROL VARIATE MONTE-CARLO DESIGNS FOR PRICING EXOTIC OPTIONS,\" IN PROC.INT. CONF. FIELD PROGRAM. LOGIC APPL., MILANO, ITALY, 2010, PP. 364–367.[22] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"EFFICIENT RECON-FIGURABLE DESIGN FOR PRICING ASIAN OPTIONS,\" ACM SIGARCH COMPUTERARCHIT. NEWS, VOL. 38, NO. 4, PP. 14–20, 2011.","[22] A. H. T. TSE, D. B. THOMAS, K. H. TSOI, AND W. LUK, \"EFFICIENT RECON-FIGURABLE DESIGN FOR PRICING ASIAN OPTIONS,\" ACM SIGARCH COMPUTERARCHIT. NEWS, VOL. 38, NO. 4, PP. 14–20, 2011.","[23] B. BETKAOUI, D. B. THOMAS, AND W. LUK, \"COMPARING PERFORMANCE ANDENERGY EFFICIENCY OF FPGAS AND GPUS FOR HIGH PRODUCTIVITY COMPUT-ING,\" IN PROC. INT. CONF. FIELD-PROGRAM. TECHNOL., BEIJING, CHINA, 2010,PP. 94–101.[24] D. MANNERS, \"ALTERA GOES FOR THE DATA CENTRE,\" ELECTRON. WEEKLY,OCT. 8, 2014.","[24] D. MANNERS, \"ALTERA GOES FOR THE DATA CENTRE,\" ELECTRON. WEEKLY,OCT. 8, 2014.","[25] Y. HU, Q. LI, Z. CAO, AND J. WANG, \"PARALLEL SIMULATION OF HIGH-DIMENSIONALAMERICAN OPTION PRICING BASED ON CPU VERSUS MIC,\" CONCURRENCY COM-PUT., PRACTICE EXPERIENCE, VOL. 27, PP. 1110–1121, 2014.","[26] M. MANSSEN, M. WEIGEL, AND A. K. HARTMANN, \"RANDOM NUMBER GENER-ATORS FOR MASSIVELY PARALLEL SIMULATIONS ON GPU,\" EUR. PHYS. J. SPECIALTOPICS, VOL. 210, PP. 53–72, 2012.","[27] S. TRAINOR, \"TOWARDS A PORTABLE ACCELERATED ASSET PATH SIMULATOR FOR DERIVA-TIVES PRICING,\" PH.D. DISSERTATION, QUEEN'S UNIVERSITY BELFAST, BELFAST,U.K., 2015."],"terms":["PRICE","OPTION","ASSET","OPTIONS","WHICH","PRICING","MODEL","FUNCTIONS","USING","FUNCTIONS"]},{"article":"98.pdf","title":"OPTION PRICING WITH APPLICATION OF LEVY PROCESSES AND THE MINIMAL VARIANCE EQUIVALENT MARTINGALE MEASURE UNDER UNCERTAINTY PIOTR NOWAK AND MICHAŁ PAWŁOWSKI ","authors":["R NOWAK AND MICHAŁ PAWŁOWSKI"],"institutions":[],"abstract":"ABSTRACT—THIS PAPER IS DEDICATED TO EUROPEAN OPTION PRICINGUNDER ASSUMPTION THAT THE UNDERLYING ASSET FOLLOWS A GEOMETRICLEVY PROCESS. THE LOG-PRICE OF A PRIMARY FINANCIAL INSTRUMENT HASTHE FORM OF A SUM OF A DRIFT COMPONENT, A BROWNIAN COMPONENT,AND A LINEAR COMBINATION OF TIME-HOMOGENEOUS POISSON PROCESSES,MODELING JUMPS IN PRICE. IN OUR APPROACH WE APPLY STOCHASTICANALYSIS, ESPECIALLY THE CHANGE OF PROBABILITY MEASURE TECHNIQUES,AS WELL AS FUZZY SETS THEORY. TO OBTAIN THE OPTION VALUATION FORMULASWE USE THE MINIMAL VARIANCE EQUIVALENT MARTINGALE MEASURE, WHICHREQUIRES AN ADVANCED ANALYSIS OF TRANSFORMATION OF LEVY CHARAC-TERISTIC TRIPLETS. WE OBTAIN ANALYTICAL OPTION VALUATION EXPRESSIONSIN CRISP CASE. MOREOVER, WE ASSUME THAT SOME MODEL PARAMETERSARE DESCRIBED IN AN IMPRECISE WAY AND THEREFORE WE USE THEIR FUZZYCOUNTERPARTS. APPLYING FUZZY ARITHMETIC, WE TAKE INTO ACCOUNT VAR-IOUS TYPES OF UNCERTAINTY ON THE MARKET. AS A RESULT, WE OBTAINTHE ANALYTICAL OPTION PRICING FORMULAS WITH FUZZY PARAMETERS. WEALSO PROPOSE A METHOD OF AUTOMATIZED DECISION MAKING, WHICH UTI-LIZES THE FUZZY VALUATION FORMULAS. APART FROM THE GENERAL PRICINGEXPRESSIONS, WE PROVIDE NUMERICAL EXAMPLES TO ILLUSTRATE OUR THEO-RETICAL RESULTS.","objective":["IN THIS PAPER, WE WILL USE L-R FUZZY NUMBERS AND TRIANGULARFUZZY NUMBERS","IN THIS PAPER, WE ASSUME THE PROCESS S DESCRIBING THE UNDER-LYING ASSET WILL HAVE THE FORM (11)"],"problem":"","methodology":["ON THE OTHER HAND, THIS METHODOLOGY MAY LEAD TO MUCH MOREBALANCED AND CAUTIOUS DECISIONS"],"contributes":"","references":["[1] F. BLACK AND M. SCHOLES, \"THE PRICING OF OPTIONS AND CORPORATE LIABILITIES,\"J. POLITICAL ECON., VOL. 81, PP. 637–659, 1973.","[2] J. C. HULL, OPTIONS, FUTURES AND OTHER DERIVATIVES. NEW YORK, NY, USA:PRENTICE HALL, 1997.","[3] M. DAVIS, \"MATHEMATICS OF FINANCIAL MARKETS,\" IN MATHEMATICS UNLIMITED2001 AND BEYOND, B. ENGQUIST AND W. SCHMID, EDS. BERLIN, GERMANY:SPRINGER-VERLAG, 2001, PP. 361–380.[4] G. BAKSHI, C. CAO, AND Z. CHEN, \"EMPIRICAL PERFORMANCE OF ALTERNATIVEOPTION PRICING MODELS,\" J. FINANCE, VOL. 52, NO. 5, PP. 2003–2049, 1997.","[4] G. BAKSHI, C. CAO, AND Z. CHEN, \"EMPIRICAL PERFORMANCE OF ALTERNATIVEOPTION PRICING MODELS,\" J. FINANCE, VOL. 52, NO. 5, PP. 2003–2049, 1997.","[5] D. S. BATES, \"JUMPS AND STOCHASTIC VOLATILITY: EXCHANGE RATE PROCESSESIMPLICIT IN DEUTSCHEMARK OPTIONS,\" REV. FINANCE STUD., VOL. 9, NO. 1,PP. 69–107, 1996.","[6] R. MERTON, \"OPTION PRICING WHEN UNDERLYING STOCK RETURNS ARE DISCONTIN-UOUS,\" J. FINANCE ECON., VOL. 3, PP. 125–144, 1976.","[7] S. G. KOU, \"A JUMP-DIFFUSION MODEL FOR OPTION PRICING,\" MANAGE. SCI.,VOL. 48, NO. 8, PP. 1086–1101, 2002.","[8] S. G. KOU AND H. WANG, \"OPTION PRICING UNDER A DOUBLE EXPONENTIAL JUMPDIFFUSION MODEL,\" MANAGE. SCI., VOL. 50, NO. 9, PP. 1178–1192, 2004.","[9] S. ASMUSSEN, F. AVRAM, AND M. PISTORIUS, \"RUSSIAN AND AMERICAN PUTOPTIONS UNDER EXPONENTIAL PHASE-TYPE LEVY MODELS,\" STOCH. PROCESS. APPL.,VOL. 109, NO. 1, PP. 79–111, 2004.","[10] M. BOYARCHENKO AND S. BOYARCHENKO, \"USER'S GUIDE TO PRICING DOUBLEBARRIER OPTIONS. PART I: KOU'S MODEL AND GENERALIZATIONS,\" 2008, AVAILABLEAT SSRN: HTTP://DX.DOI.ORG/10.2139/SSRN.1272081[11] N. CAI, N. CHEN, AND X. WAN, \"PRICING DOUBLE-BARRIER OPTIONS UNDER AFLEXIBLE JUMP DIFFUSION MODEL,\" OPER. RES. LETT., VOL. 37, NO. 3, PP. 163–167, 2009.","[11] N. CAI, N. CHEN, AND X. WAN, \"PRICING DOUBLE-BARRIER OPTIONS UNDER AFLEXIBLE JUMP DIFFUSION MODEL,\" OPER. RES. LETT., VOL. 37, NO. 3, PP. 163–167, 2009.","[12] N. CAI AND S. KOU, \"OPTION PRICING UNDER A MIXED-EXPONENTIAL JUMPDIFFUSION MODEL,\" MANAGE. SCI., VOL. 57, PP. 2067–2081, 2011.","[13] J. CROSBY, N. L. SAUX, AND A. MIJATOVIC, \"APPROXIMATING LEVY PROCESSESWITH A VIEW TO OPTION PRICING,\" INT. J. THEOR. APPL. FINANCE, VOL. 13, NO. 1,PP. 63–91, 2010.","[14] M. JEANNIN AND M. R. PISTORIUS, \"A TRANSFORM APPROACH TO CALCULATE PRICESAND GREEKS OF BARRIER OPTIONS DRIVEN BY A CLASS OF LEVY PROCESSES,\" QUAN-TITATIVE FINANCE, VOL. 10, NO. 6, PP. 629–644, 2010.","[15] O. E. BARNDORFF-NIELSEN, \"PROCESSES OF NORMAL INVERSE GAUSSIAN TYPE,\"FINANCE STOCH., VOL. 2, PP. 41–68, 1997.","[16] D. B. MADAN AND E. SENETA, \"THE VARIANCE GAMMA (V.G.) MODEL FOR SHAREMARKET RETURNS,\" J. BUS., VOL. 63, NO. 4, PP. 511–524, 1990.","[17] Y. MIYAHARA, OPTION PRICING IN INCOMPLETE MARKETS: MODELING BASED ONGEOMETRIC LEVY PROCESSES AND MINIMAL ENTROPY MARTINGALE MEASURES(SERIES IN QUANTITATIVE FINANCE). LONDON, U.K.: IMPERIAL COLLEGE PRESS,2012.","[18] A. N. SHIRYAEV, ESSENTIALS OF STOCHASTIC FINANCE, FACTS, MODELS, THEORY.SINGAPORE: WORLD SCIENTIFIC, 1999.","[19] L. A. ZADEH, \"FUZZY SETS,\" INF. CONTROL, VOL. 8, PP. 338–353, 1965.","[20] H. C. WU, \"PRICING EUROPEAN OPTIONS BASED ON THE FUZZY PATTERN OF BLACK-SCHOLES FORMULA,\" COMPUT. OPER. RES., VOL. 31, PP. 1069–1081, 2004.","[21] A. M. GIL-LAFUENTE, FUZZY LOGIC IN FINANCIAL ANALYSIS. BERLIN, GERMANY:SPRINGER-VERLAG, 2005.","[22] H. C. WU, \"USING FUZZY SETS THEORY AND BLACK-SCHOLES FORMULA TO GENERATEPRICING BOUNDARIES OF EUROPEAN OPTIONS,\" APPL. MATH. COMPUT., VOL. 185,NO. 1, PP. 136–146, 2007.","[23] Y. YOSHIDA, \"THE VALUATION OF EUROPEAN OPTIONS IN UNCERTAIN ENVIRONMENT,\"EUR. J. OPER. RES., VOL. 145, NO. 1, PP. 221–229, 2003.","[24] W. XU, X. PENG, AND W. XIAO, \"THE FUZZY JUMP-DIFFUSION MODEL TO PRICINGEUROPEAN VULNERABLE OPTIONS,\" INT. J. FUZZY SYST., VOL. 15, NO. 3, PP. 317–325, 2013.","[25] W. XIAN-DONG AND H. JIAN-MIN, \"RELOAD OPTION PRICING IN FUZZY FRAME-WORK,\" IN PROC. INT. CONF. MANAGE. SCI. ENG., 2014, PP. 147–152.[26] K. A. CHRYSAFIS AND B. K. PAPADOPOULOS, \"ON THEORETICAL PRICING OF OPTIONSWITH FUZZY ESTIMATORS,\" J. COMPUT. APPL. MATH., VOL. 223, NO. 2, PP. 552–566, 2009.","[26] K. A. CHRYSAFIS AND B. K. PAPADOPOULOS, \"ON THEORETICAL PRICING OF OPTIONSWITH FUZZY ESTIMATORS,\" J. COMPUT. APPL. MATH., VOL. 223, NO. 2, PP. 552–566, 2009.","[27] K. THIAGARAJAH, S. S. APPADOO, AND A. THAVANESWARAN, \"OPTION VALUA-TION MODEL WITH ADAPTIVE FUZZY NUMBERS,\" COMPUT. MATH. APPL., VOL. 53,PP. 831–841, 2007.","[28] Z. ZMESKAL, \"GENERALISED SOFT BINOMIAL AMERICAN REAL OPTION PRICINGMODEL (FUZZY–STOCHASTIC APPROACH),\" EUR. J. OPER. RES., VOL. 207, NO. 2,PP. 1096–1103, 2010.","[29] W. Q. LIU AND S. H. LI, \"EUROPEAN OPTION PRICING MODEL IN A STOCHAS-TIC AND FUZZY ENVIRONMENT,\" APPL. MATH.-J. CHIN. UNIV., VOL. 28, NO. 3,PP. 321–334, 2013.","[30] L. H. ZHANG, W. G. ZHANG, W. J. XU, AND W. L. XIAO, \"THE DOUBLEEXPONENTIAL JUMP DIFFUSION MODEL FOR PRICING EUROPEAN OPTIONS UNDERFUZZY ENVIRONMENTS,\" ECON. MODEL., VOL. 29, NO. 3, PP. 780–786, 2012.","[31] P. NOWAK, \"OPTION PRICING WITH LEVY PROCESS IN A FUZZY FRAMEWORK,\"IN RECENT ADVANCES IN FUZZY SETS, INTUITIONISTIC FUZZY SETS, GENERALIZEDNETS AND RELATED TOPICS, K. T. ATANASSOV, W. HOMENDA, O. HRYNIEWICZ,J. KACPRZYK, M. KRAWCZAK, Z. NAHORSKI, E. SZMIDT, AND S. ZADROZNY, EDS.WARSAW, POLAND: SYSTEMS RESEARCH INSTITUTE POLISH ACADEMY OF SCIENCES,2011, PP. 155–167.[32] P. NOWAK AND M. ROMANIUK, \"APPLICATION OF LEVY PROCESSES AND ESSCHER","[32] P. NOWAK AND M. ROMANIUK, \"APPLICATION OF LEVY PROCESSES AND ESSCHERTRANSFORMED MARTINGALE MEASURES FOR OPTION PRICING IN FUZZY FRAMEWORK,\"J. COMPUT. APPL. MATH., VOL. 263, PP. 129–151, 2014.","[33] H. C. WU, \"OPTIMALITY CONDITIONS FOR LINEAR PROGRAMMING PROBLEMS WITHFUZZY COEFFICIENTS,\" COMPUT. MATH. APPL., VOL. 55, NO. 12, PP. 2807–2822,2008.","[34] M. L. PURI AND D. A. RALESCU, \"FUZZY RANDOM VARIABLES,\" J. MATH. ANAL.APPL., VOL. 114, PP. 409–422, 1986.","[35] L. A. ZADEH, \"THE CONCEPT OF LINGUISTIC VARIABLE AND ITS APPLICATION TOAPPROXIMATE REASONING I, II AND III,\" INF. SCI., VOL. 8, 8, 9, PP. 199–249,301–357, 43–80, 1975.","[36] J. JACOD AND A. N. SHIRYAEV, LIMIT THEOREMS FOR STOCHASTIC PROCESSES.BERLIN, GERMANY: SPRINGER-VERLAG, 1987.","[37] P. NOWAK, \"ON JACOD-GRIGELIONIS CHARACTERISTICS FOR HILBERT SPACE VALUEDSEMIMARTINGALES,\" STOCH. ANAL. APPL., VOL. 20, NO. 5, PP. 963–998, 2002.","[38] R. CONT AND P. TANKOV, FINANCIAL MODELLING WITH JUMP PROCESSES. LONDON,U.K.: CHAPMAN & HALL, 2004.","[39] F. DELBAEN AND W. SCHACHERMAYER, \"A GENERAL VERSION OF THE FUNDAMENTALTHEOREM OF ASSET PRICING,\" MATH. ANN., VOL. 300, NO. 1, PP. 463–520, 1994.","[40] J. J. BUCKLEY AND E. ESLAMI, \"PRICING STOCK OPTIONS USING FUZZY SETS,\"IRANIAN J. FUZZY. SYST., VOL. 4, NO. 2, PP. 1–14, 2007.","[41] P. NOWAK AND M. ROMANIUK, \"CATASTROPHE BOND PRICING FOR THE TWO-FACTORVASICEK INTEREST RATE MODEL WITH AUTOMATIZED FUZZY DECISION MAKING,\" SOFTCOMPUT., PP. 1–23, 2015 DOI: 10.1007/S00500-015-1957-1.[42] K. PIASECKI, \"ON IMPRECISE INVESTMENT RECOMMENDATIONS,\" STUD. LOGIC,GRAMMARRHETORIC, VOL. 37, NO. 1, PP. 179–194, 2014.","[42] K. PIASECKI, \"ON IMPRECISE INVESTMENT RECOMMENDATIONS,\" STUD. LOGIC,GRAMMARRHETORIC, VOL. 37, NO. 1, PP. 179–194, 2014.","[43] M. PAWŁOWSKI AND P. NOWAK, \"MODELLING SPOT PRICES ON THE POLISH ENERGYMARKET,\" IN INTELLIGENT SYSTEMS'2014, VOL. 323 (ADVANCES IN INTELLIGENTSYSTEMS AND COMPUTING SERIES), D. FILEV, J. JABŁKOWSKI, J. KACPRZYK,M. KRAWCZAK, I. POPCHEV, L. RUTKOWSKI, V. SGUREV, E. SOTIROVA,P. SZYNKARCZYK, AND S. ZADROZNY, EDS. BERLIN, GERMANY: SPRINGER-VERLAG,2015, PP. 781–792.[44] M. MUSIELA AND M. RUTKOWSKI, MARTINGALE METHODS IN FINANCIAL MOD-","[44] M. MUSIELA AND M. RUTKOWSKI, MARTINGALE METHODS IN FINANCIAL MOD-ELLING. BERLIN, GERMANY: SPRINGER-VERLAG, 1997."],"terms":["FUZZY","OPTION","PRICE","PRICING","PROCESS","LEVEL","MVEMM","MARKET","FUNCTION","NUMBERS"]},{"article":"118.pdf","title":"FN-TOPSIS: FUZZY NETWORKS FOR RANKING TRADED EQUITIES ","authors":["ABDUL MALEK YAAKOB"," ANTOANETA SERGUIEVA"," ALEXANDER GEGOV"],"institutions":[],"abstract":"ABSTRACT—FUZZY SYSTEMS CONSISTING OF NETWORKED RULE BASES,CALLED FUZZY NETWORKS, CAPTURE VARIOUS TYPES OF IMPRECISION INHER-ENT IN FINANCIAL DATA AND IN THE DECISION-MAKING PROCESSES ON THEM.THIS PAPER INTRODUCES A NOVEL EXTENSION OF THE TECHNIQUE FOR ORDER-ING OF PREFERENCE BY SIMILARITY TO IDEAL SOLUTION (TOPSIS) METHODAND USES FUZZY NETWORKS TO SOLVE MULTICRITERIA DECISION-MAKINGPROBLEMS WHERE BOTH BENEFIT AND COST CRITERIA ARE PRESENTED ASSUBSYSTEMS. THUS, THE DECISION MAKER EVALUATES THE PERFORMANCEOF EACH ALTERNATIVE FOR PORTFOLIO OPTIMIZATION AND FURTHER OBSERVESTHE PERFORMANCE FOR BOTH BENEFIT AND COST CRITERIA. THIS APPROACHIMPROVES SIGNIFICANTLY THE TRANSPARENCY OF THE TOPSIS METHODS,WHILE ENSURING HIGH EFFECTIVENESS IN COMPARISON WITH ESTABLISHEDAPPROACHES. THE PROPOSED METHOD IS FURTHER TESTED TO SOLVE THEPROBLEM OF SELECTION/RANKING OF TRADED EQUITY COVERING DEVELOPEDAND EMERGENT FINANCIAL MARKETS. THE RANKING PRODUCED BY THEMETHOD IS VALIDATED USING SPEARMAN RHO RANK CORRELATION. BASEDON THE CASE STUDY, THE PROPOSED METHOD OUTPERFORMS THE EXISTINGTOPSIS APPROACHES IN TERMS OF RANKING PERFORMANCE.","objective":["TOPSIS IS USED IN THIS RESEARCH DUE TO ITS STABILITY AND SIM-PLICITY OF USE WITH CARDINAL INFORMATION [13]","APPROACHES [38], IN THIS RESEARCH, WE FOCUS ON FNS AS THEY AREBOTH WELL TRANSPARENT AND ACCURATE"],"problem":"","methodology":["OPERATION OF FNS","APPLICABILITY AND VALIDITY OF THE PROPOSED FN METHODOLOGY IN AREALISTIC SCENARIO","MAKING METHODOLOGY USING Z-NUMBERS,\" INT"],"contributes":"","references":["[1] A. HADI-VENCHEH AND M. MIRJABERI, \"SECLUSION-FACTOR METHOD TO SOLVEFUZZY-MULTIPLE CRITERIA DECISION-MAKING PROBLEMS,\" IEEE TRANS. FUZZYSYST., VOL. 19, NO. 2, PP. 201–209, APR. 2011.","[2] T. T. NGUYEN, L. GORDON-BROWN, A. KHOSRAVI, D. CREIGHTON, AND SAEIDNAHAVANDI, \"FUZZY PORTFOLIO ALLOCATION MODELS THROUGH A NEW RISK MEASUREAND FUZZY SHARPE RATIO,\" IEEE TRANS. FUZZY SYST., VOL. 23, NO. 3, PP. 656–676, JUN. 2015.","[3] A. KELEMENIS, K. ERGAZAKIS, AND D. ASKOUNIS, \"SUPPORT MANAGERS' SE-LECTION USING AN EXTENSION OF FUZZY TOPSIS,\" EXPERT SYST. APPL., VOL. 38,NO. 3, PP. 2774–2782, MAR. 2011.","[4] A. AWASTHI, S. S. CHAUHAN, AND H. OMRANI, \"APPLICATION OF FUZZY TOP-SIS IN EVALUATING SUSTAINABLE TRANSPORTATION SYSTEMS,\" EXPERT SYST. APPL.,VOL. 38, NO. 10, PP. 12270–12280, SEP. 2011.","[5] H. SHIDPOUR, M. SHAHROKHI, AND A. BERNARD, \"A MULTI-OBJECTIVE PROGRAM-MING APPROACH, INTEGRATED INTO THE TOPSIS METHOD, IN ORDER TO OPTIMIZEPRODUCT DESIGN; IN THREE-DIMENSIONAL CONCURRENT ENGINEERING,\" COMPUT.IND. ENG., VOL. 64, NO. 4, PP. 875–885, APR. 2013.","[6] Y. T. İÇ, \"AN EXPERIMENTAL DESIGN APPROACH USING TOPSIS METHOD FORTHE SELECTION OF COMPUTER-INTEGRATED MANUFACTURING TECHNOLOGIES,\" ROBOT.COMPUT. INTEGR. MANUF., VOL. 28, NO. 2, PP. 245–256, APR. 2012.","[7] A. PIRES, N.-B. CHANG, AND G. MARTINHO, \"AN AHP-BASED FUZZY INTERVALTOPSIS ASSESSMENT FOR SUSTAINABLE EXPANSION OF THE SOLID WASTE MAN-AGEMENT SYSTEM IN SETÚBAL PENINSULA, PORTUGAL,\" RESOURCES CONSERVATIONRECYCLING, VOL. 56, NO. 1, PP. 7–21, NOV. 2011.","[8] M. SAREMI, S. F. MOUSAVI, AND A. SANAYEI, \"TQM CONSULTANT SELECTIONIN SMES WITH TOPSIS UNDER FUZZY ENVIRONMENT,\" EXPERT SYST. APPL.,VOL. 36, NO. 2, PP. 2742–2749, MAR. 2009.","[9] M. DAĞDEVIREN, S. YAVUZ, AND N. KILINÇ, \"WEAPON SELECTION USING THEAHP AND TOPSIS METHODS UNDER FUZZY ENVIRONMENT,\" EXPERT SYST. APPL.,VOL. 36, NO. 4, PP. 8143–8151, MAY 2009.","[10] D. MOHAMAD AND R. M. JAMIL, \"A PREFERENCE ANALYSIS MODEL FOR SELECTINGTOURIST DESTINATIONS BASED ON MOTIVATIONAL FACTORS: A CASE STUDY IN KEDAH,MALAYSIA,\" PROCEDIA, SOC. BEHAV. SCI., VOL. 65, PP. 20–25, DEC. 2012.","[11] E. ANSARIFAR, F. SHAHIDI, M. MOHEBBI, S. M. RAZAVI, AND J. ANSARIFAR, \"ANEW TECHNIQUE TO EVALUATE THE EFFECT OF CHITOSAN ON PROPERTIES OF DEEP-FRIEDKURDISH CHEESE NUGGETS BY TOPSIS,\" LWT-FOOD SCI. TECHNOL., VOL. 62,NO. 2, PP. 1211–1219, JUL. 2015.","[12] S.-Y. CHOU, Y.-H. CHANG, AND C.-Y. SHEN, \"A FUZZY SIMPLE ADDITIVE WEIGHT-ING SYSTEM UNDER GROUP DECISION-MAKING FOR FACILITY LOCATION SELECTIONWITH OBJECTIVE/SUBJECTIVE ATTRIBUTES,\" EUR. J. OPER. RES., VOL. 189, NO. 1,PP. 132–145, AUG. 2008.","[13] K. HWANG AND C. L. YOON, MULTIPLE ATTRIBUTE DECISION MAKING: METHODSAND APPLICATIONS. NEW YORK, NY, USA: SPRINGER-VERLAG, 1981.","[14] J.-W. WANG, C.-H. CHENG, AND K.-C. HUANG, \"FUZZY HIERARCHICAL TOPSISFOR SUPPLIER SELECTION,\" APPL. SOFT COMPUT., VOL. 9, PP. 377–386, 2009.","[15] C.-T. CHEN, \"EXTENSIONS OF THE TOPSIS FOR GROUP DECISION-MAKING UNDERFUZZY ENVIRONMENT,\" FUZZY SETS SYST., VOL. 114, NO. 1, PP. 1–9, AUG. 2000.","[16] T.-Y. CHEN, \"A LINEAR ASSIGNMENT METHOD FOR MULTIPLE-CRITERIA DECISIONANALYSIS WITH INTERVAL TYPE-2 FUZZY SETS,\" APPL. SOFT COMPUT., VOL. 13,NO. 5, PP. 2735–2748, 2013.","[17] A. A. BAZZAZI, M. OSANLOO, AND B. KARIMI, \"DERIVING PREFERENCE ORDEROF OPEN PIT MINES EQUIPMENT THROUGH MADM METHODS: APPLICATION OFMODIFIED VIKOR METHOD,\" EXPERT SYST. APPL., VOL. 38, PP. 2550–2556,2011.","[18] S.-M. CHEN AND L.-W. LEE, \"FUZZY MULTIPLE ATTRIBUTES GROUP DECISION-MAKING BASED ON THE INTERVAL TYPE-2 TOPSIS METHOD,\" EXPERT SYST. APPL.,VOL. 37, NO. 4, PP. 2790–2798, APR. 2010.","[19] J. M. MENDEL, R. I. JOHN, AND F. L. LIU, \"INTERVAL TYPE 2 FUZZY LOGICALSYSTEM MADE SIMPLE,\" IEEE TRANS. FUZZY SYST., VOL. 6, NO. 14, PP. 808–821, DEC. 2006.","[20] L. A. ZADEH, \"THE CONCEPT OF A LINGUISTIC VARIABLE AND ITS APPLICATION TOAPPROXIMATE REASONING,\" J. INF. SCI., VOL. 1, NO. 8, PP. 199–249, 1975.","[21] J. M. MENDEL, UNCERTAIN RULE-BASED FUZZY LOGIC SYSTEMS: INTRODUCTIONAND NEW DIRECTIONS. UPPER SADDLE RIVER, NJ, USA: PRENTICE-HALL, 2001.","[22] M. H. FAZEL ZARANDI, I. B. TURKSEN, AND O. TORABI KASBI, \"TYPE-2FUZZY MODELING FOR DESULPHURIZATION OF STEEL PROCESS,\" EXPERT SYST. APPL.,VOL. 32, PP. 157–171, 2007.","[23] L. A. ZADEH, \"FUZZY SETS,\" J. INF. CONTROL, VOL. 8, PP. 338–353, 1965.","[25] J. HU, Y. ZHANG, X. CHEN, AND Y. LIU, \"MULTI-CRITERIA DECISION MAKINGMETHOD BASED ON POSSIBILITY DEGREE OF INTERVAL TYPE-2 FUZZY NUMBER,\"KNOWL.-BASED SYST., NO. 463, PP. 21–29, 2013.","[26] J. M. MENDEL AND D. R. WU, PERCEPTUAL COMPUTING: AIDING PEOPLE INMAKING SUBJECTIVE JUDGMENTS. NEW YORK, NY, USA: WILEY/IEEE PRESS,2010.","[27] J. M. MENDEL ET AL., \"WHAT COMPUTING WITH WORDS MEANS TO ME,\" IEEECOMPUT. INTELL. MAG., VOL. 5, NO. 1, PP. 20–26, FEB. 2010.","[28] H. HAGRAS, F. DOCTOR, V. CALLAGHAN, AND A. LOPEZ, \"AN INCREMENTAL ADAP-TIVE LIFELONG LEARNING APPROACH FOR TYPE-2 FUZZY EMBEDDED AGENTS IN AM-BIENT INTELLIGENT ENVIRONMENTS,\" IEEE TRANS. FUZZY SYST., VOL. 15, NO. 1,PP. 41–55, FEB. 2007.","[29] E. A. JAMMEH, M. FLEURY, C. WAGNER, H. HAGRAS, AND M. GHANBARI,\"INTERVAL TYPE-2 FUZZY LOGIC CONGESTION CONTROL FOR VIDEO STREAMING ACROSSIP NETWORKS,\" IEEE TRANS. FUZZY SYST., VOL. 17, NO. 5, PP. 1123–1142,OCT. 2009.","[30] C. WAGNER AND H. HAGRAS, \"TOWARD GENERAL TYPE-2 FUZZY LOGIC SYSTEMSBASED ON Z-SLICES,\" IEEE TRANS. FUZZY SYST., VOL. 18, NO. 4, PP. 637–660,AUG. 2010.","[31] D. R. WU AND J. M. MENDEL, \"ON THE CONTINUITY OF TYPE-1 AND INTERVALTYPE-2 FUZZY LOGIC SYSTEMS,\" IEEE TRANS. FUZZY SYST., VOL. 19, NO. 1,PP. 179–192, FEB. 2011.","[32] L. A. ZADEH, \"A NOTE ON Z-NUMBERS,\" INF. SCI., VOL. 181, NO. 14, PP. 2923–2932, JUL. 2011.","[33] B. KANG, D. WEI, Y. LI, AND Y. DENG, \"A METHOD OF CONVERTING Z-NUMBERTO,\" J. INF. COMPUT. SCI., VOL. 3, PP. 703–709, MAR. 2012.","[34] A. SOTOUDEH-ANVARI AND S. SADI-NEZHAD, \"A NEW APPROACH BASED ON THELEVEL OF RELIABILITY OF INFORMATION TO DETERMINE THE RELATIVE WEIGHTS OFCRITERIA IN FUZZY TOPSIS,\" INT. J. APPL. DECIS. SCI., VOL. 8, PP. 164–178,2015.","[35] R. A. ALIEV AND O. H. HUSEYNOV, DECISION THEORY WITH IMPERFECT INFOR-MATION. HACKENSACK, NJ, USA: WORLD SCIENTIFIC, 2014.","[36] A. GEGOV, FUZZY NETWORKS FOR COMPLEX SYSTEM: A MODULAR RULE BASEAPPROACH. BERLIN, GERMANY: SPRINGER-VERLAG, 2011.","[37] A. GEGOV, N. PETROV, AND B. VATCHOVA, \"ADVANCED MODELLING OF COMPLEXPROCESSES BY RULE BASED NETWORKS,\" IN PROC. IEEE INT. CONF. INTELL. SYST.,2010, PP. 197–202.[38] F. J. J. SANTOS AND H. A. CAMARGO, \"DECISION SUPPORT SYSTEMS IN MULTICRI-TERIA GROUPS: AN APPROACH BASED ON FUZZY RULES,\" IN PROC. IEEE INT. CONF.FUZZY SYST., JUL. 2010, PP. 1–8.[39] A. GEGOV, N. PETROV, AND E. GEGOV, \"RULE BASE IDENTIFICATION IN FUZZY","[38] F. J. J. SANTOS AND H. A. CAMARGO, \"DECISION SUPPORT SYSTEMS IN MULTICRI-TERIA GROUPS: AN APPROACH BASED ON FUZZY RULES,\" IN PROC. IEEE INT. CONF.FUZZY SYST., JUL. 2010, PP. 1–8.[39] A. GEGOV, N. PETROV, AND E. GEGOV, \"RULE BASE IDENTIFICATION IN FUZZYNETWORKS BY BOOLEAN MATRIX EQUATIONS,\" J. INTELL. FUZZY SYST., VOL. 1,NO. 26, PP. 405–419, 2014.","[39] A. GEGOV, N. PETROV, AND E. GEGOV, \"RULE BASE IDENTIFICATION IN FUZZYNETWORKS BY BOOLEAN MATRIX EQUATIONS,\" J. INTELL. FUZZY SYST., VOL. 1,NO. 26, PP. 405–419, 2014.","[40] A. GEGOV, F. ARABIKHAN, AND N. PETROV, \"LINGUISTIC COMPOSITION BASEDMODELLING BY FUZZY NETWORKS WITH MODULAR RULE BASES,\" FUZZY SETS SYST.,VOL. 269, PP. 1–29, JUN. 2015.","[41] M. YAAKOB AND A. GEGOV, \"INTERACTIVE TOPSIS BASED GROUP DECISIONMAKING METHODOLOGY USING Z-NUMBERS,\" INT. J. COMPUT. INTELL. SYST.,VOL. 9, PP. 311–324, 2016.","[42] R. W. CHEN, D. NAVIN-CHANDRA, AND FRITZ B. PRINZ, \"A COST-BENEFIT ANALYSISMODEL OF PRODUCT DESIGN FOR RECYCLABILITY AND ITS APPLICATION,\" IEEE TRANS.COMPON. PACKAG. MANUF. TECHNOL., VOL. 17, NO. 4, PP. 502–507, DEC. 1994.","[43] T. CLARK, WHY TRACK ACTUAL COSTS AND RESOURCE USAGE ON PROJECTS?. NEWYORK, NY, USA: ACM, MAR. 2008.","[44] P. GRZEGORZEWSKI AND E. MRÓWKA, \"TRAPEZOIDAL APPROXIMATIONS OF FUZZYNUMBERS—REVISITED,\" FUZZY SETS SYST., VOL. 158, NO. 7, PP. 757–768,APR. 2007.","[45] A. M. YAAKOB AND A. GEGOV, \"FUZZY RULE BASED APPROACH WITH Z-NUMBERSFOR SELECTION OF ALTERNATIVES USING TOPSIS,\" IN PROC. IEEE INT. CONF. FUZZYSYST., 2015, PP. 1–8.[46] F. TIRYAKI AND M. AHLATCIOGLU, \"FUZZY STOCK SELECTION USING A NEW FUZZYRANKING AND WEIGHTING ALGORITHM,\" APPL. MATH. COMPUT., VOL. 170, NO. 1,PP. 144–157, NOV. 2005.","[46] F. TIRYAKI AND M. AHLATCIOGLU, \"FUZZY STOCK SELECTION USING A NEW FUZZYRANKING AND WEIGHTING ALGORITHM,\" APPL. MATH. COMPUT., VOL. 170, NO. 1,PP. 144–157, NOV. 2005.","[47] J. LUKEMAN, THE MARKET MAKER'S EDGE: DAY TRADING TACTICS FROM A WALLSTREET INSIDER. TORONTO, ON, CANADA: MCGRAW-HILL, 2003.","[48] A. ROSHAYANI, U. LAILY, AND M. A. SITI MAZNAH, FINANCIAL ACCOUNTING ANINTRODUCTION, 2ND ED. SELANGOR, MALAYSIA: MCGRAW-HILL, 2007.","[49] J. J. WEYGANDT, D. E. KIESO, AND P. D. KIMMEL, ACCOUNTING PRINCIPLES,6TH ED. HOBOKEN, NJ, USA: WILEY, 2002.","[50] V. G. HANSEN, \"DETECTION PERFORMANCE OF SOME NONPARAMETRIC RANK TESTSAND AN APPLICATION TO RADAR,\" IEEE TRANS. INF. THEORY, VOL. IT-16, NO. 3,PP. 309–318, MAY 1970.","[51] A. SERGUIEVA AND J. HUNTER, \"FUZZY INTERVAL METHODS IN INVESTMENT RISKAPPRAISAL,\" INT. J. INF. SCI. FUZZY SETS SYST., VOL. 142, NO. 3, PP. 443–466,2004.","[52] A. SERGUIEVA, COMPUTATIONAL INTELLIGENCE IN ASSET RISK ANALYSIS.UXBRIDGE, U.K.: BRUNEL UNIV., 2004.","[53] A. SERGUIEVA, T. KHAN, AND T. KALGANOVA, \"AN INTELLIGENT SYSTEM FOR RISKCLASSIFICATION OF EQUITY INVESTMENT PROJECTS,\" J. APPL. SYST. STUD. (SPEC.ISSUE REAL LIFE APPL. NAT. INSPIRED COMB. HEURISTICS), VOL. 4, NO. 2,PP. 236–261, 2003.","[54] A. SERGUIEVA AND T. KALGANOVA, \"A NEURO-FUZZY-EVOLUTIONARY CLASSIFIEROF RISKY INVESTMENTS,\" IN PROC. 11TH IEEE INT. CONF. FUZZY SYST., 2002,PP. 997–1002."],"terms":[" · · · ","FUZZY",", . . . , ","TOPSIS","MATRIX","CRITERIA","BASED","BOOLEAN","NUMBER","WHERE"]},{"article":"120.pdf","title":"SEQUENTIAL DETECTION OF MARKET SHOCKS WITH RISK-AVERSE CVAR SOCIAL SENSORS ","authors":["VIKRAM KRISHNAMURTHY"," FELLOW"," SUJAY BHATT"],"institutions":[],"abstract":"ABSTRACT—THIS PAPER CONSIDERS A STATISTICAL SIGNAL PROCESSINGPROBLEM INVOLVING AGENT-BASED MODELS OF FINANCIAL MARKETS, WHICHAT A MICROLEVEL ARE DRIVEN BY SOCIALLY AWARE AND RISK-AVERSE AGENTS.THESE AGENTS TRADE (BUY OR SELL) STOCKS AT EACH TRADING INSTANT BYUSING THE DECISIONS OF ALL PREVIOUS AGENTS (SOCIAL LEARNING) IN ADDI-TION TO A PRIVATE (NOISY) SIGNAL THEY RECEIVE ON THE VALUE OF THESTOCK. WE ARE INTERESTED IN THE FOLLOWING: 1) MODELLING THE DYNAM-ICS OF THESE RISK AVERSE AGENTS AND 2) SEQUENTIAL DETECTION OF AMARKET SHOCK BASED ON THE BEHAVIOUR OF THESE AGENTS. STRUCTURALRESULTS THAT CHARACTERIZE SOCIAL LEARNING UNDER A RISK MEASURE,CONDITIONAL VALUE-AT-RISK (CVAR), ARE PRESENTED AND FORMULATIONOF THE BAYESIAN CHANGE POINT DETECTION PROBLEM IS PROVIDED. THESTRUCTURAL RESULTS EXHIBIT TWO INTERESTING PROPERTIES: 1) RISK AVERSEAGENTS HERD MORE OFTEN THAN RISK NEUTRAL AGENTS AND 2) THE STOP-PING SET IN THE SEQUENTIAL DETECTION PROBLEM IS NONCONVEX. THEFRAMEWORK IS VALIDATED ON DATA FROM THE YAHOO! TECH BUZZ GAMEDATASET AND IT IS REVEALED THAT 1) THE MODEL IDENTIFIES THE VALUECHANGES BASED ON AGENT'S TRADING DECISIONS. 2) REASONABLE QUICKESTDETECTION PERFORMANCE IS ACHIEVED WHEN THE AGENTS ARE RISK-AVERSE.","objective":["IN THIS PAPER, WE ARE INTERESTED IN DEVELOPING AGENT BASEDMODELS FOR STUDYING GLOBAL EVENTS IN FINANCIAL MARKETS WHERETHE UNDERLYING VALUE OF THE STOCK EXPERIENCES A JUMP CHANGE(SHOCK)","MEASURE [18]"],"problem":"","methodology":[],"contributes":"","references":["[1] B. LEBARON, \"AGENT-BASED COMPUTATIONAL FINANCE,\" IN HANDBOOK OFCOMPUTATIONAL EECONOMICS, 2006, VOL. 2, PP. 1187–1233.","[2] B. LEBARON, \"AGENT-BASED COMPUTATIONAL FINANCE: SUGGESTED READINGSAND EARLY RESEARCH,\" J. ECON. DYN. CONTROL, VOL. 24, NO. 5, PP. 679–702,2000.","[3] E. SAMANIDOU, E. ZSCHISCHANG, D. STAUFFER, AND T. LUX, \"AGENT-BASEDMODELS OF FINANCIAL MARKETS,\" REP. PROG. PHYS., VOL. 70, NO. 3, P. 409,2007.","[4] V. ALFI, M. CRISTELLI, L. PIETRONERO, AND A. ZACCARIA, \"MINIMAL AGENT BASEDMODEL FOR FINANCIAL MARKETS I,\" EUR. PHYS. J. B, VOL. 67, NO. 3, PP. 385–397,2009.","[5] L. TESFATSION AND K. L. JUDD, HANDBOOK OF COMPUTATIONAL ECONOMICS:AGENT-BASED COMPUTATIONAL ECONOMICS. AMSTERDAM, THE NETHERLANDS:ELSEVIER, 2006, VOL. 2.[6] R. CONT AND J.-P. BOUCHAUD, \"HERD BEHAVIOR AND AGGREGATE FLUCTUATIONSIN FINANCIAL MARKETS,\" MACROECONOMIC DYN., VOL. 4, NO. 2, PP. 170–196,2000.","[6] R. CONT AND J.-P. BOUCHAUD, \"HERD BEHAVIOR AND AGGREGATE FLUCTUATIONSIN FINANCIAL MARKETS,\" MACROECONOMIC DYN., VOL. 4, NO. 2, PP. 170–196,2000.","[7] C. AVERY AND P. ZEMSKY, \"MULTIDIMENSIONAL UNCERTAINTY AND HERD BEHAV-IOR IN FINANCIAL MARKETS,\" AMER. ECON. REV., VOL. 88, NO. 4, PP. 724–748,SEP., 1998.","[8] A. PARK AND H. SABOURIAN, \"HERDING AND CONTRARIAN BEHAVIOR IN FINANCIALMARKETS,\" ECONOMETRICA, VOL. 79, NO. 4, PP. 973–1026, 2011.","[9] C. CHAMLEY, RATIONAL HERDS: ECONOMIC MODELS OF SOCIAL LEARNING.CAMBRIDGE, U.K.: CAMBRIDGE UNIV. PRESS, 2004.","[10] R. CONT, \"VOLATILITY CLUSTERING IN FINANCIAL MARKETS: EMPIRICAL FACTS ANDAGENT-BASED MODELS,\" IN LONG MEMORY IN ECONOMICS. NEW YORK, NY,USA: SPRINGER, 2007, PP. 289–309.[11] T. LUX AND M. MARCHESI, \"VOLATILITY CLUSTERING IN FINANCIAL MARKETS:A MICROSIMULATION OF INTERACTING AGENTS,\" INT. J. THEOR. APPL. FINANCE,VOL. 3, NO. 4, PP. 675–702, 2000.","[11] T. LUX AND M. MARCHESI, \"VOLATILITY CLUSTERING IN FINANCIAL MARKETS:A MICROSIMULATION OF INTERACTING AGENTS,\" INT. J. THEOR. APPL. FINANCE,VOL. 3, NO. 4, PP. 675–702, 2000.","[12] D. CHALLET ET AL., MINORITY GAMES: INTERACTING AGENTS IN FINANCIALMARKETS. LONDON, U.K.: OXFORD UNIV. PRESS, 2013.","[13] M. CRISTELLI, L. PIETRONERO, AND A. ZACCARIA, \"CRITICAL OVERVIEW OF AGENT-BASED MODELS FOR ECONOMICS,\" ARXIV PREPRINT ARXIV:1101.","[14] N. APERGIS AND S. M. MILLER, \"DO STRUCTURAL OIL-MARKET SHOCKS AFFECT STOCKPRICES?\" ENERGY ECON., VOL. 31, NO. 4, PP. 569–575, 2009.","[15] S. GILCHRIST, V. YANKOV, AND E. ZAKRAJŜEK, \"CREDIT MARKET SHOCKS AND ECO-NOMIC FLUCTUATIONS: EVIDENCE FROM CORPORATE BOND AND STOCK MARKETS,\"J. MONETARY ECON., VOL. 56, NO. 4, PP. 471–493, 2009.","[16] S. DAS AND M. MAGDON-ISMAIL, \"ADAPTING TO A MARKET SHOCK: OPTIMALSEQUENTIAL MARKET-MAKING,\" IN PROC. ADV. NEURAL INF. PROCESS. SYST., 2009,PP. 361–368.[17] V. KRISHNAMURTHY, \"QUICKEST DETECTION POMDPS WITH SOCIAL LEARNING:INTERACTION OF LOCAL AND GLOBAL DECISION MAKERS,\" IEEE TRANS. INF. THEORY,VOL. 58, NO. 8, PP. 5563–5587, AUG. 2012.","[17] V. KRISHNAMURTHY, \"QUICKEST DETECTION POMDPS WITH SOCIAL LEARNING:INTERACTION OF LOCAL AND GLOBAL DECISION MAKERS,\" IEEE TRANS. INF. THEORY,VOL. 58, NO. 8, PP. 5563–5587, AUG. 2012.","[18] P. ARTZNER, F. DELBAEN, J.-M. EBER, AND D. HEATH, \"COHERENT MEASURES OFRISK,\" MATH. FINANCE, VOL. 9, NO. 3, PP. 203–228, 1999.","[19] S. BIKHCHANDANI, D. HIRSHLEIFER, AND I. WELCH, \"A THEORY OF FADS, FASH-ION, CUSTOM, AND CULTURAL CHANGE AS INFORMATIONAL CASCADES,\" J. POLITICALECONOMY, VOL. 100, NO. 5, PP. 992–1026, OCT. 1992.","[20] I. WELCH, \"SEQUENTIAL SALES, LEARNING, AND CASCADES,\" J. FINANCE, VOL. 47,NO. 2, PP. 695–732, JUN. 1992.","[21] A. V. BANERJEE, \"A SIMPLE MODEL OF HERD BEHAVIOR,\" QUART. J. ECON.,VOL. 107, NO. 3, PP. 797–817, AUG. 1992.","[22] L. R. GLOSTEN, \"INSIDER TRADING, LIQUIDITY, AND THE ROLE OF THE MONOPOLISTSPECIALIST,\" J. BUSINESS, VOL. 62, NO. 2, PP. 211–235, APR. 1989.","[23] A. N. SHIRYAEV AND A. ARIES, OPTIMAL STOPPING RULES. NEW YORK, NY,USA: SPRINGER, 2007, VOL. 8.[24] H. V. POOR AND O. HADJILIADIS, QUICKEST DETECTION. CAMBRIDGE, U.K.:CAMBRIDGE UNIV. PRESS, 2009, VOL. 40.[25] M. FRISÉN, \"OPTIMAL SEQUENTIAL SURVEILLANCE FOR FINANCE, PUBLIC HEALTH, ANDOTHER AREAS,\" SEQUENTIAL ANAL., VOL. 28, NO. 3, PP. 310–337, 2009.","[24] H. V. POOR AND O. HADJILIADIS, QUICKEST DETECTION. CAMBRIDGE, U.K.:CAMBRIDGE UNIV. PRESS, 2009, VOL. 40.[25] M. FRISÉN, \"OPTIMAL SEQUENTIAL SURVEILLANCE FOR FINANCE, PUBLIC HEALTH, ANDOTHER AREAS,\" SEQUENTIAL ANAL., VOL. 28, NO. 3, PP. 310–337, 2009.","[25] M. FRISÉN, \"OPTIMAL SEQUENTIAL SURVEILLANCE FOR FINANCE, PUBLIC HEALTH, ANDOTHER AREAS,\" SEQUENTIAL ANAL., VOL. 28, NO. 3, PP. 310–337, 2009.","[26] R. A. COHN, W. G. LEWELLEN, R. C. LEASE, AND G. G. SCHLARBAUM,\"INDIVIDUAL INVESTOR RISK AVERSION AND INVESTMENT PORTFOLIO COMPOSITION,\"J. FINANCE, VOL. 30, NO. 2, PP. 605–620, MAY 1975.","[27] B. DONKERS AND A. V. SOEST, \"SUBJECTIVE MEASURES OF HOUSEHOLD PREF-ERENCES AND FINANCIAL DECISIONS,\" J. ECON. PSYCHOL., VOL. 20, NO. 6,PP. 613–642, 1999.","[28] S. MITRA AND T. JI, \"RISK MEASURES IN QUANTITATIVE FINANCE,\" INT. J. BUS.CONTINUITY RISK MANAGE., VOL. 1, NO. 2, PP. 125–135, 2010.","[29] R. T. ROCKAFELLAR AND S. URYASEV, \"OPTIMIZATION OF CONDITIONAL VALUE-AT-RISK,\" J. RISK, VOL. 2, PP. 21–41, 2000.","[30] P. KROKHMAL, J. PALMQUIST, AND S. URYASEV, \"PORTFOLIO OPTIMIZATION WITHCONDITIONAL VALUE-AT-RISK OBJECTIVE AND CONSTRAINTS,\" J. RISK, VOL. 4, NO. 2,PP. 43–68, 2002.","[31] C. LIM, H. D. SHERALI, AND S. URYASEV, \"PORTFOLIO OPTIMIZATION BYMINIMIZING CONDITIONAL VALUE-AT-RISK VIA NONDIFFERENTIABLE OPTIMIZATION,\"COMPUT. OPTIM. APPL., VOL. 46, NO. 3, PP. 391–415, 2010.","[32] F. ANDERSSON, H. MAUSSER, D. ROSEN, AND S. URYASEV, \"CREDIT RISKOPTIMIZATION WITH CONDITIONAL VALUE-AT-RISK CRITERION,\" MATH. PROGRAM.,VOL. 89, NO. 2, PP. 273–291, 2001.","[33] Y. FENG, F. RUBIO, AND D. PALOMAR, \"OPTIMAL ORDER EXECUTION FOR ALGORITH-MIC TRADING: A CVAR APPROACH,\" IN PROC. IEEE 13TH INT. WORKSHOP SIGNALPROCESS. ADV. WIRELESS COMMUN. (SPAWC), JUN. 2012, PP. 480–484.[34] R. FORSYTHE, T. A. RIETZ, AND T. W. ROSS, \"WISHES, EXPECTATIONS ANDACTIONS: A SURVEY ON PRICE FORMATION IN ELECTION STOCK MARKETS,\" JOURNALOF ECONOMIC BEHAVIOR & ORGANIZATION, VOL. 39, NO. 1, PP. 83–110, 1999.","[34] R. FORSYTHE, T. A. RIETZ, AND T. W. ROSS, \"WISHES, EXPECTATIONS ANDACTIONS: A SURVEY ON PRICE FORMATION IN ELECTION STOCK MARKETS,\" JOURNALOF ECONOMIC BEHAVIOR & ORGANIZATION, VOL. 39, NO. 1, PP. 83–110, 1999.","[35] C. R. PLOTT AND K. Y. CHEN, \"INFORMATION AGGREGATION MECHANISMS:CONCEPT, DESIGN AND IMPLEMENTATION FOR A SALES FORECASTING PROBLEM,\"CALIFORNIA INST. TECHNOL., DIVISION OF THE HUMANITIES AND SOCIAL SCIENCES,WORKING PAPERS 1131, 2002.","[36] R. H. THALER AND W. T. ZIEMBA, \"PARIMUTUEL BETTING MARKETS: RACETRACKSAND LOTTERIES,\" J. ECON. PERSPECT., VOL. 2, NO. 2, PP. 161–174, 1988.","[37] J. M. GANDAR, W. H. DARE, C. R. BROWN, AND R. A. ZUBER, \"INFORMEDTRADERS AND PRICE VARIATIONS IN THE BETTING MARKET FOR PROFESSIONAL BASKET-BALL GAMES,\" J. FINANCE, VOL. 53, NO. 1, PP. 385–401, FEB. 1998.","[38] A. CARTEA AND S. JAIMUNGAL, \"MODELLING ASSET PRICES FOR ALGORITHMIC ANDHIGH-FREQUENCY TRADING,\" APPLIED MATHEMATICAL FINANCE, VOL. 20, NO. 6,PP. 512–547, 2013.","[39] A. N. AKANSU AND M. U. TORUN, A PRIMER FOR FINANCIAL ENGINEERING:FINANCIAL SIGNAL PROCESSING AND ELECTRONIC TRADING. NEW YORK, NY,USA: ACADEMIC, 2015.","[40] M. AVELLANEDA AND S. STOIKOV, \"HIGH-FREQUENCY TRADING IN A LIMIT ORDERBOOK,\" QUANT. FINANCE, VOL. 8, NO. 3, PP. 217–224, 2008.","[41] V. KRISHNAMURTHY AND A. ARYAN, \"QUICKEST DETECTION OF MARKET SHOCKS INAGENT BASED MODELS OF THE ORDER BOOK,\" IN PROC. IEEE 51ST CONF. DECISIONCONTROL (CDC), DEC. 2012, PP. 1480–1485.","[42] M. F. NEUTS, STRUCTURED STOCHASTIC MATRICES OF MG-1 TYPE AND THEIRAPPLICATIONS. NEW YORK, NY, USA: MARCEL DEKKER, 1989.","[43] V. KRISHNAMURTHY, \"BAYESIAN SEQUENTIAL DETECTION WITH PHASE-DISTRIBUTEDCHANGE TIME AND NONLINEAR PENALTY—A POMDP LATTICE PROGRAMMINGAPPROACH,\" IEEE TRANS. INF. THEORY, VOL. 57, NO. 10, PP. 7096–7124, OCT.2011.","[44] S. KARLIN AND Y. RINOTT, \"CLASSES OF ORDERINGS OF MEASURES AND RELATEDCORRELATION INEQUALITIES: I. MULTIVARIATE TOTALLY POSITIVE DISTRIBUTIONS,\"J. MULTIVARIATE ANAL., VOL. 10, NO. 4, PP. 467–498, 1980.","[45] W. S. LOVEJOY, \"SOME MONOTONICITY RESULTS FOR PARTIALLY OBSERVED MARKOVDECISION PROCESSES,\" OPER. RES., VOL. 35, NO. 5, PP. 736–743, 1987.","[46] D. M. TOPKIS, SUPERMODULARITY AND COMPLEMENTARITY. PRINCETON, NJ,USA: PRINCETON UNIV. PRESS, 1998.","[47] D. P. BERTSEKAS, DYNAMIC PROGRAMMING AND OPTIMAL CONTROL. BELMONT,MA, USA: ATHENA SCIENTIFIC, 1995, VOL. 1.[48] D. M. PENNOCK, \"A DYNAMIC PARI-MUTUEL MARKET FOR HEDGING, WAGER-ING, AND INFORMATION AGGREGATION,\" IN PROC. 5TH ACM CONF. ELECTRON.COMMERCE, 2004, PP. 170–179.[49] Y. CHEN, D. M. PENNOCK, AND T. KASTURI, \"AN EMPIRICAL STUDY OF DYNAMICPARI-MUTUEL MARKETS: EVIDENCE FROM THE TECH BUZZ GAME,\" IN PROC. WEB","[48] D. M. PENNOCK, \"A DYNAMIC PARI-MUTUEL MARKET FOR HEDGING, WAGER-ING, AND INFORMATION AGGREGATION,\" IN PROC. 5TH ACM CONF. ELECTRON.COMMERCE, 2004, PP. 170–179.[49] Y. CHEN, D. M. PENNOCK, AND T. KASTURI, \"AN EMPIRICAL STUDY OF DYNAMICPARI-MUTUEL MARKETS: EVIDENCE FROM THE TECH BUZZ GAME,\" IN PROC. WEBMINING WEB USAGE ANAL. WORKSHOP (WEBDKK), LAS VEGAS, NV, USA,","[49] Y. CHEN, D. M. PENNOCK, AND T. KASTURI, \"AN EMPIRICAL STUDY OF DYNAMICPARI-MUTUEL MARKETS: EVIDENCE FROM THE TECH BUZZ GAME,\" IN PROC. WEBMINING WEB USAGE ANAL. WORKSHOP (WEBDKK), LAS VEGAS, NV, USA,2008.","[50] L. BURSZTYN, F. EDERER, B. FERMAN, AND N. YUCHTMAN, \"UNDERSTANDINGMECHANISMS UNDERLYING PEER EFFECTS: EVIDENCE FROM A FIELD EXPERIMENTON FINANCIAL DECISIONS,\" ECONOMETRICA, VOL. 82, PP. 1273–1301, 2014.","[51] D. A. GRAHAM, \"ESTIMATING THE STATE DEPENDENT UTILITY FUNCTION,\" NAT.RESOURCES J., VOL. 23, P. 649, 1983.","[52] W. N. EVANS AND W. K. VISCUSI, \"ESTIMATION OF STATE-DEPENDENT UTILITYFUNCTIONS USING SURVEY DATA,\" REV. ECON. STATIST., VOL. 73, NO. 1, PP. 94–104, 1991.","[53] S. N. AFRIAT, \"THE CONSTRUCTION OF UTILITY FUNCTIONS FROM EXPENDITUREDATA,\" INT. ECON. REV., VOL. 8, NO. 1, PP. 67–77, 1967.","[54] H. R. VARIAN, INTERMEDIATE MICROECONOMICS: A MODERN APPROACH. NEWYORK, NY, USA: NORTON, 2014.","[55] G. CHARNESS, U. GNEEZY, AND A. IMAS, \"EXPERIMENTAL METHODS: ELICITINGRISK PREFERENCES,\" J. ECON. BEH. ORGAN., VOL. 87, PP. 43–51, 2013.","[56] A. MÜLLER AND D. STOYAN, COMPARISON METHODS FOR STOCHASTIC MODELSAND RISKS. HOBOKEN, NJ, USA: WILEY, 2002, VOL. 389.[57] R. T. ROCKAFELLAR AND S. URYASEV, \"CONDITIONAL VALUE-AT-RISK FOR GENERALLOSS DISTRIBUTIONS,\" J. BANKING FINANCE, VOL. 26, NO. 7, PP. 1443–1471,2002.","[57] R. T. ROCKAFELLAR AND S. URYASEV, \"CONDITIONAL VALUE-AT-RISK FOR GENERALLOSS DISTRIBUTIONS,\" J. BANKING FINANCE, VOL. 26, NO. 7, PP. 1443–1471,2002."],"terms":["MARKET","SOCIAL","VALUE","AGENTS","LEARNING","STOCK","AGENT","OBSERVER","DETECTION","CHANGE"]},{"article":"23.pdf","title":"GAUSSIAN PROCESS REGRESSION STOCHASTIC VOLATILITY MODEL FOR FINANCIAL TIME SERIES ","authors":["JIANAN HAN"," XIAO-PING ZHANG"," FANG WANG"],"institutions":[],"abstract":"ABSTRACT—TRADITIONAL ECONOMIC MODELS HAVE RIGID-FORM TRANSI-TION FUNCTIONS WHEN MODELING TIME-VARYING VOLATILITY OF FINANCIALTIME SERIES DATA AND CANNOT CAPTURE OTHER TIME-VARYING DYNAM-ICS IN THE FINANCIAL MARKET. IN THIS PAPER, COMBINING THE GAUSSIANPROCESS STATE-SPACE MODEL FRAMEWORK AND THE STOCHASTIC VOLATIL-ITY (SV) MODEL, WE INTRODUCE A NEW GAUSSIAN PROCESS REGRESSIONSTOCHASTIC VOLATILITY (GPRSV) MODEL BUILDING PROCEDURES FOR FINAN-CIAL TIME SERIES DATA ANALYSIS AND TIME-VARYING VOLATILITY MODELING.THE GPRSV EXTENDS THE SV MODEL. THE FLEXIBLE STOCHASTIC NATUREOF THE GAUSSIAN PROCESS STATE DESCRIPTION ALLOWS THE MODEL TO CAP-TURE MORE TIME-VARYING DYNAMICS OF THE FINANCIAL MARKET. WE ALSOPRESENT THE MODEL ESTIMATION METHODS FOR THE GPRSV MODEL. WEDEMONSTRATE THE SUPERIOR VOLATILITY PREDICTION PERFORMANCE OF OURMODEL WITH BOTH SIMULATED AND EMPIRICAL FINANCIAL DATA.","objective":["IN THIS PAPER, WE PRESENT A NEW GAUSSIAN PROCESS REGRESSIONBASED VOLATILITY (GPRSV) MODEL TO PREDICT THE TIME-VARYINGVOLATILITY OF FINANCIAL TIME SERIES DATA BASED ON THE COMBINATIONOF THE GP-SSM FRAMEWORK AND THE SV MODELING"],"problem":"","methodology":[],"contributes":"","references":["[1] Z. GHAHRAMANI, \"AN INTRODUCTION TO HIDDEN MARKOV MODELS AND BAYESIANNETWORKS,\" INT. J. PATTERN RECOG. ARTIF. INTELL., VOL. 15, NO. 01, PP. 9–42,2001.","[2] T. RAJBHANDARY, X.-P. ZHANG, AND F. WANG, \"PIECEWISE CONSTANT MODELINGAND KALMAN FILTER TRACKING OF SYSTEMATIC MARKET RISK,\" IN PROC. IEEE GLOB.CONF. SIGNAL. INF. PROCESS., DEC. 2013, PP. 1144–1144.","[3] L. VO, X.-P. ZHANG, AND F. WANG, \"MULTIFACTOR SYSTEMATIC RISK ANALYSISBASED ON PIECEWISE MEAN REVERTING MODEL,\" IN PROC. IEEE GLOB. CONF.SIGNAL. INF. PROCESS., DEC. 2013, PP. 1142–1142.","[4] C. E. RASMUSSEN, GAUSSIAN PROCESSES FOR MACHINE LEARNING. CAMBRIDGE,MA, USA: MIT PRESS, 2006.","[5] A. WILSON AND Z. GHAHRAMANI, \"COPULA PROCESSES,\" IN PROC. ADV. NEURALINF. PROCESS. SYST., 2010, PP. 2460–2468.","[6] C. BROWNLEES, R. ENGLE, AND B. KELLY, \"A PRACTICAL GUIDE TO VOLATILITYFORECASTING THROUGH CALM AND STORM,\" J. RISK, VOL. 14, NO. 2, PP. 1–20,2011.","[7] R. TSAY, ANALYSIS OF FINANCIAL TIME SERIES. NEW YORK, NY, USA: WILEY,2010.","[8] R. F. ENGLE, \"AUTOREGRESSIVE CONDITIONAL HETEROSCEDASTICITY WITH ESTIMATESOF THE VARIANCE OF UNITED KINGDOM INFLATION,\" ECONOMETRICA, J. ECONO-METRIC SOC., VOL. 50, PP. 987–1007, 1982.","[9] T. BOLLERSLEV, \"GENERALIZED AUTOREGRESSIVE CONDITIONAL HETEROSKEDASTICITY,\"J. ECONOMETRICS, VOL. 31, PP. 307–327, 1986.","[10] L. R. GLOSTEN, R. JAGANNATHAN, AND D. E. RUNKLE, \"ON THE RELATION BETWEENTHE EXPECTED VALUE AND THE VOLATILITY OF THE NOMINAL EXCESS RETURN ONSTOCKS,\" J. FINANCE, VOL. 48, NO. 5, PP. 1779–1801, 1993.","[11] S. TAYLOR, MODELLING FINANCIAL TIME SERIES. CHICHESTER, CHICHESTER, U.K.:WILEY, 1986.","[12] M. FRIDMAN AND L. HARRIS, \"A MAXIMUM LIKELIHOOD APPROACH FOR NON-GAUSSIAN STOCHASTIC VOLATILITY MODELS,\" J. BUS. ECON. STAT., PP. 284–291,1998.","[13] E. JACQUIER, N. G. POLSON, AND P. ROSSI, \"BAYESIAN ANALYSIS OF STOCHASTICVOLATILITY MODELS,\" J. BUS. ECON. STATIST., VOL. 12, NO. 4, PP. 371–89, 1994.","[14] E. JACQUIER, N. G. POLSON, AND P. E. ROSSI, \"BAYESIAN ANALYSIS OF STOCHASTICVOLATILITY MODELS WITH FAT-TAILS AND CORRELATED ERRORS,\" J. ECONOMETRICS,VOL. 122, NO. 1, PP. 185–212, 2004.","[15] A. C. HARVEY AND N. SHEPHARD, \"ESTIMATION OF AN ASYMMETRIC STOCHASTICVOLATILITY MODEL FOR ASSET RETURNS,\" J. BUS. ECON. STATIST., VOL. 14, NO. 4,PP. 429–434, 1996.","[16] N. SHEPHARD, \"STATISTICAL ASPECTS OF ARCH AND STOCHASTIC VOLATILITY,\" MONOGR.STATIST. APPL. PROBABILITY, VOL. 65, PP. 1–68, 1996.","[17] S. NEIL AND T. ANDERSEN, \"STOCHASTIC VOLATILITY: ORIGINS AND OVERVIEW,\"UNIV. OXFORD, DEPT. ECONOMICS, OXFORD, U.K., ECONOMICS SERIES WORKINGPAPERS 389, 2008.","[18] R. FRIGOLA, Y. CHEN, AND C. RASMUSSEN, \"VARIATIONAL GAUSSIAN PRO-CESS STATE-SPACE MODELS,\" IN PROC. ADV. NEURAL INF. PROCESS. SYST.,2014,PP. 3680–3688.","[19] R. FRIGOLA, F. LINDSTEN, T. B. SCHÖN, AND C. E. RASMUSSEN, \"BAYESIAN IN-FERENCE AND LEARNING IN GAUSSIAN PROCESS STATE-SPACE MODELS WITH PARTICLEMCMC,\" IN PROC. ADV. NEURAL INF. PROCESS. SYST., 2013, PP. 3156–3164.","[20] N. LAWRENCE, \"PROBABILISTIC NON-LINEAR PRINCIPAL COMPONENT ANALYSIS WITHGAUSSIAN PROCESS LATENT VARIABLE MODELS,\" J. MACH. LEARN. RES., VOL. 6,PP. 1783–1816, 2005.","[21] J. KO AND D. FOX, \"GP-BAYESFILTERS: BAYESIAN FILTERING USING GAUSSIANPROCESS PREDICTION AND OBSERVATION MODELS,\" AUTON. ROBOTS, VOL. 27,NO. 1, PP. 75–90, 2009.","[22] J. WANG, A. HERTZMANN, AND D. BLEI, \"GAUSSIAN PROCESS DYNAMICAL MOD-ELS,\" IN PROC. ADV. NEURAL INF. PROCESS. SYST., 2005, PP. 1441–1448.","[23] A. DOUCET, S. GODSILL, AND C. ANDRIEU, \"ON SEQUENTIAL MONTE CARLOSAMPLING METHODS FOR BAYESIAN FILTERING,\" STAT. COMPUT., VOL. 10, NO. 3,PP. 197–208, 2000.","[24] J. S. LIU AND R. CHEN, \"SEQUENTIAL MONTE CARLO METHODS FOR DYNAMICSYSTEMS,\" J. AMER. STAT. ASSOC., VOL. 93, NO. 443, PP. 1032–1044, 1998.","[25] C. ANDRIEU, A. DOUCET, AND R. HOLENSTEIN, \"PARTICLE MARKOV CHAIN MONTECARLO METHODS,\" J. ROY. STATIST. SOC. B, VOL. 72, NO. 3, PP. 269–342, 2010.","[26] F. LINDSTEN, M. JORDAN, AND T. SCHÖN, \"PARTICLE GIBBS WITH ANCESTOR SAM-PLING,\" J. MACH. LEARN. RES., VOL. 15, PP. 2145–2184, 2014.","[27] S. KIM, N. SHEPHARD, AND S. CHIB, \"STOCHASTIC VOLATILITY: LIKELIHOOD IN-FERENCE AND COMPARISON WITH ARCH MODELS,\" REV. ECON. STUD., VOL. 65,NO. 3, PP. 361–393, 1998.","[28] Y. WU, J. M. HERNÁNDEZ-LOBATO, AND Z. GHAHRAMANI, \"GAUSSIAN PROCESSVOLATILITY MODEL,\" IN PROC. ADV. NEURAL INF. PROCESS. SYST., 2014, PP. 1044–1052.","[29] J. CAMPBELL, A. W.-C. LO, AND A. C. MACKINLAY, THE ECONOMETRICS OFFINANCIAL MARKETS. PRINCETON, PRINCETON, NJ, USA: PRINCETON UNIV. PRESS,1997.","[30] S.-H. POON AND C. W. GRANGER, \"FORECASTING VOLATILITY IN FINANCIAL MARKETS:A REVIEW,\" J. ECON. LITERATURE, VOL. 41, NO. 2, PP. 478–539, 2003.","[31] A. A. CHRISTIE, \"THE STOCHASTIC BEHAVIOR OF COMMON STOCK VARIANCES:VALUE, LEVERAGE AND INTEREST RATE EFFECTS,\" J. FINANCIAL ECON., VOL. 10, NO.4, PP. 407–432, 1982.","[32] G. WU, \"THE DETERMINANTS OF ASYMMETRIC VOLATILITY,\" REV. FINANCIAL STUD.,VOL. 14, NO. 3, PP. 837–59, 2001.","[33] J. YU, \"ON LEVERAGE IN A STOCHASTIC VOLATILITY MODEL,\" J. ECONOMETRICS,VOL. 127, NO. 2, PP. 165–178, 2005.","[34] Y. OMORI, S. CHIB, N. SHEPHARD, AND J. NAKAJIMA, \"STOCHASTIC VOLATILITYWITH LEVERAGE: FAST AND EFFICIENT LIKELIHOOD INFERENCE,\" J. ECONOMETRICS,VOL. 140, NO. 2, PP. 425–449, 2007.","[35] T. BOLLERSLEV, R. CHOU, AND K. F. KRONER, \"ARCH MODELING IN FINANCE: AREVIEW OF THE THEORY AND EMPIRICAL EVIDENCE,\" J. ECONOMETRICS, VOL. 52,NOS. 1/2, PP. 5–59, 1992.","[36] D. NELSON, \"CONDITIONAL HETEROSKEDASTICITY IN ASSET RETURNS: A NEW AP-PROACH,\" ECONOMETRICA, VOL. 59, NO. 2, PP. 347–70, MAR. 1991.","[37] J. D. HAMILTON, TIME SERIES ANALYSIS. PRINCETON, PRINCETON, NJ, USA:PRINCETON UNIV. PRESS, 1994.","[38] A. MCLEOD AND W. LI, \"DIAGNOSTIC CHECKING ARMA TIME SERIES MODELSUSING SQUARED-RESIDUAL AUTOCORRELATIONS,\" J. TIME SERIES ANAL., VOL. 4, NO.4, PP. 269–273, 1983.","[39] R. E. KALMAN, \"A NEW APPROACH TO LINEAR FILTERING AND PREDICTION PROB-LEMS,\" TRANS. ASME J. BASIC ENG., VOL. 82, NO. 1, PP. 35–45, 1960.","[40] C. ANDRIEU, N. DE FREITAS, A. DOUCET, AND M. JORDAN, \"AN INTRODUCTION TOMCMC FOR MACHINE LEARNING,\" MACH. LEARN., VOL. 50, NOS. 1/2, PP. 5–43,2003.","[41] N. GORDON, D. SALMOND, AND A. SMITH, \"NOVEL APPROACH TO NONLINEAR/NON-GAUSSIAN BAYESIAN STATE ESTIMATION,\" IEE PROC. RADAR SIGNAL PROCESS.,VOL. 140, NO. 2, PP. 107–113, APR. 1993.","[42] R. M. NEAL, \"SLICE SAMPLING,\" ANN. STATIST., VOL. 31, NO. 3, PP. 705–767,2003.","[43] A. J. PATTON, \"VOLATILITY FORECAST COMPARISON USING IMPERFECT VOLATILITYPROXIES,\" J. ECONOMETRICS, VOL. 160, NO. 1, PP. 246–256, 2011.","[44] S. J. KOOPMAN, B. JUNGBACKER, AND E. HOL, \"FORECASTING DAILY VARIABILITYOF THE S&P 100 STOCK INDEX USING HISTORICAL, REALISED AND IMPLIED VOLATILITYMEASUREMENTS,\" J. EMPIRICAL FINANCE, VOL. 12, NO. 3, PP. 445–475, 2005.","[45] A. TORBEN, T. BOLLERSLEV, F. DIEBOLD, AND P. LABYS, \"MODELING AND FORE-CASTING REALIZED VOLATILITY,\" ECONOMETRICA, VOL. 71, NO. 2, PP. 579–625,2003.","[46] F. DIEBOLD AND R. MARIANO, \"COMPARING PREDICTIVE ACCURACY,\" J. BUS.ECON. STAT., VOL. 13, PP. 253–263, 1995.","[47] M. TAKAHASHI, T. WATANABEB, AND Y. OMORIC, \"VOLATILITY AND QUANTILE FORE-CASTS BY REALIZED STOCHASTIC VOLATILITY MODELS WITH GENERALIZED HYPERBOLICDISTRIBUTION,\" INT. J. FORECASTING, VOL. 32, NO. 2, PP. 437–457, APR. 2016.","[48] T. G. ANDERSEN, T. BOLLERSLEV, F. X. DIEBOLD, AND P. LABYS, \"MODELING ANDFORECASTING REALIZED VOLATILITY,\" ECONOMETRICA, VOL. 71, NO. 2, PP. 579–625,MAR. 2003.","[49] T. G. ANDERSEN, T. BOLLERSLEV, AND F. X. DIEBOLD, \"ROUGHING IT UP: IN-CLUDING JUMP COMPONENTS IN THE MEASUREMENT, MODELING, AND FORECAST-ING OF RETURN VOLATILITY,\" REV. ECON. STATIST., VOL. 89, NO. 4, PP. 701–720,NOV. 2007.","[50] F. CORSI, \"A SIMPLE APPROXIMATE LONG-MEMORY MODEL OF REALIZED VOLATIL-ITY,\" J. FINANCIAL ECONOMETRICS, VOL. 7, NO. 2, P. PP. 174–196, 2009.","[51] M. TAKAHASHI, Y. OMORIC, AND T. WATANABEB, \"ESTIMATING STOCHASTICVOLATILITY MODELS USING DAILY RETURNS AND REALIZED VOLATILITY SIMULTANE-OUSLY,\" COMPUT. STATIST. DATA ANAL., VOL. 53, NO. 6, PP. 2404–2426,APR. 2009.","[52] J. NAKAJIMA AND Y. OMORI, \"STOCHASTIC VOLATILITY MODEL WITH LEVERAGE ANDASYMMETRICALLY HEAVY-TAILED ERROR USING GH SKEW STUDENTS T-DISTRIBUTION,\"COMPUT. STAT. DATA ANAL., VOL. 56, PP. 3690–3704, 2012."],"terms":["MODEL","VOLATILITY","FUNCTION","MODELS","GPRSV","SERIES","RETURN","PARAMETERS","FINANCIAL","PROCESS"]},{"article":"20.pdf","title":"MULTIOBJECTIVE EVOLUTIONARY OPTIMIZATION OF TYPE-2 FUZZY RULE-BASED SYSTEMS FOR FINANCIAL DATA CLASSIFICATION ","authors":["MICHELA ANTONELLI"," DARIO BERNARDO"," HANI HAGRAS"," FELLOW"," FRANCESCO MARCELLONI"],"institutions":[],"abstract":"ABSTRACT—CLASSIFICATION TECHNIQUES ARE BECOMING ESSENTIAL IN THEFINANCIAL WORLD FOR REDUCING RISKS AND POSSIBLE DISASTERS. MANAGERSARE INTERESTED IN NOT ONLY HIGH ACCURACY, BUT IN INTERPRETABILITY ANDTRANSPARENCY AS WELL. IT IS WIDELY ACCEPTED NOW THAT THE COMPRE-HENSION OF HOW INPUTS AND OUTPUTS ARE RELATED TO EACH OTHER ISCRUCIAL FOR TAKING OPERATIVE AND STRATEGIC DECISIONS. FURTHERMORE,INPUTS ARE OFTEN AFFECTED BY CONTEXTUAL FACTORS AND CHARACTERIZEDBY A HIGH LEVEL OF UNCERTAINTY. IN ADDITION, FINANCIAL DATA ARE USUALLYHIGHLY SKEWED TOWARD THE MAJORITY CLASS. WITH THE AIM OF ACHIEVINGHIGH ACCURACIES, PRESERVING THE INTERPRETABILITY, AND MANAGING UN-CERTAIN AND UNBALANCED DATA, THIS PAPER PRESENTS A NOVEL METHODTO DEAL WITH FINANCIAL DATA CLASSIFICATION BY ADOPTING TYPE-2 FUZZYRULE-BASED CLASSIFIERS (FRBCS) GENERATED FROM DATA BY A MULTIOB-JECTIVE EVOLUTIONARY ALGORITHM (MOEA). THE CLASSIFIERS EMPLOY ANAPPROACH, DENOTED AS SCALED DOMINANCE, FOR DEFINING RULE WEIGHTS INSUCH A WAY TO HELP MINORITY CLASSES TO BE CORRECTLY CLASSIFIED. IN PAR-TICULAR, WE HAVE EXTENDED PAES-RCS, AN MOEA-BASED APPROACHTO LEARN CONCURRENTLY THE RULE AND DATA BASES OF FRBCS, FOR MANAG-ING BOTH INTERVAL TYPE-2 FUZZY SETS AND UNBALANCED DATASETS. TO THEBEST OF OUR KNOWLEDGE, THIS IS THE FIRST WORK THAT GENERATES TYPE-2FRBCS BY CONCURRENTLY MAXIMIZING ACCURACY AND MINIMIZING THENUMBER OF RULES AND THE RULE LENGTH WITH THE OBJECTIVE OF PRODUCINGINTERPRETABLE MODELS OF REAL-WORLD SKEWED AND INCOMPLETE FINAN-CIAL DATASETS. THE RULE BASES ARE GENERATED BY EXPLOITING A RULE ANDCONDITION SELECTION (RCS) APPROACH, WHICH SELECTS A REDUCED NUM-BER OF RULES FROM A HEURISTICALLY GENERATED RULE BASE AND A REDUCEDNUMBER OF CONDITIONS FOR EACH SELECTED RULE DURING THE EVOLUTION-ARY PROCESS. THE WEIGHT ASSOCIATED WITH EACH RULE IS SCALED BY THESCALED DOMINANCE APPROACH ON THE FUZZY FREQUENCY OF THE OUTPUTCLASS, IN ORDER TO GIVE A HIGHER WEIGHT TO THE MINORITY CLASS. ASREGARDS THE DATA BASE LEARNING, THE MEMBERSHIP FUNCTION PARAME-TERS OF THE INTERVAL TYPE-2 FUZZY SETS USED IN THE RULES ARE LEARNEDCONCURRENTLY TO THE APPLICATION OF RCS. UNBALANCED DATASETS AREMANAGED BY USING, IN ADDITION TO COMPLEXITY, SELECTIVITY AND SPECI-FICITY AS OBJECTIVES OF THE MOEA RATHER THAN ONLY THE CLASSIFICATIONRATE. WE TESTED OUR APPROACH, NAMED IT2-PAES-RCS, ON 11 FINAN-CIAL DATASETS AND COMPARED OUR RESULTS WITH THE ONES OBTAINED BYTHE ORIGINAL PAES-RCS WITH THREE OBJECTIVES AND WITH AND WITH-OUT SCALED DOMINANCE, THE FRBCS, FUZZY ASSOCIATION RULE-BASEDMANUSCRIPT RECEIVED JUNE 26, 2015; REVISED SEPTEMBER 18, 2015 AND JANUARY21, 2016; ACCEPTED APRIL 20, 2016. DATE OF PUBLICATION JUNE 8, 2016; DATE OFCURRENT VERSION MARCH 29, 2017.M. ANTONELLI WAS WITH THE DIPARTIMENTO DI INGEGNERIA DELL'INFORMAZIONE, UNI-VERSITY OF PISA, PISA I-56100, ITALY. SHE IS NOW WITH THE CENTRE FOR MEDICAL IM-AGE COMPUTING, UNIVERSITY COLLEGE LONDON, LONDON WC1E 6BT, U.K (E-MAIL:MICHELA.ANTONELLI@IET.UNIPI.IT).D. BERNARDO AND H. HAGRAS ARE WITH THE COMPUTATIONAL INTELLIGENCE CENTRE,SCHOOL OF COMPUTER SCIENCE AND ELECTRONIC ENGINEERING UNIVERSITY OF ESSEX,COLCHESTER CO43SQ, U.K. (E-MAIL: DARIOB@HOTMAIL.COM; HANI@ESSEX.AC.UK).F. MARCELLONI IS WITH THE DIPARTIMENTO DI INGEGNERIA DELL'INFORMAZIONE, UNI-VERSITY OF PISA, PISA I-56100, ITALY (E-MAIL: FRANCESCO.MARCELLONI@IET.UNIPI.IT).DIGITAL OBJECT IDENTIFIER 10.1109/TFUZZ.2016.2578341CLASSIFICATION MODEL FOR HIGH-DIMENSIONAL DATASET (FARC-HD) ANDFUZZY UNORDERED RULES INDUCTION ALGORITHM (FURIA), THE CLASSICALC4.5 DECISION TREE ALGORITHM, AND ITS COST-SENSITIVE VERSION. USINGNONPARAMETRIC STATISTICAL TESTS, WE WILL SHOW THAT IT2-PAES-RCSGENERATES FRBCS WITH, ON AVERAGE, ACCURACY STATISTICALLY COMPARA-BLE WITH AND COMPLEXITY LOWER THAN THE ONES GENERATED BY THE TWOVERSIONS OF THE ORIGINAL PAES-RCS. FURTHER, THE FRBCS GENERATEDBY FARC-HD AND FURIA AND THE DECISION TREES COMPUTED BY C4.5AND ITS COST-SENSITIVE VERSION, DESPITE THE HIGHEST COMPLEXITY, RESULTTO BE LESS ACCURATE THAN THE FRBCS GENERATED BY IT2-PAES-RCS.FINALLY, WE WILL HIGHLIGHT HOW THESE FRBCS ARE EASILY INTERPRETABLEBY SHOWING AND DISCUSSING ONE OF THEM.","objective":["IN THIS PAPER, WE EXTEND PAES-RCS, A MULTIOBJECTIVE EVOLU-TIONARY FUZZY SYSTEM THAT HAS BEEN RECENTLY PROPOSED BY SOME OFTHE AUTHORS OF THIS PAPER IN [25] AND [26]","IN THIS PAPER, WE EXTEND PAES-RCS ALONG THREE DIRECTIONS","TERIZED BY A HIGH LEVEL OF UNCERTAINTY"],"problem":"","methodology":[],"contributes":"","references":["[1] \"THE REGULATORY OPPORTUNITY IN FINANCIAL SERVICES,\" (2014).[ONLINE]. AVAILABLE: HTTP://BUTLERANALYTICS.COM/REGULATORY-OPPORTUNITY-FINANCIAL-SERVICES/[2] \"PREDICTIVE MODELS - RISKS AND BENEFITS,\" (2014). [ONLINE]. AVAILABLE:HTTP://BUTLERANALYTICS.COM/PREDICTIVE-MODELS-RISKS-BENEFITS/[3] \"PREDICTIVE MODEL MANAGEMENT STRATEGY,\" (2014). [ONLINE]. AVAILABLE:HTTP://BUTLERANALYTICS.COM/FINANCIAL-REGULATION-PREDICTIVE-MODELS/","[2] \"PREDICTIVE MODELS - RISKS AND BENEFITS,\" (2014). [ONLINE]. AVAILABLE:HTTP://BUTLERANALYTICS.COM/PREDICTIVE-MODELS-RISKS-BENEFITS/[3] \"PREDICTIVE MODEL MANAGEMENT STRATEGY,\" (2014). [ONLINE]. AVAILABLE:HTTP://BUTLERANALYTICS.COM/FINANCIAL-REGULATION-PREDICTIVE-MODELS/[4] A. GARCIA-ALMANZA AND E. TSANG, \"FORECASTING STOCK PRICES USING GENETICPROGRAMMING AND CHANCE DISCOVERY,\" PRESENTED AT THE 12TH INT. CONF.","[3] \"PREDICTIVE MODEL MANAGEMENT STRATEGY,\" (2014). [ONLINE]. AVAILABLE:HTTP://BUTLERANALYTICS.COM/FINANCIAL-REGULATION-PREDICTIVE-MODELS/[4] A. GARCIA-ALMANZA AND E. TSANG, \"FORECASTING STOCK PRICES USING GENETICPROGRAMMING AND CHANCE DISCOVERY,\" PRESENTED AT THE 12TH INT. CONF.COMPUT. ECON. FINANCE, LIMASSOL, CYPRUS, JUN. 22–24, 2006.","[4] A. GARCIA-ALMANZA AND E. TSANG, \"FORECASTING STOCK PRICES USING GENETICPROGRAMMING AND CHANCE DISCOVERY,\" PRESENTED AT THE 12TH INT. CONF.COMPUT. ECON. FINANCE, LIMASSOL, CYPRUS, JUN. 22–24, 2006.","[5] A. GARCIA-ALMANZA AND E. TSANG, \"EVOLVING DECISION RULES TO PREDICTINVESTMENT OPPORTUNITIES,\" INT. J. AUTOM. COMPUT., VOL. 5, NO. 1, PP. 22–31, 2008.","[6] A. GARCIA-ALMANZA, \"NEW CLASSIFICATION METHODS FOR GATHERING PATTERNS INTHE CONTEXT OF GENETIC PROGRAMMING,\" PH.D. DISSERTATION, DEPT. COMPUT.ELECTRON. SYST., UNIV. ESSEX, COLCHESTER, U.K., 2008.","[7] L. BREIMAN, \"RANDOM FORESTS,\" MACH. LEARN., VOL. 45, NO. 1, PP. 5–32,2001.","[8] J. CASILLAS, O. CORDON, F. HERRERA, L. MAGDALENA, EDS., INTERPRETABILITYISSUES IN FUZZY MODELLING. NEW YORK, NY, USA: SPRINGER, 2003.","[9] M. SETNES AND H. ROUBOS, \"GA-FUZZY MODELLING AND CLASSIFICATION: COM-PLEXITY AND PERFORMANCE,\" IEEE TRANS. FUZZY SYST., VOL. 8, NO. 5, PP. 509–522, OCT. 2000.","[10] H. ISHIBUCHI AND T. YAMAMOTO, \"INTERPRETABILITY ISSUES IN FUZZY GENETIC-BASED MACHINE LEARNING FOR LINGUISTIC MODELLING,\" IN MODELLING WITHWORDS (LECTURE NOTES IN COMPUTER SCIENCE), VOL. 2873.","[11] H. ISHIBUCHI, T. NAKASHIMA, AND M. NII, CLASSIFICATION AND MODELINGWITH LINGUISTIC INFORMATION GRANULES: ADVANCED APPROACHES TO LINGUISTICDATA MINING. BERLIN, GERMANY: SPRINGER-VERLAG, 2004.","[12] P. DUCANGE AND F. MARCELLONI, \"MULTI-OBJECTIVE EVOLUTIONARY FUZZY SYS-TEMS,\" IN PROC. 9TH INT. WORKSHOP FUZZY LOGIC APPL., 2011, PP. 83–90.[13] M. FAZZOLARI, R. ALCALÁ, Y. NOJIMA, H. ISHIBUCHI, AND F. HERRERA, \"A REVIEWOF THE APPLICATION OF MULTIOBJECTIVE EVOLUTIONARY FUZZY SYSTEMS: CURRENTSTATUS AND FURTHER DIRECTIONS,\" IEEE TRANS. FUZZY SYST., VOL. 21, NO. 1,PP. 45–65, FEB. 2013.","[13] M. FAZZOLARI, R. ALCALÁ, Y. NOJIMA, H. ISHIBUCHI, AND F. HERRERA, \"A REVIEWOF THE APPLICATION OF MULTIOBJECTIVE EVOLUTIONARY FUZZY SYSTEMS: CURRENTSTATUS AND FURTHER DIRECTIONS,\" IEEE TRANS. FUZZY SYST., VOL. 21, NO. 1,PP. 45–65, FEB. 2013.","[14] P. MELIN AND O. CASTILLO, \"A REVIEW ON TYPE-2 FUZZY LOGIC APPLICATIONSIN CLUSTERING, CLASSIFICATION AND PATTERN RECOGNITION,\" APPL. SOFT COMPUT.,VOL. 21, PP. 568–577, 2014.","[15] C. GLACKIN, L. MAGUIRE, R. MCIVOR, P. HUMPHREYS, AND P. HERMAN, \"ACOMPARISON OF FUZZY STRATEGIES FOR CORPORATE ACQUISITION ANALYSIS,\" FUZZYSETS SYST., VOL. 159, NO. 18, PP. 2039–2056, 2007.","[16] D. BERNARDO, H. HAGRAS, AND E. TSANG, \"A GENETIC TYPE-2 FUZZY LOGIC BASEDSYSTEM FOR THE GENERATION OF SUMMARISED LINGUISTIC PREDICTIVE MODELS FORFINANCIAL APPLICATIONS,\" SOFT COMPUT., VOL. 17, NO. 12, PP. 2185–2201,2013.","[17] J.A SANZ, D. BERNARDO, F. HERRERA, H. BUSTINCE, AND H. HAGRAS, \"A COM-PACT EVOLUTIONARY INTERVAL-VALUED FUZZY RULE-BASED CLASSIFICATION SYSTEMFOR THE MODELING AND PREDICTION OF REAL-WORLD FINANCIAL APPLICATIONS WITHIMBALANCED DATA,\" IEEE TRANS. FUZZY SYST., VOL. 23, NO. 4, PP. 973–990,AUG. 2015.","[18] D. WU AND W. TAN, \"GENETIC LEARNING AND PERFORMANCE EVALUATION OFINTERVAL TYPE-2 FUZZY LOGIC CONTROLLERS,\" ENG. APPL. ARTIF. INTELL., VOL. 19,NO. 8, PP. 819–841, 2006.","[19] R. MARTÍNEZ-SOTO, O. CASTILLO, L. T. AGUILAR, AND A. R. DÍAZ, \"A HYBRIDOPTIMIZATION METHOD WITH PSO AND GA TO AUTOMATICALLY DESIGN TYPE-1AND TYPE-2 FUZZY LOGIC CONTROLLERS,\" INT. J. MACH. LEARN. CYBERN., VOL. 6,NO. 2, PP. 175–196, 2015.","[20] O. LINDA AND M. MANIC, \"UNCERTAINITY-ROBUST DESIGN OF INTERVAL TYPE-2FUZZY LOGIC CONTROLLER FOR DELTA PARALLEL ROBOT,\" IEEE TRANS. IND. INFORMAT.,VOL. 7, NO. 4, PP. 661–670, NOV. 2011.","[21] M. ALMARAAHI, R. JOHN, AND S. AHMADI, \"LEARNING OF TYPE-2 FUZZY LOGICSYSTEMS BY SIMULATED ANNEALING WITH ADAPTIVE STEP SIZE,\" IN ELECTRICALENGINEERING AND INTELLIGENT SYSTEMS (SER. LECTURE NOTES IN ELECTRICAL EN-GINEERING), VOL. 130. BERLIN, GERMANY: SPRINGER-VERLAG, 2013, PP. 53–64.[22] T. KUMBASAR AND H. HAGRAS, \"BIG BANG-BIG CRUNCH OPTIMIZATION BASEDINTERVAL TYPE-2 FUZZY PID CASCADE CONTROLLER DESIGN STRATEGY,\" INF. SCI.,","[22] T. KUMBASAR AND H. HAGRAS, \"BIG BANG-BIG CRUNCH OPTIMIZATION BASEDINTERVAL TYPE-2 FUZZY PID CASCADE CONTROLLER DESIGN STRATEGY,\" INF. SCI.,VOL. 282, PP. 277–295, 2014.","[23] J. MENDEL, H. HAGRAS, W-W. TAN, W. MELEK, AND H. YING, INTRODUCTIONTO TYPE-2 FUZZY LOGIC CONTROL: THEORY AND APPLICATIONS. NEW YORK, NY,USA: WILEY/IEEE PRESS, 2014.","[24] G. G. SUNDARKUMAR AND V. RAVI, \"A NOVEL HYBRID UNDERSAMPLING METHODFOR MINING UNBALANCED DATASETS IN BANKING AND INSURANCE,\" ENG. APPL.ARTIF. INTELL., VOL. 36, PP. 368–377, 2015.","[25] M. ANTONELLI, P. DUCANGE, AND F. MARCELLONI, \"MULTI-OBJECTIVE EVOLUTION-ARY RULE AND CONDITION SELECTION FOR DESIGNING FUZZY RULE-BASED CLASSIFIERS,\"IN PROC. IEEE INT. CONF. FUZZY SYST., BRISBANE, AUSTRALIA, JUN. 10–15, 2012,PP. 794–800.[26] M. ANTONELLI, P. DUCANGE, AND F. MARCELLONI, \"A FAST AND EFFICIENT MULTI-OBJECTIVE EVOLUTIONARY LEARNING SCHEME FOR FUZZY RULE-BASED CLASSIFIERS,\"","[26] M. ANTONELLI, P. DUCANGE, AND F. MARCELLONI, \"A FAST AND EFFICIENT MULTI-OBJECTIVE EVOLUTIONARY LEARNING SCHEME FOR FUZZY RULE-BASED CLASSIFIERS,\"INF. SCI., VOL. 283, PP. 36–54, 2014.","[27] M. ANTONELLI, P. DUCANGE, AND F. MARCELLONI, \"AN EXPERIMENTAL STUDYON EVOLUTIONARY FUZZY CLASSIFIERS DESIGNED FOR MANAGING IMBALANCEDDATASETS,\" NEUROCOMPUT., VOL. 146, PP. 125–136, 2014.","[28] J. ALCALA-FDEZ, R. ALCALA, AND F. HERRERA, \"A FUZZY ASSOCIATION RULE-BASED CLASSIFICATION MODEL FOR HIGH-DIMENSIONAL PROBLEMS WITH GENETICRULE SELECTION AND LATERAL TUNING,\" IEEE TRANS. FUZZY SYST., VOL. 19, NO. 5,PP. 857–872, OCT. 2011.","[29] J. HUHN AND E. HULLERMEIER, \"FURIA: AN ALGORITHM FOR UNORDERED FUZZYRULE INDUCTION,\" DATA MINING KNOWL. DISCOVERY, VOL. 19, NO. 3, PP. 293–319, 2009.","[30] J. QUINLAN, C4.5: PROGRAMS FOR MACHINE LEARNING. SAN MATEO, CA, USA:MORGAN KAUFFMAN, 1993.","[31] K. M. TING, \"AN INSTANCE-WEIGHTING METHOD TO INDUCE COST-SENSITIVE TREES,\"IEEE TRANS. KNOWL. DATA ENG., VOL. 14, NO. 3, PP. 659–665, MAY/JUN.2002.","[32] Q. LIANG AND J. M. MENDEL, \"INTERVAL TYPE-2 FUZZY LOGIC SYSTEMS: THEORYAND DESIGN,\" IEEE TRANS. FUZZY SYST., VOL. 8, NO. 5, PP. 535–550, OCT.2000.","[33] D. BERNARDO, H. HAGRAS, AND E. TSANG, \"AN INTERVAL TYPE-2 FUZZY LOGICSYSTEM FOR THE MODELLING AND PREDICTION OF FINANCIAL APPLICATIONS,\" PRE-SENTED AT THE INT. CONF. AUTON. INTELL. SYST., AVEIRO, PORTUGAL, JUN. 25–27,2012.","[34] D. BERNARDO, H. HAGRAS, AND E. TSANG, \"AN INTERVAL TYPE-2 FUZZY LOGICBASED SYSTEM FOR MODEL GENERATION AND SUMMARIZATION OF ARBITRAGE OP-PORTUNITIES IN STOCK MARKETS,\" PRESENTED AT THE U.K. WORKSHOP COMPUT.INTELL., EDINBURGH, U.K., SEP. 5–7, 2012.","[35] D. BERNARDO, H. HAGRAS, AND E. TSANG, \"A GENETIC TYPE-2 FUZZY LOGIC BASEDSYSTEM FOR FINANCIAL APPLICATIONS MODELLING AND PREDICTION,\" PRESENTEDAT THE PROC. IEEE INT. CONF. FUZZY SYST., HYDERABAD, INDIA, JUL. 7–10,2013.","[36] A. ZHOU, B-Y. QU, H. LI, S-Z. ZHAO, P. N. SUGANTHAN, AND Q. ZHANG,\"MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS: A SURVEY OF THE STATE OF THE ART,\"SWARM EVOL. COMPUT., VOL. 1, NO. 1, PP. 32–49, 2011.","[37] P. DUCANGE, B. LAZZERINI, AND F. MARCELLONI, \"MULTI-OBJECTIVE GENETICFUZZY CLASSIFIERS FOR IMBALANCED AND COST-SENSITIVE DATASETS,\" SOFT COMPUT.,VOL. 14, NO. 10, PP. 713–728, 2010.","[38] F. HERRERA, \"GENETIC FUZZY SYSTEMS: TAXONOMY, CURRENT RESEARCH TRENDSAND PROSPECTS,\" EVOL. INTELL., VOL. 1, NO. 1, PP. 27–46, 2008.","[39] J. M. ALONSO AND L. MAGDALENA, \"EDITORIAL: SPECIAL ISSUE ON INTERPRETABLEFUZZY SYSTEMS,\" INF. SCI., VOL. 181, NO. 20, PP. 4331–4339, 2011.","[40] M. J. GACTO, R. ALCALÁ, AND F. HERRERA, \"INTERPRETABILITY OF LINGUISTIC FUZZYRULE-BASED SYSTEMS: AN OVERVIEW OF INTERPRETABILITY MEASURES,\" INF. SCI.,VOL. 128, NO. 20, PP. 4340–4360, 2011.","[41] M. COCOCCIONI, P. DUCANGE, B. LAZZERINI, AND F. MARCELLONI, \"A PARETO-BASED MULTI-OBJECTIVE EVOLUTIONARY APPROACH TO THE IDENTIFICATION OF MAM-DANI FUZZY SYSTEMS,\" SOFT COMPUT., VOL. 11, NO. 11, PP. 1013–1031,2007.","[42] A. BOTTA, B. LAZZERINI, F. MARCELLONI, AND D. STEFANESCU, \"CONTEXT ADAP-TATION OF FUZZY SYSTEMS THROUGH A MULTI-OBJECTIVE EVOLUTIONARY APPROACHBASED ON A NOVEL INTERPRETABILITY INDEX,\" SOFT COMPUT., VOL. 13, NO. 5,PP. 437–449, 2009.","[43] R. ALCALÁ, P. DUCANGE, F. HERRERA, B. LAZZERINI, AND F. MARCELLONI, \"AMULTI-OBJECTIVE EVOLUTIONARY APPROACH TO CONCURRENTLY LEARN RULE AND DATABASES OF LINGUISTIC FUZZY RULE-BASED SYSTEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 17, NO. 5, PP. 1106–1122, OCT. 2009.","[44] M. ANTONELLI, P. DUCANGE, B. LAZZERINI, AND F. MARCELLONI,\"MULTI-OBJECTIVE EVOLUTIONARY LEARNING OF GRANULARITY, MEMBERSHIP FUNC-TION PARAMETERS AND RULES OF MAMDANI FUZZY SYSTEMS,\" EVOL. INTELL., VOL. 2,NO. 1–2, PP. 21–37, 2009.","[45] J. CASILLAS, P. MARTINEZ, AND A. D. BENITEZ, \"LEARNING CONSISTENT, COMPLETEAND COMPACT SETS OF FUZZY RULES IN CONJUNCTIVE NORMAL FORM FOR REGRESSIONPROBLEMS,\" SOFT COMPUT., VOL. 13, NO. 5, PP. 451–465, 2009.","[46] P. PULKKINEN AND H. KOIVISTO, \"A DYNAMICALLY CONSTRAINED MULTIOBJECTIVEGENETIC FUZZY SYSTEM FOR REGRESSION PROBLEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 18, NO. 1, PP. 161–177, FEB. 2010.","[47] M. ANTONELLI, P. DUCANGE, B. LAZZERINI, AND F. MARCELLONI, \"LEARNINGCONCURRENTLY DATA AND RULE BASES OF MAMDANI FUZZY RULE-BASED SYSTEMS BYEXPLOITING A NOVEL INTERPRETABILITY INDEX,\" SOFT COMPUT., VOL. 15, NO. 10,PP. 1981–1998, 2011.","[48] M. ANTONELLI, P. DUCANGE, B. LAZZERINI, AND F. MARCELLONI, \"LEARNINGKNOWLEDGE BASES OF MULTI-OBJECTIVE EVOLUTIONARY FUZZY SYSTEMS BY SIMUL-TANEOUSLY OPTIMIZING ACCURACY, COMPLEXITY AND PARTITION INTEGRITY,\" SOFTCOMPUT., VOL. 15, NO. 12, PP. 2335–2354, 2011.","[49] M. J. GACTO, R. ALCALA, AND F. HERRERA, \"INTEGRATION OF AN INDEX TO PRESERVETHE SEMANTIC INTERPRETABILITY IN THE MULTI-OBJECTIVE EVOLUTIONARY RULE SE-LECTION AND TUNING OF LINGUISTIC FUZZY SYSTEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 18, NO. 3, PP. 515–531, JUN. 2010.","[50] R. ALCALÁ, M. J. GACTO, AND F. HERRERA, \"A FAST AND SCALABLE MULTIOBJECTIVEGENETIC FUZZY SYSTEM FOR LINGUISTIC FUZZY MODELING IN HIGH-DIMENSIONALREGRESSION PROBLEMS,\" IEEE TRANS. FUZZY SYST., VOL. 19, NO. 4, PP. 666–681,AUG. 2011.","[51] M. ANTONELLI, P. DUCANGE, AND F. MARCELLONI, \"GENETIC TRAINING INSTANCESELECTION IN MULTI-OBJECTIVE EVOLUTIONARY FUZZY SYSTEMS: A CO-EVOLUTIONARYAPPROACH,\" IEEE TRANS. FUZZY SYST., VOL. 20, NO. 2, PP. 276–290, APR. 2012.","[52] H. ISHIBUCHI, T. MURATA, AND I. B. TURKSEN, \"SINGLE-OBJECTIVE AND TWOOBJECTIVE GENETIC ALGORITHMS FOR SELECTING LINGUISTIC RULES FOR PATTERNCLASSIFICATION PROBLEMS,\" FUZZY SETS SYST., VOL. 89, NO. 2, PP. 135–150,1997.","[53] O. CORDON, M. J. DEL JESUS, J. CASILLAS, F. HERRERA, L. MAGDALENA, AND P.VILLAR, \"A MULTIOBJECTIVE GENETIC LEARNING PROCESS FOR JOINT FEATURE SELEC-TION AND GRANULARITY AND CONTEXT LEARNING IN FUZZY RULE-BASED CLASSIFICA-TION SYSTEMS,\" IN INTERPRETABILITY ISSUES IN FUZZY MODELING, J. CASILLAS,F. HERRERA, O. CORDOON, AND L. MAGDALENA, EDS. SECAUCUS, NJ, USA:SPRINGER-VERLAG, 2003, PP. 79–99.[54] H. ISHIBUCHI AND T. YAMAMOTO, \"FUZZY RULE SELECTION BY MULTI-OBJECTIVE","[54] H. ISHIBUCHI AND T. YAMAMOTO, \"FUZZY RULE SELECTION BY MULTI-OBJECTIVEGENETIC LOCAL SEARCH ALGORITHMS AND RULE EVALUATION MEASURES IN DATA MIN-ING,\" FUZZY SETS SYST., VOL. 141, PP. 59–88, 2004.","[55] H. ISHIBUCHI AND Y. NOJIMA, \"ANALYSIS OF INTERPRETABILITY-ACCURACY TRADEOFFOF FUZZY SYSTEMS BY MULTIOBJECTIVE FUZZY GENETICS-BASED MACHINE LEARN-ING,\" INT. J. APPROX. REASON., VOL. 44, NO. 1, PP. 4–31, 2007.","[56] R. ALCALÁ, Y. NOJIMA, F. HERRERA, AND H. ISHIBUCHI, \"MULTIOBJECTIVE GENETICFUZZY RULE SELECTION OF SINGLE GRANULARITY-BASED FUZZY CLASSIFICATION RULESAND ITS INTERACTION WITH THE LATERAL TUNING OF MEMBERSHIP FUNCTIONS,\" SOFTCOMPUT., VOL. 15, NO. 12, PP. 2303–2318, 2011.","[57] P. PULKKINEN AND H. KOIVISTO, \"FUZZY CLASSIFIER IDENTIFICATION USING DE-CISION TREE AND MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS,\" INT. J. APPROX.REASON., VOL. 48, PP. 526–543, 2008.","[58] K. TRAWINSKI, O. CORDON, AND A. QUIRIN, \"A STUDY ON THE USE OF MULTIOB-JECTIVE GENETIC ALGORITHMS FOR CLASSIFIER SELECTION IN FURIA-BASED FUZZYMULTICLASSIFIERS,\" INT. J. COMPUT. INTELL. SYST., VOL. 5, NO. 2, PP. 231–253,2012.","[59] O. CORDON, M. J. DEL JESUS, AND F. HERRERA, \"A PROPOSAL ON REASONING METH-ODS IN FUZZY RULE-BASED CLASSIFICATION SYSTEMS,\" INT. J. APPROX. REASON.,VOL. 20, NO. 1, PP. 21–45, 1999.","[60] W. W. COHEN, \"FAST EFFECTIVE RULE INDUCTION,\" IN PROC. 12TH INT. CONF.MACH. LEARNING, 1995, PP. 115–123.[61] J. R. QUINLAN, \"BOOSTING, BAGGING, AND C4.5,\" IN PROC. 13TH NAT. CONF.ARTIF. INTELL., 1996, VOL. 1, PP. 725–730.[62] N. V. CHAWLA, K. W. BOWYER, L. O. HALL, AND W. P. KEGELMEYER, \"SMOTE:SYNTHETIC MINORITY OVER-SAMPLING TECHNIQUE,\" J. ARTIF. INTELL. RES., VOL. 16,","[61] J. R. QUINLAN, \"BOOSTING, BAGGING, AND C4.5,\" IN PROC. 13TH NAT. CONF.ARTIF. INTELL., 1996, VOL. 1, PP. 725–730.[62] N. V. CHAWLA, K. W. BOWYER, L. O. HALL, AND W. P. KEGELMEYER, \"SMOTE:SYNTHETIC MINORITY OVER-SAMPLING TECHNIQUE,\" J. ARTIF. INTELL. RES., VOL. 16,PP. 321–357, 2002.","[62] N. V. CHAWLA, K. W. BOWYER, L. O. HALL, AND W. P. KEGELMEYER, \"SMOTE:SYNTHETIC MINORITY OVER-SAMPLING TECHNIQUE,\" J. ARTIF. INTELL. RES., VOL. 16,PP. 321–357, 2002.","[63] J. ALCALA-FDEZ, A. FERNANDEZ, J. LUENGO, J. DERRAC, AND S. GARCIA, \"KEELDATA-MINING SOFTWARE TOOL: DATA SET REPOSITORY, INTEGRATION OF ALGORITHMSAND EXPERIMENTAL ANALYSIS FRAMEWORK,\" MULTIPLE-VALUED LOG. SOFT COM-PUT., VOLS. 2/3, PP. 255–287, 2011.","[64] T. FAWCETT, \"AN INTRODUCTION TO ROC ANALYSIS,\" PATTERN RECOG. LETT.,VOL. 27, NO. 8, PP. 861–874, 2006.","[65] M. FRIEDMAN, \"THE USE OF RANKS TO AVOID THE ASSUMPTION OF NORMALITYIMPLICIT IN THE ANALYSIS OF VARIANCE,\" J. AMER. STAT. ASSOC., VOL. 32, PP. 675–701, 1937.","[66] R. L. IMAN AND J. H. DAVENPORT, \"APPROXIMATIONS OF THE CRITICAL REGIONOF THE FRIEDMAN STATISTIC,\" COMMUN. STATIST. A, THEORY METHODS, VOL. 9,PP. 571–595, 1980.","[67] S. HOLM, \"A SIMPLE SEQUENTIALLY REJECTIVE MULTIPLE TEST PROCEDURE,\" SCAND.J. STATIST., VOL. 6, PP. 65–70, 1979.","[68] D. J. SHESKIN, HANDBOOK OF PARAMETRIC AND NONPARAMETRIC STATISTI-CAL PROCEDURES, 4TH ED. LONDON, U.K.: CHAPMAN & HALL/CRC PRESS,2007."],"terms":["FUZZY","RULES","NUMBER","GENERATED","CLASSIFIERS","DATASETS","WHICH","FINANCIAL","MEMBERSHIP","BASED"]},{"article":"17.pdf","title":"ESTIMATING TIPPING POINTS IN FEEDBACK-DRIVEN FINANCIAL NETWORKS ","authors":["ZVONKO KOSTANJČAR"," STJEPAN BEGUŠIĆ"," HARRY EUGENE STANLEY"," BORIS PODOBNIK"],"institutions":[],"abstract":"ABSTRACT—MUCH RESEARCH HAS BEEN CONDUCTED ARGUING THAT TIP-PING POINTS AT WHICH COMPLEX SYSTEMS EXPERIENCE PHASE TRANSITIONSARE DIFFICULT TO IDENTIFY. TO TEST THE EXISTENCE OF TIPPING POINTS INFINANCIAL MARKETS, BASED ON THE ALTERNATING OFFER STRATEGIC MODELWE PROPOSE A NETWORK OF BARGAINING AGENTS WHO MUTUALLY EITHER CO-OPERATE OR COMPETE, WHERE THE FEEDBACK MECHANISM BETWEEN TRAD-ING AND PRICE DYNAMICS IS DRIVEN BY AN EXTERNAL \"HIDDEN\" VARIABLER THAT QUANTIFIES THE DEGREE OF MARKET OVERPRICING. DUE TO THE FEED-BACK MECHANISM, R FLUCTUATES AND OSCILLATES OVER TIME, AND THUSPERIODS WHEN THE MARKET IS UNDERPRICED AND OVERPRICED OCCUR RE-PEATEDLY. AS THE MARKET BECOMES OVERPRICED, BUBBLES ARE CREATEDTHAT ULTIMATELY BURST AS THE MARKET REACHES A CRASH TIPPING POINTRC. THE MARKET STARTS RECOVERING FROM THE CRASH AS A RECOVERY TIP-PING POINT RR IS REACHED. THE PROBABILITY THAT THE INDEX WILL DROPIN THE NEXT YEAR EXHIBITS A STRONG HYSTERESIS BEHAVIOR VERY MUCHALIKE CRITICAL TRANSITIONS IN OTHER COMPLEX SYSTEMS. THE PROBABILITYDISTRIBUTION FUNCTION OF R HAS A BIMODAL SHAPE CHARACTERISTIC OFSMALL SYSTEMS NEAR THE TIPPING POINT. BY EXAMINING THE S&P500INDEX WE ILLUSTRATE THE APPLICABILITY OF THE MODEL AND DEMONSTRATETHAT THE FINANCIAL DATA EXHIBIT TIPPING POINTS THAT AGREE WITH THEMODEL. WE REPORT A COINTEGRATION BETWEEN THE RETURNS OF THE S&P500 INDEX AND ITS INTRINSIC VALUE.","objective":[],"problem":"","methodology":[],"contributes":"","references":["[1] R. ALBERT AND A.-L. BARABÁSI, \"STATISTICAL MECHANICS OF COMPLEXNETWORKS,\" REV. MOD. PHYS., VOL. 74, PP. 47–97, 2002.","[2] D. BROCKMANN AND D. HELBING, \"THE HIDDEN GEOMETRY OF COMPLEX,NETWORK-DRIVEN CONTAGION PHENOMENA,\" SCIENCE, VOL. 342, PP. 1337–42,2013.","[3] S. B. ROSENTHAL, C. R. TWOMEY, A. T. HARTNETT, H. S. WU, AND I. D. COUZIN,\"REVEALING THE HIDDEN NETWORKS OF INTERACTION IN MOBILE ANIMAL GROUPSALLOWS PREDICTION OF COMPLEX BEHAVIORAL CONTAGION,\" PROC. NAT. ACAD. SCI.,VOL. 112, PP. 4690–4695, 2015.","[4] M. BOGUÑÁ, D. KRIOUKOV, AND K. C. CLAFFY, \"NAVIGABILITY OF COMPLEXNETWORKS,\" NATURE PHYS., VOL. 5, PP. 74–80, 2008.","[5] I. DOBSON, B. A. CARRERAS, V. E. LYNCH, AND D. E. NEWMAN, \"COMPLEXSYSTEMS ANALYSIS OF SERIES OF BLACKOUTS: CASCADING FAILURE, CRITICAL POINTS,AND SELF-ORGANIZATION,\" CHAOS, VOL. 17, 2007 ART. NO. 026103.","[6] P.-A. NOËL, C. D. BRUMMITT, AND R. M. DSOUZA, \"CONTROLLING SELF-ORGANIZING DYNAMICS ON NETWORKS USING MODELS THAT SELF-ORGANIZE,\" PHYS.REV. LETT., VOL. 111, 2013, ART. NO. 078701.","[7] M. SCHEFFER, S. CARPENTER, J. A. FOLEY, C. FOLKE, AND B. WALKER, \"CATAS-TROPHIC SHIFTS IN ECOSYSTEMS,\" NATURE, VOL. 413, PP. 591–596, 2001.","[8] R. M. MAY, S. A. LEVIN, AND G. SUGIHARA, \"COMPLEX SYSTEMS: ECOLOGYFOR BANKERS,\" NATURE, VOL. 451, PP. 893–895, 2008.","[9] J. M. DRAKE AND B. D. GRIFFEN, \"EARLY WARNING SIGNALS OF EXTINCTION INDETERIORATING ENVIRONMENTS,\" NATURE, VOL. 467, PP. 456–459, 2010.","[10] M. SCHEFFER, \"COMPLEX SYSTEMS: FORESEEING TIPPING POINTS,\" NATURE,VOL. 467, PP. 411–412, 2010.","[11] M. SCHEFFER ET AL., \"ANTICIPATING CRITICAL TRANSITIONS,\" SCIENCE, VOL. 338,PP. 344–348, 2012.","[12] C. BOETTIGER AND A. HASTINGS, \" TIPPING POINTS: FROM PATTERNS TO PREDIC-TIONS,\" NATURE, VOL. 493, PP. 157–158, 2013.","[13] T. S. LONTZEK, Y. CAI, K. L. JUDD, AND T. M. LENTON, \" STOCHASTIC INTEGRATEDASSESSMENT OF CLIMATE TIPPING POINTS INDICATES THE NEED FOR STRICT CLIMATEPOLICY,\" NATURE CLIMATE CHANGE, VOL. 5, PP. 441–444, 2015.","[14] M. SCHEFFER ET AL., \"EARLY-WARNING SIGNALS FOR CRITICAL TRANSITIONS,\" NATURE,VOL. 461, PP. 53–59, 2009.","[15] D. J. WATTS, \"A SIMPLE MODEL OF GLOBAL CASCADES ON RANDOM NETWORKS,\"PROC. NAT. ACAD. SCI., VOL. 99, PP. 5766–5771, 2002.","[16] P. CRUCITTI, V. LATORA, AND M. MARCHIORI, \"MODEL FOR CASCADING FAILURES INCOMPLEX NETWORKS,\" PHYS. REV. E, VOL. 69, 2004, ART. NO. 045104.","[17] D. S. SCHARFSTEIN AND J. C. STEIN, \"HERD BEHAVIOR AND INVESTMENT,\" AMER.ECON. REV., VOL. 80, PP. 465–479, 1990.","[18] E. SAMANIDOU, E. ZSCHISCHANG, D. STAUFFER, AND T. LUX, \"AGENT-BASEDMODELS OF FINANCIAL MARKETS,\" REP. PROGRESS PHYS., VOL. 70, PP. 409–450,2007.","[19] D. SORNETTE, WHY STOCK MARKETS CRASH: CRITICAL EVENTS IN COMPLEXFINANCIAL SYSTEMS. PRINCETON, NJ, USA: PRINCETON UNIV. PRESS, 2009.","[20] T. LUX, \"HERD BEHAVIOUR, BUBBLES AND CRASHES,\" ECON. J., VOL. 105,PP. 881–96, 1995.","[21] T. LUX AND M. MARCHESI, \"SCALING AND CRITICALITY IN A STOCHASTIC MULTI-AGENTMODEL OF A FINANCIAL MARKET,\" NATURE, VOL. 397, PP. 498–500, 1999.","[22] T. LUX AND M. MARCHESI, \"VOLATILITY CLUSTERING IN FINANCIAL MARKETS: AMICROSIMULATION OF INTERACTING AGENTS,\" INT. J. THEOR. APPL. FINANCE, VOL. 3,PP. 675–702, 2000.","[23] R. CONT AND J. P. BOUCHAUD, \"HERD BEHAVIOR AND AGGREGATE FLUCTUATIONS INFINANCIAL MARKETS,\" MACROECON. DYN., VOL. 4, PP. 170–196, 2000.","[24] D. SORNETTE, \"CRITICAL MARKET CRASHES,\" PHYS. REP., VOL. 378, PP. 1–98,2003.","[25] D. ABREU AND M. K. BRUNNERMEIER, \"BUBBLES AND CRASHES,\" ECONOMETRICA,VOL. 71, PP. 173–204, 2003.","[26] W. YAN, R. WOODARD, AND D. SORNETTE, \"DIAGNOSIS AND PREDICTION OF TIPPINGPOINTS IN FINANCIAL MARKETS: CRASHES AND REBOUNDS,\" PHYS. PROCEDIA, VOL. 3,PP. 1641–1657, 2010.","[27] A. MAJDANDZIC, B. PODOBNIK, S. V. BULDYREV, D. Y. KENETT, S. HAVLIN,AND H. EUGENE STANLEY, \"SPONTANEOUS RECOVERY IN DYNAMICAL NETWORKS,\"NATURE PHYS., VOL. 10, PP. 34–38, 2013.","[28] B. PODOBNIK, T. LIPIC, D. HORVATIC, A. MAJDANDZIC, S. R. BISHOP,AND H. E. STANLEY, \"PREDICTING THE LIFETIME OF DYNAMIC NETWORKSEXPERIENCING PERSISTENT RANDOM ATTACKS,\" SCI. REP., VOL. 5, 2015,ART. NO. 14286.","[29] L. FENG, B. LI, B. PODOBNIK, T. PREIS, AND H. E. STANLEY, \"LINKING AGENT-BASED MODELS AND STOCHASTIC MODELS OF FINANCIAL MARKETS,\" PROC. NAT.ACAD. SCI. UNITED STATES AMER., VOL. 109, PP. 8388–8393, 2012.","[30] A. JOHANSEN, \"CHARACTERIZATION OF LARGE PRICE VARIATIONS IN FINANCIAL MAR-KETS,\" PHYS. A: STAT. MECH. APPL., VOL. 324, PP. 157–166, 2003.","[31] D. SORNETTE, \"DRAGON-KINGS, BLACK SWANS, AND THE PREDICTION OF CRISES,\"INT. J. TERRASPACE SCI. ENG., VOL. 2, PP. 1–18, 2009.","[32] H. ZHANG, T. LEUNG, AND O. HADJILIADIS, \"STOCHASTIC MODELING AND FAIRVALUATION OF DRAWDOWN INSURANCE,\" INSURANCE: MATH. ECON., VOL. 53,PP. 840–850, 2013.","[33] D. JOHNSTON AND P. DJURIĆ, \"THE SCIENCE BEHIND RISK MANAGEMENT,\" IEEESIGNAL PROCESS. MAG., VOL. 28, NO. 5, PP. 26–36, SEP. 2011.","[34] F. SCHWEITZER, G. FAGIOLO, D. SORNETTE, F. VEGA-REDONDO, A. VESPIGNANI,AND D. R. WHITE, \"ECONOMIC NETWORKS: THE NEW CHALLENGES,\" SCIENCE,VOL. 325, PP. 422–425, 2009.","[35] J. F. NASH, \"THE BARGAINING PROBLEM,\" ECONOMETRICA, VOL. 18, PP. 155–162,1950.","[36] A. RUBINSTEIN, \"PERFECT EQUILIBRIUM IN A BARGAINING MODEL,\" ECONOMETRICA,VOL. 50, PP. 97–109, 1982.","[37] D. GALE, \"BARGAINING AND COMPETITION PART I: CHARACTERIZATION,\" ECONO-METRICA, VOL. 54, 1986, ART. NO. 785.[38] D. GALE, \"LIMIT THEOREMS FOR MARKETS WITH SEQUENTIAL BARGAINING,\" J. ECON.THEORY, VOL. 43, PP. 20–54, 1987.","[38] D. GALE, \"LIMIT THEOREMS FOR MARKETS WITH SEQUENTIAL BARGAINING,\" J. ECON.THEORY, VOL. 43, PP. 20–54, 1987.","[39] M. MANEA, \"BARGAINING IN STATIONARY NETWORKS,\" AMER. ECON. REV.,VOL. 101, PP. 2042–2080, 2011.","[40] S. A. WEST, I. PEN, AND A. S. GRIFFIN, \"COOPERATION AND COMPETITIONBETWEEN RELATIVES,\" SCIENCE, VOL. 296, PP. 72–75, 2002.","[41] J. AGUIRRE, D. PAPO, AND J. M. BULDÚ, \"SUCCESSFUL STRATEGIES FOR COMPETINGNETWORKS,\" NATURE PHYS., VOL. 9, PP. 230–234, 2013.","[42] S. A. LEVIN, \"PUBLIC GOODS IN RELATION TO COMPETITION, COOPERATION,AND SPITE,\" PROC. NAT. ACAD. SCI. UNITED STATES AMER., VOL. 111,PP. 10 838–10 845, 2014.","[43] K. BINMORE, A. RUBINSTEIN, AND A. WOLINSKY, \"THE NASH BARGAININGSOLUTION IN ECONOMIC MODELLING,\" RAND J. ECON., VOL. 17, PP. 176–188,1986.","[44] R. J. SHILLER, IRRATIONAL EXUBERANCE. PRINCETON, NJ, USA: PRINCETON UNIV.PRESS, 2000.","[45] F. ALLEN, S. MORRIS, AND A. POSTLEWAITE, \"FINITE BUBBLES WITH SHORTSALE CONSTRAINTS AND ASYMMETRIC INFORMATION,\" J. ECON. THEORY, VOL. 61,PP. 206–229, 1993.","[46] J. B. DE LONG, A. SHLEIFER, L. H. SUMMERS, AND R. J. WALDMANN,\"NOISE TRADER RISK IN FINANCIAL MARKETS,\" J. POLITICAL ECONOMY, VOL. 98,PP. 703–738, 1990.","[47] H. L. VOGEL, FINANCIAL MARKET BUBBLES AND CRASHES. CAMBRIDGE, U.K.:CAMBRIDGE UNIV. PRESS, 2009.","[48] J. S. ROSENSCHEIN AND G. ZLOTKIN, RULES OF ENCOUNTER: DESIGNING CON-VENTIONS FOR AUTOMATED NEGOTIATION AMONG COMPUTERS. CAMBRIDGE, MA,USA: MIT PRESS, 1994.","[49] J. VON NEUMANN AND O. MORGENSTERN, THEORY OF GAMES AND ECONOMICBEHAVIOR. PRINCETON, NJ, USA: PRINCETON UNIV. PRESS, 1944.","[50] M. ELLIOTT, B. GOLUB, AND M. O. JACKSON, \"FINANCIAL NETWORKS AND CONTA-GION,\" AMER. ECON. REV., VOL. 104, PP. 3115–3153, 2014.","[51] S. MASLOV, \"SIMPLE MODEL OF A LIMIT ORDER-DRIVEN MARKET,\" PHYS. A: STAT.MECH. APPL., VOL. 278, PP. 571–578, 2000.","[52] J. SCHEINKMAN AND W. XIONG, \"OVERCONFIDENCE AND SPECULATIVE BUBBLES,\"J. POLITICAL ECONOMY, VOL. 111, PP. 1183–1220, 2003.","[53] W. C. BRAINARD AND J. TOBIN, \"PITFALLS IN FINANCIAL MODEL-BUILDING,\" COWLESFOUNDATION DISCUSSION PAPERS, 1968.","[54] O. BLANCHARD, C. RHEE, AND L. SUMMERS, \" THE STOCK MARKET, PROFIT, ANDINVESTMENT,\" QUART. J. ECON., VOL. 108, PP. 115–136, 1993.","[55] M. J. GORDON, \"DIVIDENDS, EARNINGS, AND STOCK PRICES,\" REV. ECON. STATIST.,VOL. 41, PP. 99–105, 1959.","[56] Z. BODIE, A. KANE, AND A. J. MARCUS, ESSENTIALS OF INVESTMENTS. NEW YORK,NY, USA: MCGRAW HILL, 2003.","[57] J. Y. CAMPBELL AND R. J. SHILLER, \"STOCK PRICES, EARNINGS, AND EXPECTEDDIVIDENDS,\" J. FINANCE, VOL. 43, PP. 661–676, 1988.","[58] R. J. SHILLER, [ONLINE]. AVAILABLE: HTTP://WWW.ECON.YALE.EDU/SHILLER/DATA.HTM.[59] D. J. WATTS AND S. H. STROGATZ, \"COLLECTIVE DYNAMICS OF 'SMALL-WORLD'NETWORKS,\" NATURE, VOL. 393, PP. 440–442, 1998.","[59] D. J. WATTS AND S. H. STROGATZ, \"COLLECTIVE DYNAMICS OF 'SMALL-WORLD'NETWORKS,\" NATURE, VOL. 393, PP. 440–442, 1998.","[60] T. KOLLER, M. GOEDHART, AND D. WESSELS, VALUATION: MEASURING AND MAN-AGING THE VALUE OF COMPANIES. HOBOKEN, NJ, USA: WILEY, 2005.","[61] F. DING, N. V. DOKHOLYAN, S. V. BULDYREV, H. E. STANLEY, AND E. I.SHAKHNOVICH, \"DIRECT MOLECULAR DYNAMICS OBSERVATION OF PROTEIN FOLD-ING TRANSITION STATE ENSEMBLE,\" BIOPHYS. J., VOL. 83, PP. 3525–3532, 2002.","[62] J. Y. CAMPBELL AND R. J. SHILLER, \"COINTEGRATION AND TESTS OF PRESENT VALUEMODELS,\" J. POLITICAL ECONOMY, VOL. 95, PP. 1062–1088, 1987.","[63] R. F. ENGLE AND C. W. J. GRANGER, \"CO-INTEGRATION AND ERROR CORREC-TION: REPRESENTATION, ESTIMATION, AND TESTING,\" ECONOMETRICA, VOL. 55,PP. 251–276, 1987.","[64] J. D. HAMILTON, TIME SERIES ANALYSIS. PRINCETON, NJ, USA: PRINCETON UNIV.PRESS, 1994.","[65] S.-J. KIM, K. KOH, S. BOYD, AND D. GORINEVSKY, \"L1 TREND FILTERING,\" SIAMREV., VOL. 51, PP. 339–360, 2009.","[66] S.-J. KIM, K. KOH, M. LUSTIG, S. BOYD, AND D. GORINEVSKY, \"AN INTERIOR-POINT METHOD FOR LARGE-SCALE 1 -REGULARIZED LEAST SQUARES,\" IEEE J. SEL.TOPICS SIGNAL PROCESS., VOL. 1, NO. 4, PP. 606–617, DEC. 2007.","[67] E. F. FAMA AND K. R. FRENCH, \"THE CROSS-SECTION OF EXPECTED STOCK RETURNS,\"J. FINANCE, VOL. 47, PP. 427–465, 1992.","[68] P. BALDUZZI, \"TRANSACTION COSTS AND PREDICTABILITY: SOME UTILITY COSTCALCULATIONS,\" J. FINANCIAL ECON., VOL. 52, PP. 47–78, 1999."],"terms":["MARKET","PRICE","MODEL","INTRINSIC","NETWORK","VALUE","TIPPING","WHICH","AGENTS","PRICES"]},{"article":"29.pdf","title":"DETECTING WASH TRADE IN FINANCIAL MARKET USING DIGRAPHS AND DYNAMIC PROGRAMMING ","authors":["THOMAS MARTIN MCGINNITY"],"institutions":[],"abstract":"ABSTRACT—A WASH TRADE REFERS TO THE ILLEGAL ACTIVITIES OFTRADERS WHO UTILIZE CAREFULLY DESIGNED LIMIT ORDERS TO MANUALLYINCREASE THE TRADING VOLUMES FOR CREATING A FALSE IMPRESSION OFAN ACTIVE MARKET. AS ONE OF THE PRIMARY FORMATS OF MARKETABUSE, A WASH TRADE CAN BE EXTREMELY DAMAGING TO THE PROPERFUNCTIONING AND INTEGRITY OF CAPITAL MARKETS. THE EXISTINGWORK FOCUSES ON COLLUSIVE CLIQUE DETECTIONS BASED ON CERTAINASSUMPTIONS OF TRADING BEHAVIORS. EFFECTIVE APPROACHES FORANALYZING AND DETECTING WASH TRADE IN A REAL-LIFE MARKET HAVEYET TO BE DEVELOPED. THIS PAPER ANALYZES AND CONCEPTUALIZES THEBASIC STRUCTURES OF THE TRADING COLLUSION IN A WASH TRADE BY USINGA DIRECTED GRAPH OF TRADERS. A NOVEL METHOD IS THEN PROPOSED TODETECT THE POTENTIAL WASH TRADE ACTIVITIES INVOLVED IN A FINANCIALINSTRUMENT BY FIRST RECOGNIZING THE SUSPICIOUSLY MATCHED ORDERSAND THEN FURTHER IDENTIFYING THE COLLUSIONS AMONG THE TRADERSWHO SUBMIT SUCH ORDERS. BOTH STEPS ARE FORMULATED AS ASIMPLIFIED FORM OF THE KNAPSACK PROBLEM, WHICH CAN BE SOLVEDBY DYNAMIC PROGRAMMING APPROACHES. THE PROPOSED APPROACHIS EVALUATED ON SEVEN STOCK DATA SETS FROM THE NASDAQ AND THELONDON STOCK EXCHANGE. THE EXPERIMENTAL RESULTS SHOW THATTHE PROPOSED APPROACH CAN EFFECTIVELY DETECT ALL PRIMARY WASHTRADE SCENARIOS ACROSS THE SELECTED DATA SETS.","objective":[],"problem":"","methodology":["III"],"contributes":"","references":["[1] F. ALLEN AND D. GALE, \"STOCK-PRICE MANIPULATION,\" REV. FINANCIAL STUD.,VOL. 5, NO. 3, PP. 503–529, JUL. 1992.","[2] Y. CAO, Y. LI, S. COLEMAN, A. BELATRECHE, AND T. M. MCGINNITY, \"ADAP-TIVE HIDDEN MARKOV MODEL WITH ANOMALY STATES FOR PRICE MANIPULATIONDETECTION,\" IEEE TRANS. NEURAL NETW. LEARN. SYST., VOL. 26, NO. 2,PP. 318–330, FEB. 2015.","[3] Y. CAO, Y. LI, S. COLEMAN, A. BELATRECHE, AND T. M. MCGINNITY,\"A HIDDEN MARKOV MODEL WITH ABNORMAL STATES FOR DETECTING STOCK PRICEMANIPULATION,\" IN PROC. IEEE INT. CONF. SYST., MAN, CYBERN. (SMC),MANCHESTER, U.K., OCT. 2013, PP. 3014–3019.","[4] Y. CAO, Y. LI, S. COLEMAN, A. BELATRECHE, AND T. M. MCGINNITY,\"DETECTING PRICE MANIPULATION IN THE FINANCIAL MARKET,\" IN PROC. IEEECONF. COMPUT. INTELL. FINANCIAL ENG. ECON. (CIFER), LONDON, U.K.,MAR. 2014, PP. 77–84.[5] Y. CAO, Y. LI, S. COLEMAN, A. BELATRECHE, AND T. M. MCGINNITY,\"DETECTING WASH TRADE IN THE FINANCIAL MARKET,\" IN PROC. IEEE CONF.COMPUT. INTELL. FINANCIAL ENG. ECON. (CIFER), LONDON, U.K., MAR. 2014,","[5] Y. CAO, Y. LI, S. COLEMAN, A. BELATRECHE, AND T. M. MCGINNITY,\"DETECTING WASH TRADE IN THE FINANCIAL MARKET,\" IN PROC. IEEE CONF.COMPUT. INTELL. FINANCIAL ENG. ECON. (CIFER), LONDON, U.K., MAR. 2014,PP. 85–91.[6] J. ZHAI AND Y. CAO, \"ON THE CALIBRATION OF STOCHASTIC VOLATILITY MODELS:A COMPARISON STUDY,\" IN PROC. IEEE CONF. COMPUT. INTELL. FINANCIALENG. ECON. (CIFER), LONDON, U.K., MAR. 2014, PP. 303–309.","[6] J. ZHAI AND Y. CAO, \"ON THE CALIBRATION OF STOCHASTIC VOLATILITY MODELS:A COMPARISON STUDY,\" IN PROC. IEEE CONF. COMPUT. INTELL. FINANCIALENG. ECON. (CIFER), LONDON, U.K., MAR. 2014, PP. 303–309.[7] F. ALLEN, L. LITOV, AND J. MEI, \"LARGE INVESTORS, PRICE MANIPULATION,AND LIMITS TO ARBITRAGE: AN ANATOMY OF MARKET CORNERS,\" REV. FINANCE,VOL. 10, NO. 4, PP. 645–693, OCT. 2006.","[7] F. ALLEN, L. LITOV, AND J. MEI, \"LARGE INVESTORS, PRICE MANIPULATION,AND LIMITS TO ARBITRAGE: AN ANATOMY OF MARKET CORNERS,\" REV. FINANCE,VOL. 10, NO. 4, PP. 645–693, OCT. 2006.","[8] D. CUMMING, F. ZHAN, AND M. J. AITKEN. (SEP. 2012). HIGH FRE-QUENCY TRADING AND END-OF-DAY PRICE DISLOCATION. [ONLINE]. AVAILABLE:HTTP://DX.DOI.ORG/10.2139/SSRN.2145565[9] SEC. (OCT. 2011). LIMIT ORDERS. [ONLINE]. AVAILABLE:HTTP://WWW.SEC.GOV/ANSWERS/LIMIT.HTM[10] K. MENYAH AND K. PAUDYAL, \"THE COMPONENTS OF BID–ASK SPREADS ONTHE LONDON STOCK EXCHANGE,\" J. BANKING FINANCE, VOL. 24, NO. 11,","[9] SEC. (OCT. 2011). LIMIT ORDERS. [ONLINE]. AVAILABLE:HTTP://WWW.SEC.GOV/ANSWERS/LIMIT.HTM[10] K. MENYAH AND K. PAUDYAL, \"THE COMPONENTS OF BID–ASK SPREADS ONTHE LONDON STOCK EXCHANGE,\" J. BANKING FINANCE, VOL. 24, NO. 11,PP. 1767–1785, NOV. 2000.","[10] K. MENYAH AND K. PAUDYAL, \"THE COMPONENTS OF BID–ASK SPREADS ONTHE LONDON STOCK EXCHANGE,\" J. BANKING FINANCE, VOL. 24, NO. 11,PP. 1767–1785, NOV. 2000.","[11] FSA. (MAR. 2006). THE CODE OF MARKET CONDUCT. [ONLINE]. AVAILABLE:HTTP://WWW.FSA.GOV.UK/PUBS/HB-RELEASES/REL52/REL52MAR.PDF[12] EU. (JUN. 2014). EUROPEAN COMMISSION. [ONLINE]. AVAILABLE: HTTP://EC.EUROPA.EU/FINANCE/SECURITIES/ABUSE/INDEX_EN.HTM[13] CME. (AUG. 2014). U.S. COMMODITY FUTURES TRADINGCOMMISSION. [ONLINE]. AVAILABLE: HTTP://WWW.CFTC.GOV/FILINGS/ORGRULES/RULE082814CMEDCM001.PDF","[12] EU. (JUN. 2014). EUROPEAN COMMISSION. [ONLINE]. AVAILABLE: HTTP://EC.EUROPA.EU/FINANCE/SECURITIES/ABUSE/INDEX_EN.HTM[13] CME. (AUG. 2014). U.S. COMMODITY FUTURES TRADINGCOMMISSION. [ONLINE]. AVAILABLE: HTTP://WWW.CFTC.GOV/FILINGS/ORGRULES/RULE082814CMEDCM001.PDF[14] CME GROUP. (JUL. 2013). MARKET REGULATION ADVISORY NOTICE: WASHTRADES PROHIBITED—RULE 534. [ONLINE]. AVAILABLE: HTTP://WWW.","[13] CME. (AUG. 2014). U.S. COMMODITY FUTURES TRADINGCOMMISSION. [ONLINE]. AVAILABLE: HTTP://WWW.CFTC.GOV/FILINGS/ORGRULES/RULE082814CMEDCM001.PDF[14] CME GROUP. (JUL. 2013). MARKET REGULATION ADVISORY NOTICE: WASHTRADES PROHIBITED—RULE 534. [ONLINE]. AVAILABLE: HTTP://WWW.CFTC.GOV/STELLENT/GROUPS/PUBLIC/@RULESANDPRODUCTS/DOCUMENTS/IFDOCS/RUL070913CMECBOTNYMEXCOMANDKC1.PDF","[14] CME GROUP. (JUL. 2013). MARKET REGULATION ADVISORY NOTICE: WASHTRADES PROHIBITED—RULE 534. [ONLINE]. AVAILABLE: HTTP://WWW.CFTC.GOV/STELLENT/GROUPS/PUBLIC/@RULESANDPRODUCTS/DOCUMENTS/IFDOCS/RUL070913CMECBOTNYMEXCOMANDKC1.PDF[15] M. FRANKE, B. HOSER, AND J. SCHRÖDER, \"ON THE ANALYSIS OF IRREGULARSTOCK MARKET TRADING BEHAVIOR,\" IN PROC. DATA ANAL., MACH. LEARN. APPL.,FREIBURG IM BREISGAU, GERMANY, 2007, PP. 355–362.","[15] M. FRANKE, B. HOSER, AND J. SCHRÖDER, \"ON THE ANALYSIS OF IRREGULARSTOCK MARKET TRADING BEHAVIOR,\" IN PROC. DATA ANAL., MACH. LEARN. APPL.,FREIBURG IM BREISGAU, GERMANY, 2007, PP. 355–362.[16] G. K. PALSHIKAR AND M. M. APTE, \"COLLUSION SET DETECTION USING GRAPHCLUSTERING,\" DATA MINING KNOWL. DISCOVERY, VOL. 16, NO. 2, PP. 135–164,APR. 2008.","[16] G. K. PALSHIKAR AND M. M. APTE, \"COLLUSION SET DETECTION USING GRAPHCLUSTERING,\" DATA MINING KNOWL. DISCOVERY, VOL. 16, NO. 2, PP. 135–164,APR. 2008.","[17] J. WANG, S. ZHOU, AND J. GUAN, \"DETECTING POTENTIAL COLLUSIVE CLIQUESIN FUTURES MARKETS BASED ON TRADING BEHAVIORS FROM REAL DATA,\"NEUROCOMPUTING, VOL. 92, PP. 44–53, SEP. 2012.","[18] N. HAUTSCH AND R. HUANG, \"THE MARKET IMPACT OF A LIMIT ORDER,\" J. ECON.DYN. CONTROL, VOL. 36, NO. 4, PP. 501–522, APR. 2012.","[19] ITG. (JUL. 2013). GLOBAL COST REVIEW Q1/2013. [ONLINE].AVAILABLE: HTTP://WWW.ITG.COM/MARKETING/ITG_GLOBALCOSTREVIEW_Q12013_20130725.","[20] S. PATTERSON, J. STRASBURG, AND J. TRINDLE. (MAR. 2013). THEWALL STREET JOURNAL. [ONLINE]. AVAILABLE: HTTP://ONLINE.WSJ.COM/ARTICLE/SB10001424127887323639604578366491497070204.","[21] N. JAMAL. (DEC. 2012). LSE BROKER FINED FOR 'WASH TRADE'.[ONLINE]. AVAILABLE: HTTP://DAWN.COM/NEWS/771335/LSE-BROKER-FINED-FOR-WASH-TRADE[22] T. LOH AND G. CUMMING. (JUN. 2012). MARKET MANIPULATION: SAFE HAR-BOUR FOR WASH TRADES AND MATCHED ORDERS UPHELD. [ONLINE]. AVAILABLE:HTTP://WWW.TIMOTHYLOH.COM/PUBLICATIONS/120606_MARKET_MANIPULATION_CFA.HTML","[22] T. LOH AND G. CUMMING. (JUN. 2012). MARKET MANIPULATION: SAFE HAR-BOUR FOR WASH TRADES AND MATCHED ORDERS UPHELD. [ONLINE]. AVAILABLE:HTTP://WWW.TIMOTHYLOH.COM/PUBLICATIONS/120606_MARKET_MANIPULATION_CFA.HTML[23] EU. (2015). EUROPEAN COMMISSION. [ONLINE]. AVAILABLE:HTTP://EC.EUROPA.EU/FINANCE/SECURITIES/PROSPECTUS/INDEX_EN.HTM[24] E. TSANG, R. OLSEN, AND S. MASRY, \"A FORMALIZATION OF DOUBLE AUC-","[23] EU. (2015). EUROPEAN COMMISSION. [ONLINE]. AVAILABLE:HTTP://EC.EUROPA.EU/FINANCE/SECURITIES/PROSPECTUS/INDEX_EN.HTM[24] E. TSANG, R. OLSEN, AND S. MASRY, \"A FORMALIZATION OF DOUBLE AUC-TION MARKET DYNAMICS,\" QUANT. FINANCE, VOL. 13, NO. 7, PP. 981–988,JUL. 2013.","[24] E. TSANG, R. OLSEN, AND S. MASRY, \"A FORMALIZATION OF DOUBLE AUC-TION MARKET DYNAMICS,\" QUANT. FINANCE, VOL. 13, NO. 7, PP. 981–988,JUL. 2013.","[25] NANEX. (MAY 2013). CHICAGO PMI. [ONLINE]. AVAILABLE:HTTP://WWW.NANEX.NET/AQCK2/4304.","[26] M. J. AITKEN, F. H. HARRIS, AND S. JI, \"TRADE-BASED MANIPULATION ANDMARKET EFFICIENCY: A CROSS-MARKET COMPARISON,\" IN PROC. 22ND AUSTRAL.FINANCE BANKING CONF., SYDNEY, NSW, AUSTRALIA, NOV. 2009, P. 18.[27] R. ANDONOV, V. POIRRIEZ, AND S. RAJOPADHYE, \"UNBOUNDED KNAPSACKPROBLEM: DYNAMIC PROGRAMMING REVISITED,\" EUR. J. OPER. RES., VOL. 123,NO. 2, PP. 394–407, JUN. 2000.","[27] R. ANDONOV, V. POIRRIEZ, AND S. RAJOPADHYE, \"UNBOUNDED KNAPSACKPROBLEM: DYNAMIC PROGRAMMING REVISITED,\" EUR. J. OPER. RES., VOL. 123,NO. 2, PP. 394–407, JUN. 2000.","[28] V. POIRRIEZ, N. YANEV, AND R. ANDONOV, \"A HYBRID ALGORITHM FORTHE UNBOUNDED KNAPSACK PROBLEM,\" DISCRETE OPTIM., VOL. 6, NO. 1,PP. 110–124, FEB. 2009.","[29] M. ZUKERMAN, L. JIA, T. NEAME, AND G. J. WOEGINGER, \"A POLYNOMIALLYSOLVABLE SPECIAL CASE OF THE UNBOUNDED KNAPSACK PROBLEM,\" OPER. RES.LETT., VOL. 29, NO. 1, PP. 13–16, AUG. 2001.","[30] J. KLEINBERG AND É. TARDOS, ALGORITHM DESIGN, 1ST ED. LONDON, U.K.:PEARSON, 2005.","[31] Z. NI, H. HE, J. WEN, AND X. XU, \"GOAL REPRESENTATION HEURISTIC DYNAMICPROGRAMMING ON MAZE NAVIGATION,\" IEEE TRANS. NEURAL NETW. LEARN.SYST., VOL. 24, NO. 12, PP. 2038–2050, DEC. 2013.","[32] Y. JIANG AND Z.-P. JIANG, \"ROBUST ADAPTIVE DYNAMIC PROGRAMMING ANDFEEDBACK STABILIZATION OF NONLINEAR SYSTEMS,\" IEEE TRANS. NEURAL NETW.LEARN. SYST., VOL. 25, NO. 5, PP. 882–893, MAY 2014.","[33] NANEX. (JUL. 2013). EXPLORATORY TRADING IN THE EMINI. [ONLINE].AVAILABLE: HTTP://WWW.NANEX.NET/AQCK2/4136.","[34] Y. OU, L. CAO, C. LUO, AND C. ZHANG, \"DOMAIN-DRIVEN LOCALEXCEPTIONAL PATTERN MINING FOR DETECTING STOCK PRICE MANIPULATION,\"IN PROC. PRICAI, TRENDS ARTIF. INTELL., HANOI, VIETNAM, DEC. 2008,PP. 849–858.[35] E. J. LEE, K.-S. EOM, AND K. S. PARK, \"MICROSTRUCTURE-BASED MANIP-ULATION: STRATEGIC BEHAVIOR AND PERFORMANCE OF SPOOFING TRADERS,\"","[35] E. J. LEE, K.-S. EOM, AND K. S. PARK, \"MICROSTRUCTURE-BASED MANIP-ULATION: STRATEGIC BEHAVIOR AND PERFORMANCE OF SPOOFING TRADERS,\"J. FINANCIAL MARKETS, VOL. 16, NO. 2, PP. 227–252, MAY 2013.","[36] N. HAUTSCH AND R. HUANG. (AUG. 2011). LIMIT ORDER FLOW, MARKETIMPACT AND OPTIMAL ORDER SIZES: EVIDENCE FROM NASDAQ TOTALVIEW-ITCH DATA. [ONLINE]. AVAILABLE: HTTP://DX.DOI.ORG/10.2139/SSRN.1914293[37] L. CAO, Y. OU, AND P. S. YU, \"COUPLED BEHAVIOR ANALYSIS WITH APPLICA-TIONS,\" IEEE TRANS. KNOWL. DATA ENG., VOL. 24, NO. 8, PP. 1378–1392,AUG. 2012.","[37] L. CAO, Y. OU, AND P. S. YU, \"COUPLED BEHAVIOR ANALYSIS WITH APPLICA-TIONS,\" IEEE TRANS. KNOWL. DATA ENG., VOL. 24, NO. 8, PP. 1378–1392,AUG. 2012."],"terms":["TRADE","ORDERS","ORDER","MATCHED","TRADING","TABLE","DETECTION","TRADERS","PRICE","VOLUME"]},{"article":"19.pdf","title":"FINANCIAL STRESS THROUGH COMPLEXITY SCIENCE ","authors":["LISA AUFEGGER"," ANTHONY G. CONSTANTINIDES"," LIFE FELLOW"," DANILO P. MANDIC"," FELLOW"],"institutions":[],"abstract":"ABSTRACT—FINANCIAL MARKETS TYPICALLY UNDERGO PERIODS OF PROS-PERITY FOLLOWED BY PERIODS OF STAGNATION, AND THIS UNDULATION MAKESIT CHALLENGING TO MAINTAIN MARKET EFFICIENCY. THE EFFICIENT MARKETHYPOTHESIS (EMH) STATES THAT THERE EXIST DIFFERENCES IN STRUCTURALCOMPLEXITY IN SECURITY PRICES BETWEEN REGULAR AND ABNORMAL SIT-UATIONS. YET, DESPITE A CLEAR LINK BETWEEN MARKET ACCELERATION (CF.RECESSION IN SECURITY PRICES) AND STRESS IN PHYSICAL SYSTEMS, INDICESOF FINANCIAL STRESS STILL HAVE SIGNIFICANT SCOPE FOR FURTHER DEVELOP-MENT. THE OVERARCHING AIM OF THIS WORK IS THEREFORE TO DETERMINETHE CHARACTERISTICS OF FINANCIAL INDICES RELATED TO FINANCIAL STRESS,AND TO ESTABLISH A ROBUST METRIC FOR THE EXTENT OF SUCH 'STRESS'. THISIS ACHIEVED BASED ON INTRINSIC MULTISCALE ANALYSIS WHICH QUANTI-FIES THE SO CALLED COMPLEXITY-LOSS HYPOTHESIS IN THE CONTEXT OF FI-NANCIAL STRESS. THE MULTISCALE SAMPLE ENTROPY AND OUR PROPOSEDASSESSMENT OF LATENT INDEX OF STRESS METHODS HAVE SUCCESSFULLYASSESSED FINANCIAL STRESS, AND HAVE SERVED AS A MEASURE TO ESTABLISHAN ANALOGY BETWEEN TRANSITIONS FROM 'NORMAL' (RELAXED) TO 'ABNOR-MAL' (STRESSED) FINANCIAL PERIODS WITH THE SYMPATHO-VAGAL BALANCEIN HUMANS. FOUR MAJOR STOCK INDICES OF THE US ECONOMY OVER THEPAST 25 YEARS ARE CONSIDERED: (I) DOW JONES INDUSTRIAL AVERAGE, (II)NASDAQ COMPOSITE, (III) STANDARD & POOR'S 500, AND (IV) RUS-SELL 2000, TOGETHER WITH FTSE 100, CAC 40 AND EXCHANGE RATES.OUR FINDINGS SUPPORT THE EMH THEORY AND REVEAL HIGH STRESS FORBOTH THE PERIODS OF INTERNET BUBBLE BURST AND SUB-PRIME MORTGAGECRISIS.","objective":["PURPOSE OF THIS STUDY IS THEREFORE TO QUANTIFY THESE TIME-VARYINGCHARACTERISTICS IN ORDER TO SIMULTANEOUSLY CHARACTERISE, IN A FULLMULTIVARIATE WAY, THE FINANCIAL STRESS THROUGH THE COMPLEXITY-LOSS HYPOTHESIS (SYSTEMS UNDER STRESS EXHIBIT GREATER REGULARITYAND LESS FREEDOM"],"problem":"","methodology":["WE APPLIED OUR METHODOLOGY TO FOUR STOCK MARKET INDICESWHICH REPRESENT THE US ECONOMY OVER THE LAST 25 YEARS, BE-TWEEN 1ST JANUARY 1991 AND 31ST AUGUST 2015"],"contributes":"","references":["[1] W. ER AND D. P. MANDIC, \"DYNAMICAL COMPLEXITY ANALYSIS OF MULTIVARIATEFINANCIAL DATA,\" IN PROC. IEEE INT. CONF. ACOUST., SPEECH, SIGNAL PROCESS.,2013, PP. 8732–8736.","[2] N. AMENC, F. GOLTZ, AND V. LE SOURD, ASSESSING THE QUALITY OF STOCK MAR-KET INDICES. NICE, FRANCE, EDHEC RISK & ASSET MANAGEMENT RESEARCHCENTRE PUBLICATION, 2007.","[3] G. FONTANILLS AND T. GENTILE, START MARKET COURSE. HOBOKEN, NJ, USA:WILEY, 2001.","[4] H. S. DENT JR., THE NEXT GREAT BUBBLE BOOM: HOW TO PROFIT FROM THEGREATEST BOOM IN HISTORY: 2006–2010.","[5] R. STUTELEY, NUMBERS GUIDE: THE ESSENTIALS OF BUSINESS NUMERACY, 5THED. HOBOKEN, NJ, USA: WILEY, 2003.","[6] R. D. EDWARDS, J. MAGEE, AND W. BASSETTI, TECHNICAL ANALYSIS OF STOCKTRENDS, 9TH ED. BOCA RATON, FL, USA: CRC, 2007.","[7] E. F. FAMA, \"EFFICIENT CAPITAL MARKETS: A REVIEW OF THEORY AND EMPIRICALWORK,\" J. FINANCE, VOL. 25, NO. 2, PP. 383–417, 1970.","[8] M. MALIK, \"HEART RATE VARIABILITY: STANDARDS OF MEASUREMENT, PHYSIO-LOGICAL INTERPRETATION, AND CLINICAL USE,\" EUR. HEART J., VOL. 17, NO. 3,PP. 354–381, 1996.","[9] H. SELYE, \"STRESS AND THE GENERAL ADAPTATION SYNDROME,\" BRIT. MED. J.,VOL. 1, NO. 4667, PP. 1383–1392, 1950.","[10] P. LEQUEUX AND M. MENON, \"AN EIGENVALUE APPROACH TO RISK REGIMES INCURRENCY MARKETS,\" J. DERIVATIVES HEDGE FUNDS, VOL. 16, NO. 2, PP. 123–135, 2009.","[11] M. U. AHMED AND D. P. MANDIC, \"MULTIVARIATE MULTISCALE ENTROPY: ATOOL FOR COMPLEXITY ANALYSIS OF MULTICHANNEL DATA,\" PHYS. REV. E, VOL. 84,NO. 6, PP. 061918–1–061918–10, 2011.","[12] P. M. ADDO, M. BILLIO, AND D. GUÉGAN, \"UNDERSTANDING EXCHANGE RATESDYNAMICS,\" CES WORKING PAPERS HALSHS-00803447, VER. 1, PP. 1–14, 2013.","[13] R. CARDARELLI, S. ELEKDAG, AND S. LALL, \"FINANCIAL STRESS AND ECONOMICCONTRACTIONS,\" J. FINANCIAL STABILITY, VOL. 7, NO. 2, PP. 78–97, 2011.","[14] R. BALAKRISHNAN, S. DANNINGER, S. ELEKDAG, AND I. TYTELL, \"THE TRANSMISSIONOF FINANCIAL STRESS FROM ADVANCED TO EMERGING ECONOMICS,\" IMF WORKINGPAPER WP/09/133, PP. 1–52, 2009.","[15] R. CARDARELLI, S. ELEKDAG, AND S. LALL, \"FINANCIAL STRESS, DOWNTURNS, ANDRECOVERIES,\" IMF WORKING PAPER WP/09/100, PP. 1–58, 2009.","[16] K. J. FORBES, \"ARE TRADE LINKAGES IMPORTANT DETERMINANTS OF COUNTRY VUL-NERABILITY TO CRISES?,\" NBER WORKING PAPER 8194, PP. 1–66, 2001.","[17] G. L. KAMINSKY AND C. M. REINHART, \"THE TWIN CRISES: THE CAUSES OFBANKING AND BALANCE-OF-PAYMENTS PROBLEMS,\" AMER. ECON. REV., VOL. 89,NO. 3, PP. 473–500, 1999.","[18] C. S. HAKKIO AND W. R. KEETON, \"FINANCIAL STRESS: WHAT IS IT, HOW CAN ITBE MEASURED, AND WHY DOES IT MATTER?\" FEDERAL RESERVE BANK OF KANSASCITY, NO. Q II, PP. 5–50, 2009.","[19] M. BILLIO, M. GETMANSKY, A. W. LO, AND L. PELIZZON, \"MEASURING SYSTEMICRISK IN THE FINANCE AND INSURANCE SECTORS,\" MIT SLOAN SCHOOL WORKINGPAPER 4474–10, PP. 1–66, 2010.","[20] M. KRITZMAN, Y. LI, S. PAGE, AND R. RIGOBON, \"PRINCIPAL COMPONENTS AS AMEASURE OF SYSTEMIC RISK,\" J. PORTFOLIO MANAGE., VOL. 37, NO. 4, PP. 1–16,2011.","[21] D. DUFFIE, \"A 10-BY-10-BY-10 APPROACH,\" NBER WORKING PAPER 17281,PP. 1–10, 2011.","[22] E. C. ZEEMAN, \"CATASTROPHE THEORY,\" SCIENTIFIC AMER., PP. 65–70, 75–83,1976.","[23] M. U. AHMED AND D. P. MANDIC, \"MULTIVARIATE MULTISCALE ENTROPYANALYSIS,\" IEEE SIGNAL PROCESS. LETT., VOL. 19, NO. 2, PP. 91–94, FEB.2012.","[24] J.-P. ECKMANN, S. O. KAMPHORST, AND D. RUELLE, \"RECURRENCE PLOTSOF DYNAMICAL SYSTEMS,\" EUROPHYSICS LETT., VOL. 4, NO. 9. PP. 973–977,1987.","[25] D. P. MANDIC, M. CHEN, T. GAUTAMA, M. M. VAN HULLE, ANDA. CONSTANTINIDES, \"ON THE CHARACTERIZATION OF THE DETERMINISTIC/STOCHASTICAND LINEAR/NONLINEAR NATURE OF TIME SERIES,\" IN PROC. ROY. SOC. A, 2008, VOL.464, NO. 2093, PP. 1141–1160.","[26] P. M. ADDO, M. BILLIO, AND D. GUÉGAN, \"NONLINEAR DYNAMICS AND RECUR-RENCE PLOTS FOR DETECTING FINANCIAL CRISIS,\" NORTH AMER. J. ECON. FINANCE,VOL. 26, PP. 416–435, 2013[27] D. LOONEY, A. HEMAKOM, AND D. P. MANDIC, \"INTRINSIC MULTISCALE ANALYSIS:A MULTIVARIATE EMD FRAMEWORK,\" PROC. ROY. SOC. A, VOL. 471, NO. 2173,PP. 20140709-1–20140709-28, 2015.","[27] D. LOONEY, A. HEMAKOM, AND D. P. MANDIC, \"INTRINSIC MULTISCALE ANALYSIS:A MULTIVARIATE EMD FRAMEWORK,\" PROC. ROY. SOC. A, VOL. 471, NO. 2173,PP. 20140709-1–20140709-28, 2015.","[28] A. L. GOLDBERGER, L. A. N. AMARAL, J. M. HAUSDORFF, P. CH. IVANOV, C.-K.PENG, AND H. E. STANLEY, \"FRACTAL DYNAMICS IN PHYSIOLOGY: ALTERATIONS WITHDISEASE AND AGING,\" PROC. NAT. ACAD. SCI. USA, VOL. 99, PP. 2466–2472,2002.","[29] R. HORNERO, D. ABÁSOLO, J. ESCUDERO, AND C. GÓMEZ, \"NONLINEAR ANAL-YSIS OF ELECTROENCEPHALOGRAM AND MAGNETOENCEPHALOGRAM RECORDINGS INPATIENTS WITH ALZHEIMER'S DISEASE,\" PHILOSOPHICAL TRANS. ROY. SOC. A,VOL. 367, NO. 1887, PP. 317–336, 2009.","[30] T. TAKAHASHI ET AL., \"AGE-RELATED VARIATION IN EEG COMPLEXITY TO PHOTICSTIMULATION: A MULTISCALE ENTROPY ANALYSIS,\" CLIN. NEUROPHYSIOLOGY,VOL. 120, NO. 3, PP. 476–83, 2009.","[31] J. S. RICHMAN AND J. R. MOORMAN, \"PHYSIOLOGICAL TIME-SERIES ANALYSISUSING APPROXIMATE ENTROPY AND SAMPLE ENTROPY,\" AMER. J. PHYSIOLOGY -HEART CIRCULATORY PHYSIOLOGY, VOL. 278, NO. 6, PP. H2039–H2049, 2000.","[32] M. COSTA, A. L. GOLDBERGER, AND C. K. PENG, \"MULTISCALE ENTROPY ANALYSISOF COMPLEX PHYSIOLOGIC TIME SERIES,\" PHYS. REV. LETT., VOL. 89, NO. 6,PP. 068102-1–069102-4, 2002.","[33] S.-D. WU, C.-W. WU, K.-Y. LEE, AND S.-G. LIN, \"MODIFIED MULTISCALEENTROPY FOR SHORT-TERM TIME SERIES,\" PHYSICA A, VOL. 392, NO. 2013,PP. 5865–5873, 2013.","[34] D. A. RAND AND L. S. YOUNG, \"DYNAMICAL SYSTEMS AND TURBULENCE,\" NEWYORK, NY, USA: SPRINGER-VERLAG, 1981.","[35] A. FRASER AND H. SWINNEY, \"INDEPENDENT COORDINATES FOR STRANGE ATTRACTORSFROM MUTUAL INFORMATION,\" PHYS. REV. A, VOL. 33, NO. 2, PP. 1134–1140,1986.","[36] L. CAO, \"PRACTICAL METHOD FOR DETERMINING THE MINIMUM EMBEDDING DI-MENSION OF A SCALAR TIME SERIES,\" PHYSICA D: NONLINEAR PHENOMENA,VOL. 110, NO. 1–2, PP. 43–50, 1997.","[37] T. GAUTAMA, D. P. MANDIC, AND M. M. VAN HULLE, \"A DIFFERENTIAL ENTROPYBASED METHOD FOR DETERMINING THE OPTIMAL EMBEDDING PARAMETERS OF ASIGNAL,\" IN PROC. IEEE INT. CONF. ACOUS. SPEECH SIGNAL PROCESS., 2003,VOL. 6, PP. 29–32.[38] L. L. TRULLA, A. GIULIANI, J. P. ZBILUT, AND C. L. WEBBER JR, \"RECURRENCEQUANTIFICATION ANALYSIS OF THE LOGISTIC EQUATION WITH TRANSIENTS,\" PHYS. LETT.","[38] L. L. TRULLA, A. GIULIANI, J. P. ZBILUT, AND C. L. WEBBER JR, \"RECURRENCEQUANTIFICATION ANALYSIS OF THE LOGISTIC EQUATION WITH TRANSIENTS,\" PHYS. LETT.A, VOL. 223, NO. 4, PP. 255–260, 1996.","[39] T. SCHREIBER AND A. SCHMITZ, \"SURROGATE TIME SERIES,\" PHYSICA D, VOL. 142,NO. 3–4, PP. 346–382, 2000.","[40] T. SCHREIBER AND A. SCHMITZ, \"IMPROVED SURROGATE DATA FOR NONLINEARITYTESTS,\" PHYS. REV. LETT., VOL. 77, NO. 4, PP. 635–638, 1996.","[41] C. J. KEYLOCK, \"IMPROVED PRESERVATION OF AUTOCORRELATION STRUCTURE IN SUR-ROGATE DATA USING AN INITIAL WAVELET STEP,\" NONLINEAR PROCESSES GEOPHYSICS,VOL. 15, NO. 3, PP. 435–444, 2008.","[42] N. REHMAN AND D. P. MANDIC, \"MULTIVARIATE EMPIRICAL MODE DECOMPOSI-TION,\" IN PROC. ROY. SOC. A, 2010, VOL. 466, NO. 2117, PP. 1291–1302.","[43] A. HEMAKOM, V. GOVERDOVSKY, D. LOONEY, AND D. P. MANDIC, \"ADAPTIVE-PROJECTION INTRINSICALLY TRANSFORMED MULTIVARIATE EMPIRICAL MODE DE-COMPOSITION IN COOPERATIVE BRAIN-COMPUTER INTERFACE APPLICATIONS,\" PHIL.TRANS. ROY. SOC. A, VOL. 374, NO. 2065, PP. 20150199-1–20150199-15,2016.","[44] P. TASS ET AL., \"DETECTION OF N:M PHASE LOCKING FROM NOISY DATA: APPLICATIONTO MAGNETOENCEPHALOGRAPHY,\" PHYS. REV. LETT., VOL. 81, NO. 15, PP. 3291–3294, 1998.","[45] S. M. PINCUS AND A. L. GOLDBERGER, \"PHYSIOLOGICAL TIME-SERIES ANALY-SIS: WHAT DOES REGULARITY QUANTIFY?,\" AMER. PHYSIOLOGICAL SOC., VOL. 266,NO. 4, PP. H1643–H1656, 1994.","[46] F. KAFFASHI, R. FOGLYANO, C. G. WILSON, AND K. A. LOPARO, \"THE EFFECT OFTIME DELAY ON APPROXIMATE & SAMPLE ENTROPY CALCULATIONS,\" PHYSICA D,VOL. 237, NO. 23, PP. 3069–3074, 2008.","[47] CBOE EXECUTE SUCCESS, \"WHITE PAPER—THE CBOE VOLATILITY INDEX—VIX R : THE POWERFUL AND FLEXIBLE TRADING AND RISK MANAGEMENT TOOL FROMTHE CHICAGO BOARD OPTIONS EXCHANGE,\" PP. 1–23, 2014."],"terms":["FINANCIAL","STRESS","INDICES","STOCK","COMPLEXITY","WHICH","TRENDS","USING","MARKET","MARKET"]},{"article":"22.pdf","title":"FUZZY DYNAMICAL SYSTEM SCENARIO SIMULATION-BASED CROSS-BORDER FINANCIAL CONTAGION ANALYSIS: A PERSPECTIVE FROM INTERNATIONAL CAPITAL FLOWS ","authors":["MENGXIANG ZHANG"],"institutions":[],"abstract":"ABSTRACT—THIS PAPER FOCUSES ON INVESTIGATING THE CROSS-BORDERFINANCIAL CONTAGION BASED ON A FUZZY DYNAMICAL SYSTEM SCENARIOSIMULATION FROM A PERSPECTIVE OF ANALYZING THE VOLATILITY OF INTERNA-TIONAL CAPITAL FLOWS FOR A PANEL OF 50 COUNTRIES IN EMERGING MARKETSAND ADVANCED ECONOMIES FROM 1980 TO 2011. INCREASING EVIDENCEHAS SHOWN THAT FINANCIAL GLOBALIZATION HAS DEVELOPED INTO A COMPLEXNONLINEAR DYNAMICAL SYSTEM MADE UP OF ECONOMIC SUBSYSTEMS WITHEXTENSIVE FINANCIAL CONNECTIONS AND LINKAGES. THE CONTAGION EFFECTSOF THE SPREAD OF BONANZAS IN THE 50 COUNTRIES ARE IDENTIFIED ANDANALYZED. THE HODRICK–PRESCOTT FILTER IS EMPLOYED TO ADDRESS THELONG-TERM NET CAPITAL INFLOW TREND. THE COMOVEMENT OF FINANCIALCONTAGION BETWEEN THE SOURCE COUNTRY OF FINANCIAL TURBULENCE ANDTHE VOLATILITY-AFFECTED COUNTRY IS DESCRIBED AS A FUZZY DYNAMICALSYSTEM IN WHICH THE DRIVING AND RESPONSE SYSTEMS ARE COUPLED. AFUZZY DYNAMICAL SYSTEM SCENARIO SIMULATION MODEL UNDER A LIBERALECONOMY IS ESTABLISHED BY EMPLOYING NONLINEAR DIFFERENTIAL EQUA-TIONS TO DESCRIBE THE CONTAGION MECHANISM AND THE INTERNATIONALCAPITAL FLOW VOLATILITY EFFECTS. THE MODEL IS THEN EXTENDED TO A DY-NAMICAL SYSTEM MODEL WITH MACROECONOMIC CONTROL. THE COUPLINGSTRENGTH UNCERTAINTY IS ADDRESSED BY EMPLOYING AN INTERVAL TYPE-2FUZZY THEORY METHOD. THE PROPERTIES OF THE VOLATILITY EQUILIBRIUMPOINT FOR THE TWO MODELS ARE DISCUSSED, AND THE VOLATILITY CONTA-GION PRINCIPLES BASED ON LOCALLY ASYMPTOTIC STABILITY ANALYSIS AREDERIVED TO EXPLAIN THE DIFFERENT VOLATILITY TRANSMISSION PATTERNS.MANUSCRIPT RECEIVED AUGUST 1, 2015; REVISED OCTOBER 22, 2015 AND JANUARY19, 2016; ACCEPTED APRIL 20, 2016. DATE OF PUBLICATION JUNE 1, 2016; DATE OFCURRENT VERSION MARCH 29, 2017. THIS WORK WAS SUPPORTED BY THE RESEARCH FOUN-DATION OF MINISTRY OF EDUCATION FOR THE DOCTORAL PROGRAM OF HIGHER EDUCATIONOF CHINA UNDER GRANT 20130181110063, THE YOUTH PROGRAM OF NATIONAL NATURALSCIENCE FOUNDATION OF CHINA UNDER GRANT 71501137, THE GENERAL PROGRAM OFCHINA POSTDOCTORAL SCIENCE FOUNDATION UNDER GRANT 2015M572470 AND GRANT2015M572480, THE INTERNATIONAL POSTDOCTORAL EXCHANGE FELLOWSHIP PROGRAMOF CHINA POSTDOCTORAL COUNCIL UNDER GRANT 20150028, THE PROJECT OF RESEARCHCENTER FOR SYSTEM SCIENCES AND ENTERPRISE DEVELOPMENT UNDER GRANT XQ16B05,AND SICHUAN UNIVERSITY UNDER GRANT SKZX2015-SB04 AND GRANT SKQY201647.X. XU IS WITH THE SCHOOL OF TOURISM AND ECONOMIC MANAGEMENT, CHENGDUUNIVERSITY, CHENGDU 610106, CHINA, AND ALSO WITH THE UNCERTAINTY DECISION-MAKING LABORATORY, BUSINESS SCHOOL, SICHUAN UNIVERSITY, CHENGDU 610065,CHINA (E-MAIL: XINXINXU@SCU.EDU.CN).Z. ZENG IS WITH THE UNCERTAINTY DECISION-MAKING LABORATORY, BUSINESSSCHOOL, SICHUAN UNIVERSITY, CHENGDU 610065, CHINA, THE SCHOOL OF TOURISM ANDECONOMIC MANAGEMENT, CHENGDU UNIVERSITY, CHENGDU 610106, CHINA, ANDALSO WITH THE DEPARTMENT OF CIVIL AND ENVIRONMENTAL ENGINEERING, UNIVERSITYOF WASHINGTON, SEATTLE, WA 98195 USA (E-MAIL: ZENGZIQIANG@SCU.EDU.CN).J. XU IS WITH THE UNCERTAINTY DECISION-MAKING LABORATORY, BUSINESS SCHOOL-SICHUAN UNIVERSITY, CHENGDU 610065, CHINA (E-MAIL: XUJIUPING@SCU.EDU.CN).M. ZHANG IS WITH THE UNCERTAINTY DECISION-MAKING LABORATORY, BUSI-NESS SCHOOL, SICHUAN UNIVERSITY, CHENGDU 610065, CHINA (E-MAIL:ZHANGMENGXIANG@STU.SCU.EDU.CN).COLOR VERSIONS OF ONE OR MORE OF THE FIGURES IN THIS PAPER ARE AVAILABLE ONLINEAT HTTP://IEEEXPLORE.IEEE.ORG.DIGITAL OBJECT IDENTIFIER 10.1109/TFUZZ.2016.2574928POLICY SUGGESTIONS ARE GIVEN IN THREE SITUATIONS FOR PROVIDING MAN-AGERIAL INSIGHTS FOR POLICYMAKERS AND THE EXPLORATIONS OF RESPONSESTRATEGIES ARE ALSO PRESENTED. THE GLOBAL FINANCIAL CRISIS IN 2008IS USED AS AN EXPERIMENTAL STUDY TO DEMONSTRATE THE VALIDITY ANDEFFECTIVENESS OF THE SIMULATION AND MODELING METHOD.","objective":[],"problem":"","methodology":[],"contributes":"","references":["[1] F. SCHWEITZER, G. FAGIOLO, D. SORNETTE, F. VEGA-REDONDO, A. VESPIGNANI,AND D. R. WHITE, \"ECONOMIC NETWORKS: THE NEW CHALLENGES,\" SCIENCE,VOL. 325, NO. 5939, PP. 422–425, 2009.","[2] Y. LEITNER, \"FINANCIAL NETWORKS: CONTAGION, COMMITMENT, AND PRIVATE SEC-TOR BAILOUTS,\" J. FINANCE, VOL. 60, NO. 6, PP. 2925–2953, 2005.","[3] P. GLASSERMAN AND B. P. YOUNG, \"HOW LIKELY IS CONTAGION IN FINANCIALNETWORKS?\" J. BANKING FINANCE, VOL. 50, PP. 383–399, 2015.","[4] G. CASTELLACCI AND Y. CHOI, \"FINANCIAL INSTABILITY CONTAGION: A DYNAMICALSYSTEMS APPROACH,\" QUANT. FINANCE, VOL. 14, NO. 7, PP. 1243–1255, 2014.","[5] F. ALLEN AND D. GALE, \"FINANCIAL CONTAGION,\" J. POLITICAL ECON., VOL. 108,NO. 1, PP. 1–33, 2000.","[6] S. CLAESSENS AND K. J. FORBES, EDS, INTERNATIONAL FINANCIAL CONTAGION.NEW YORK, NY, USA: SPRINGER-VERLAG, 2001.","[7] K. J. FORBES AND R. RIGOBON, \"MEASURING CONTAGION: CONCEPTUAL ANDEMPIRICAL ISSUES,\" INTERNATIONAL FINANCIAL CONTAGION, S. CLAESSENS ANDK. J. FORBES. NEW YORK, NY, USA: SPRINGER-VERLAG, 2001.","[8] S. CLAESSENS, R. DORNBUSCH, AND Y. C. PARK, \"CONTAGION: WHY CRISES SPREADAND HOW THIS CAN BE STOPPED?\" IN INTERNATIONAL FINANCIAL CONTAGION,S. CLAESSENS AND K. J. FORBES, EDS. NEW YORK, NY, USA: SPRINGER-VERLAG,2001.","[9] M. PRITSKER, \"THE CHANNELS FOR FINANCIAL CONTAGION,\" IN INTERNATIONAL FI-NANCIAL CONTAGION, S. CLAESSENS AND K. J. FORBES, EDS. NEW YORK, NY,USA: SPRINGER-VERLAG, 2001.","[10] M. ELLIOTT, B. GOLUB, AND M. O. JACKSON, \"FINANCIAL NETWORKS AND CONTA-GION,\" AMER. ECON. REV., VOL. 104, NO. 10, PP. 3115–3153, 2014.","[11] K. J. FORBES AND F. E. WARNOCK, \"CAPITAL FLOW WAVES: SURGES, STOPS, FLIGHT,AND RETRENCHMENT,\" J. INT. ECON., VOL. 88, NO. 2, PP. 235–251, 2012.","[12] M. BORDO AND A. MURSHID, \"ARE FINANCIAL CRISES BECOMING MORE CONTA-GIOUS? WHAT IS THE HISTORICAL EVIDENCE ON CONTAGION?\" IN INTERNATIONALFINANCIAL CONTAGION, S. CLAESSENS AND K. J. FORBES, EDS. NEW YORK, NY,USA: SPRINGER-VERLAG, 2001.","[13] M. DUNGEY, R. A. FRY, B. GONZÁLEZ-HERMOSILLO, AND V. MARTIN, TRANS-MISSION OF FINANCIAL CRISES AND CONTAGION: A LATENT FACTOR APPROACH.NEW YORK, NY, USA: OXFORD UNIV. PRESS, 2010.","[14] N. BOYSON, C. STAHEL, AND R. STULZ, \"HEDGE FUND CONTAGION AND LIQUIDITYSHOCKS,\" J. FINANCE, VOL. 65, NO. 5, PP. 1789–1816, 2010.","[15] K. H. BAE, G. A. KAROLYI, AND R. M. STULZ, \"A NEW APPROACH TO MEASURINGFINANCIAL CONTAGION,\" REV. FINANCIAL STUD., VOL. 16, NO. 3, PP. 717–763,2003.","[16] D. COLLINS AND S. GAVRON, \"CHANNELS OF FINANCIAL MARKET CONTAGION,\" APPL.ECON., VOL. 36, NO. 21, PP. 2461–2469, 2004.","[17] R. DORNBUSCH, Y. C. PARK, AND S. CLAESSENS, \"CONTAGION: UNDERSTANDINGHOW IT SPREADS,\" WORLD BANK RES. OBS., VOL. 15, NO. 2, PP. 177–197, 2000.","[18] C. RADDATZ AND S. L. SCHMULDER, \"ON THE INTERNATIONAL TRANSMISSIONOF SHOCKS: MICRO-EVIDENCE FROM MUTUAL FUND PORTFOLIOS,\" J. INT. ECON.,VOL. 88, NO. 2, PP. 357–374, 2012.","[19] M. MELVIN AND B. P. MELVIN, \"THE GLOBAL TRANSMISSION OF VOLATILITY IN THEFOREIGN EXCHANGE MARKET,\" REV. ECON. STATIST., VOL. 85, NO. 3, PP. 670–679,2003.","[20] N. NOMIKOS AND E. SALVADOR, \"THE ROLE OF VOLATILITY REGIMES ON VOLATIL-ITY TRANSMISSION PATTERNS,\" QUANT. FINANCE, VOL. 14, NO. 1, PP. 1–13,2014.","[21] H. H. LEE, C. Y. PARK, AND H. S. BYUN, \"DO CONTAGION EFFECTS EXIST INCAPITAL FLOW VOLATILITY?\" J. JPN. INT. ECON., VOL. 30, PP. 76–95, 2013.","[22] R. D. VILAG, G. H. IONESCU, M. D. UNGUREANU, AND I. VASILE, \"CONTAGIONCAUSES-RATIONAL OR IRRATIONAL BEHAVIOR,\" IN PROC. IND. REVOLUTIONS GLOB-ALIZATION POST-GLOBALIZATION PERSPECT. VOL IV: BANK. ACCOUNT. FINANCIALSYST. 21ST CENTURY PERSPECT., 2009, PP. 669–678.[23] S. GRIFFITH-JONES, \"STABILISING CAPITAL FLOWS TO DEVELOPING COUNTRIES,\" IDSBULL., VOL. 30, NO. 1, PP. 33–49, 1999.","[23] S. GRIFFITH-JONES, \"STABILISING CAPITAL FLOWS TO DEVELOPING COUNTRIES,\" IDSBULL., VOL. 30, NO. 1, PP. 33–49, 1999.","[24] E. G. MENDOZA AND M. E. TERRONES, \"AN ANATOMY OF CREDIT BOOMS: EVI-DENCE FROM MACRO AGGREGATES AND MICRO DATA,\" NAT. BUREAU ECONOM. RES.,WORKING PAPER 14049, 2008.","[25] C. M. REINHART AND V. R. REINHART, \"CAPITAL FLOW BONANZAS: AN ENCOM-PASSING VIEW OF THE PAST AND PRESENT,\" NAT. BUREAU ECONOM. RES., WORKINGPAPER 14321, 2008.","[26] R. J. HODRICK AND E. C. PRESCOTT, \"POSTWAR U.S. BUSINESS CYCLES: ANEMPIRICAL INVESTIGATION,\" J. MONEY CREDIT BANKING, VOL. 29, NO. 1,PP. 1–16, 1997.","[27] M. O. RAVN AND H. UHLIG, \"ON ADJUSTING THE HODRICK-PRESCOTT FILTER FOR THEFREQUENCY OF OBSERVATIONS,\" REV. ECON. STATIST., VOL. 84, NO. 2, PP. 371–376,2002.","[28] R. WERON AND M. ZATOR, \"A NOTE ON USING THE HODRICK-PRESCOTT FILTER INELECTRICITY MARKETS,\" ENERGY ECON., VOL. 48, PP. 1–6, 2015.","[29] L. LAEVEN AND F. VALENCIA, \"SYSTEMIC BANKING CRISES DATABASE: AN UPDATE,\"IMF WORKING PAPER 12/163, 2012.","[30] M. FRATZSCHER, \"CAPITAL FLOWS, PUSH VERSUS PULL FACTORS AND THE GLOBALFINANCIAL CRISIS,\" J. INT. ECON., VOL. 88, NO. 2, PP. 341–356, 2012.","[31] G. FAZIO, \"EXTREME INTERDEPENDENCE AND EXTREME CONTAGION BETWEENEMERGING MARKETS,\" J. INT. MONEY FINANCE, VOL. 26, NO. 8, PP. 1261–1291,2007.","[32] E. T. WHITTAKER, \"ON A NEW METHOD OF GRADUATION,\" PROC. EDINBURGH MATH.SOC., VOL. 41, PP. 63–75, 1922.","[33] L. A. ZADEH, \"THE CONCEPT OF A LINGUISTIC VARIABLE AND ITS APPLICATION TOAPPROXIMATE REASONING-1,\" INF. SCI., VOL. 8, PP. 199–249, 1975.","[34] J. M. MENDEL AND X. W. LIU, \"SIMPLIFIED INTERVAL TYPE-2 FUZZY LOGICSYSTEMS,\" IEEE TRANS. FUZZY SYST., VOL. 21, NO. 6, PP. 1056–1069, DEC.2013.","[35] J. M. MENDEL AND R. I. JOHN, \"TYPE-2 FUZZY SETS MADE SIMPLE,\" IEEETRANS. FUZZY SYST., VOL. 10, NO. 2, PP. 117–127, APR. 2002.","[36] R. R. YAGER, \"FUZZY SUBSETS OF TYPE II IN DECISIONS,\" J. CYBERN., VOL. 10,NOS. 1–3, PP. 137–159, 1980.","[37] J. M. MENDEL, R. I. JOHN, AND F. LIU, \"INTERVAL TYPE-2 FUZZY LOGIC SYSTEMSMADE SIMPLE,\" IEEE TRANS. FUZZY SYST., VOL. 14, NO. 6, PP. 808–821,DEC. 2006.","[38] E. A. JAMMEH, M. FLEURY, C. WAGNER, H. HAGRAS, AND M. GHANBARI,\"INTERVAL TYPE-2 FUZZY LOGIC CONGESTION CONTROL FOR VIDEO STREAMING ACROSSIP NETWORKS,\" IEEE TRANS. FUZZY SYST., VOL. 17, NO. 5, PP. 1123–1142, OCT.2009.","[39] J. M. MENDEL AND H. W. WU, \"TYPE-2 FUZZISTICS FOR SYMMETRIC INTERVALTYPE-2 FUZZY SETS: PART 1, FORWARD PROBLEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 14, NO. 6, PP. 781–792, DEC. 2006.","[40] J. M. MENDEL AND H. W. WU, \"TYPE-2 FUZZISTICS FOR SYMMETRIC INTERVALTYPE-2 FUZZY SETS: PART 2, INVERSE PROBLEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 15, NO. 2, PP. 301–308, APR. 2007.","[41] Y. CHOI AND R. DOUADY, \"FINANCIAL CRISIS DYNAMICS: ATTEMPT TO DEFINE AMARKET INSTABILITY INDICATOR,\" QUANT. FINANCE, VOL. 12, NO. 9, PP. 1351–1365, 2012.","[42] G. CASTELLACCI AND Y. CHOI, \"MODELING CONTAGION IN THE EUROZONE CRISISVIA DYNAMICAL SYSTEMS,\" J. BANKING FINANCE, VOL. 50, PP. 400–410, 2015.","[43] W. S. SON AND Y. J. PARK, \"DELAYED FEEDBACK ON THE DYNAMICAL MODEL OF AFINANCIAL SYSTEM,\" CHAOS SOLITONS FRACTALS, VOL. 44, NOS. 4/5, PP. 208–217,2011.","[44] Z. H. HU AND W. CHEN, \"MODELING OF MACROECONOMICS BY A NOVEL DIS-CRETE NONLINEAR FRACTIONAL DYNAMICAL SYSTEM,\" DISCRETE DYN. NATURE SOC.,VOL. 2013, P. 9, 2013, ART. NO. 275134.","[45] B. BEDE, I. J. RUDAS, AND A. L. BENCSIK, \"FIRST ORDER LINEAR FUZZY DIFFERENTIALEQUATIONS UNDER GENERALIZED DIFFERENTIABILITY,\" INF. SCI., VOL. 177, PP. 1648–1662, 2007.","[46] M. CHEN, Y. FU, X. XUE, AND C. WU, \"TWO-POINT BOUNDARY VALUE PROBLEMSOF UNDAMPED UNCERTAIN DYNAMICAL SYSTEMS,\" FUZZY SETS SYST., VOL. 159,PP. 2077–2089, 2008.","[47] B. CHEN AND X. LIU, \"RELIABLE CONTROL DESIGN OF FUZZY DYNAMICAL SYSTEMSWITH TIME-VARYING DELAY,\" FUZZY SETS SYST., VOL. 146, PP. 349–374, 2004.","[48] L. HONG AND J. SUN, \"BIFURCATIONS OF FUZZY NONLINEAR DYNAMICAL SYSTEMS,\"COMMUN. NONLINEAR SCI. NUMER. SIMUL., VOL. 11, NO. 1, PP. 1–12, 2006.","[49] J. P. XU, Z. G. LIAO, AND Z. N. HU, \"A CLASS OF LINEAR DIFFERENTIAL DYNAMICALSYSTEMS WITH FUZZY INITIAL CONDITION,\" FUZZY SETS SYST., VOL. 158, NO. 21,PP. 2339–2358, 2007.","[50] J. P. XU, Z. G. LIAO, AND J. J. NIETO, \"A CLASS OF LINEAR DIFFERENTIAL DYNAM-ICAL SYSTEMS WITH FUZZY MATRICES,\" J. MATH. ANAL. APPL., VOL. 368, NO. 1,PP. 54–68, 2010.","[51] S. ARORA AND B. BARAK, COMPUTATIONAL COMPLEXITY: A MODERN APPROACH.LONDON, U.K.: CAMBRIDGE UNIV. PRESS, 2009.","[52] D. K. BACKUS AND P. J. KEHOE, \"INTERNATIONAL EVIDENCE ON THE HISTORICALPROPERTIES OF BUSINESS CYCLES,\" AMER. ECON. REV., VOL. 88, NO. 4, PP. 864–888, 1992.","[53] I. H. CORREIA, J. L. NEVES, AND S. T. REBELO, \"BUSINESS CYCLES FROM1850C1950: NEW FACTS ABOUT OLD DATA,\" EUR. ECON. REV., VOL. 36, NOS.2/3, PP. 459–467, 1992.","[54] T. J. COOLEY AND L. E. OHANIAN, \"THE CYCLICAL BEHAVIOR OF PRICES,\" J.MONETARY ECON., VOL. 28, NO. 1, PP. 25–60, 1991.","[55] M. BAXTER AND R. KING, \"MEASURING BUSINESS CYCLES: APPROXIMATE BAND-PASS FILTERS FOR ECONOMIC TIME SERIES,\" REV. ECON. STATIST., VOL. 81, NO. 4,PP. 575–593, 1999.","[56] A. IACOBUCCI AND A. NOULLEZ, \"A FREQUENCY SELECTIVE FILTER FOR SHORT-LENGTHTIME SERIES,\" COMPUT. ECON., VOL. 25, NOS. 1/2, PP. 75–102, 2005.","[57] R. F. ENGLE AND C. W. J. GRANGER, \"CO-INTEGRATION AND ERROR CORRECTION:REPRESENTATION, ESTIMATION, AND TESTING,\" ECONOMETRICA, VOL. 55, NO. 2,PP. 251–276, 1987.","[58] A. C. STOCKMAN AND L. L. TESAR, \"TASTES AND TECHNOLOGY IN A 2-COUNTRYMODEL OF THE BUSINESS CYCLE: EXPLAINNING INTERNATIONAL COMOVEMENTS,\"AMER. ECON. REV., VOL. 85, NO. 1, PP. 168–185, 1995.","[59] R. M. NEUMANN, R. PENL, AND A. TANKU, \"VOLATILITY OF CAPITAL FLOWS ANDFINANCIAL LIBERALIZATION: DO SPECIFIC FLOWS RESPOND DIFFERENTLY?\" INT. REV.ECON. FINANCE, VOL. 18, NO. 3, PP. 488–501, 2009.","[60] H. W. WU AND J. M. MENDEL, \"UNCERTAINTY BOUNDS AND THEIR USE IN THEDESIGN OF INTERVAL TYPE-2 FUZZY LOGIC SYSTEMS,\" IEEE TRANS. FUZZY SYST.,VOL. 10, NO. 5, PP. 622–639, OCT. 2002.","[61] D. R. WU AND J. M. MENDEL, \"ENHANCED KARNIK–MENDEL ALGORITHMS,\"IEEE TRANS. FUZZY SYST., VOL. 17, NO. 4, PP. 923–934, AUG. 2009.","[62] D. KENOURGIOS AND D. DIMITRIOU, \"CONTAGION OF THE GLOBAL FINANCIAL CRI-SIS AND THE REAL ECONOMY: A REGIONAL ANALYSIS,\" ECON. MODEL., VOL. 44,PP. 283–293, 2015.","[63] F. BRAUER AND C. CASTILLO-CHAVEZ, MATHEMATICAL MODELS IN POPULATIONBIOLOGY AND EPIDEMIOLOGY. NEW YORK, NY, USA: SPRINGER-VERLAG, 2001.","[64] T. BENDIXSON, \"SUS LES COURBES DÉFINIES PAR DES ÉQUATIONS DIFFERENTIELLES,\"ACTA MATH., VOL. 24, PP. 1–88, 1901.","[65] CEIC, GLOBAL DATABASE, 2015. [ONLINE]. AVAILABLE: HTTP:/WWW.CEICDATA.COM/EN/PRODUCTS/GLOBALXINXIN XU (M'15) RECEIVED THE PH.D DEGREE IN ECO-NOMICS FROM SICHUAN UNIVERSITY, CHENGDU, CHINA, IN2014, AND WAS A VISITING SCHOLAR AT NATIONAL UNIVER-SITY OF SINGAPORE, SINGAPORE, FROM 2012 TO 2013."],"terms":["FINANCIAL","VOLATILITY","COUNTRY","CONTAGION","CAPITAL","MODEL","AFFECTED","FUZZY","SOURCE","SYSTEM"]},{"article":"31.pdf","title":"A GENETIC BANKRUPT RATIO ANALYSIS TOOL USING A GENETIC ALGORITHM TO IDENTIFY INFLUENCING FINANCIAL RATIOS ","authors":["IS MIRANDA LAKSHMI"," ARULDOSS MARTIN"," VENKATASAMY PRASANNA VENKATESAN"],"institutions":[],"abstract":"ABSTRACT—FINANCIAL RATIOS ARE KEY CONSTITUENTS OF BANKRUPTCYMODELS. THE BANKRUPTCY PREDICTION ACCURACY SUBSTANTIALLYIMPROVES WHEN A LIMITED NUMBER OF RATIOS ARE USED. FROM THE LIT-ERATURE, IT HAS BEEN FOUND THAT HUMAN EXPERTISE HAS BEEN APPLIEDTO SELECT FINANCIAL RATIOS FOR BANKRUPTCY MODELS. DIFFERENT EXPERTSTEND TO HAVE DIFFERENT OPINIONS AND HENCE THE BANKRUPTCY PREDIC-TION RESULTS DEPEND UPON THEIR COMPETENCY LEVELS IN THAT DOMAIN.ACCORDINGLY, THERE IS A NEED FOR FINDING A SYSTEMATIC METHODOR A TOOL TO IDENTIFY THE INFLUENCING RATIOS. THIS PAPER DEVELOPSA GENETIC BANKRUPT RATIO ANALYSIS TOOL USING A GENETIC ALGORITHM TOIDENTIFY INFLUENCING RATIOS FROM DIFFERENT BANKRUPTCY MODELS ANDTHEIR INFLUENCES IN A QUANTITATIVE FORM. THE ACCURACY OF VALUES OFINFLUENCING RATIOS IS VALIDATED BY COMPARING ORIGINAL THRESHOLDVALUE OF THE BANKRUPTCY MODELS. THE PERFORMANCE OF INFLUENCINGRATIOS HAS BEEN COMPARED WITH OTHER FEATURE SELECTION TECHNIQUESAND THE ALTMAN MODEL IS CONSIDERED TO EXPLAIN THE EFFECT OF THEINFLUENCING RATIOS.","objective":["IN THIS PAPER, WE ATTEMPT TO DESIGN AND DEVELOP A GENETICBANKRUPT RATIO ANALYSIS TOOL (GBRAT) USING REAL-GENETIC ALGO-RITHM (RGA) [6] TO FIND THE INFLUENCING RATIOS","HENCE, IN THIS PAPER, WE MADE AN ATTEMPT TO DEVELOP A TOOLUSING GENETIC ALGORITHM TO IDENTIFY THE INFLUENCING FINANCIALFEATURES"],"problem":"","methodology":["CATES THAT THE BUSINESS IS LIKELY TO BANKRUPT","GESTED MORE CONFIDENCE TO CHOOSE THIS METHODOLOGY","WE HAVE APPLIED THIS METHODOLOGY TO BANKRUPTCY MODELS ANDINFLUENCING RATIOS ARE IDENTIFIED ACCORDING TO THE EXPERIMENTALRESULTS","RESULTS"],"contributes":"","references":["[1] M. D. FETHI AND F. PASIOURAS, \"ASSESSING BANK EFFICIENCY AND PERFOR-MANCE WITH OPERATIONAL RESEARCH AND ARTIFICIAL INTELLIGENCE TECHNIQUES:A SURVEY,\" EUR. J. OPER. RES., VOL. 204, NO. 2, PP. 189–198, 2010.","[2] H. HUANG, M. PASQUIER, AND C. QUEK, \"FINANCIAL MARKET TRADING SYSTEMWITH A HIERARCHICAL COEVOLUTIONARY FUZZY PREDICTIVE MODEL,\" IEEE TRANS.EVOL. COMPUT., VOL. 13, NO. 1, PP. 56–70, FEB. 2009.","[3] A. MOCHÓN, D. QUINTANA, Y. SÁEZ, AND P. ISASI, \"SOFT COMPUTING TECH-NIQUES APPLIED TO FINANCE,\" APPL. INTELL., VOL. 29, NO. 2, PP. 111–115,2007.","[4] A. TSAKONAS, G. DOUNIAS, M. DOUMPOS, AND C. ZOPOUNIDIS, \"BANKRUPTCYPREDICTION WITH NEURAL LOGIC NETWORKS BY MEANS OF GRAMMAR-GUIDEDGENETIC PROGRAMMING,\" EXPERT SYST. APPL., VOL. 30, NO. 3, PP. 449–461,2006.","[5] W.-S. CHEN AND Y.-K. DU, \"USING NEURAL NETWORKS AND DATA MINING TECH-NIQUES FOR THE FINANCIAL DISTRESS PREDICTION MODEL,\" EXPERT SYST. APPL.,VOL. 36, NO. 2, PP. 4075–4086, 2009.","[6] C.-H. WU, G.-H. TZENG, Y.-J. GOO, AND W.-C. FANG, \"A REAL-VALUED GENETIC ALGORITHM TO OPTIMIZE THE PARAMETERS OF SUPPORT VECTORMACHINE FOR PREDICTING BANKRUPTCY,\" EXPERT SYST. APPL., VOL. 32, NO. 2,PP. 397–408, 2007.","[7] H.-L. CHEN ET AL., \"A NOVEL BANKRUPTCY PREDICTION MODEL BASED ONAN ADAPTIVE FUZZY K-NEAREST NEIGHBOUR METHOD,\" KNOWL.-BASED SYST.,VOL. 24, NO. 8, PP. 1348–1359, 2011.","[8] C. LIN, H. KHAN, R. CHANG, AND Y. WANG, \"A NEW APPROACH TO MODELLINGEARLY WARNING SYSTEMS FOR CURRENCY CRISES: CAN A MACHINE-LEARNING FUZZYEXPERT SYSTEM PREDICT THE CURRENCY CRISES EFFECTIVELY?\" J. INT. MONEYFINANC., VOL. 27, NO. 7, PP. 1098–1121, 2008.","[9] Y.-C. TANG, \"AN APPROACH TO BUDGET ALLOCATION FOR AN AEROSPACECOMPANY—FUZZY ANALYTIC HIERARCHY PROCESS AND ARTIFICIAL NEURALNETWORK,\" NEUROCOMPUTING, VOL. 72, NOS. 16–18, PP. 3477–3489, 2009.","[10] H. A. ABDOU, \"GENETIC PROGRAMMING FOR CREDIT SCORING: THE CASEOF EGYPTIAN PUBLIC SECTOR BANKS,\" EXPERT SYST. APPL., VOL. 36, NO. 9,PP. 11402–11417, 2009.","[11] V. RAVI, H. KURNIAWAN, P. N. K. THAI, AND P. R. KUMAR, \"SOFT COMPUTINGSYSTEM FOR BANK PERFORMANCE PREDICTION,\" APPL. SOFT COMPUT., VOL. 8,NO. 1, PP. 305–315, 2008.","[12] H.-J. KIM AND K.-S. SHIN, \"A HYBRID APPROACH BASED ON NEURAL NETWORKSAND GENETIC ALGORITHMS FOR DETECTING TEMPORAL PATTERNS IN STOCK MARKETS,\"APPL. SOFT COMPUT., VOL. 7, NO. 2, PP. 569–576, 2007.","[13] J. G. FULMER, J. E. MOON, T. A. GAVIN, AND M. J. ERWIN, \"A BANKRUPTCYCLASSIFICATION MODEL FOR SMALL FIRMS,\" J. COMMER. BANK LEND., VOL. 24,NO. 2, PP. 25–37, 1984.","[14] W.-Y. LIN, Y.-H. HU, AND C.-F. TSAI, \"MACHINE LEARNING IN FINANCIAL CRISISPREDICTION: A SURVEY,\" IEEE TRANS. SYST., MAN, CYBERN. C, APPL. REV.,VOL. 42, NO. 4, PP. 421–436, JUL. 2012.","[15] J. C. VAN HORNE, FINANCIAL MANAGEMENT POLICY, 12TH ED. PRENTICE-HALL,UPPER SADDLE RIVER, NJ, USA, 2001.","[16] G. ZHANG, M. Y. HU, B. E. PATUWO, AND D. C. INDRO, \"ARTIFICIALNEURAL NETWORKS IN BANKRUPTCY PREDICTION: GENERAL FRAMEWORK AND CROSS-VALIDATION ANALYSIS,\" EUR. J. OPER. RES., VOL. 116, NO. 1, PP. 16–32,1999.","[17] P. DU JARDIN, \"PREDICTING BANKRUPTCY USING NEURAL NETWORKS AND OTHERCLASSIFICATION METHODS: THE INFLUENCE OF VARIABLE SELECTION TECHNIQUES ONMODEL ACCURACY,\" NEUROCOMPUTING, VOL. 73, NOS. 10–12, PP. 2047–2060,2010.","[18] P. R. KUMAR AND V. RAVI, \"BANKRUPTCY PREDICTION IN BANKS AND FIRMSVIA STATISTICAL AND INTELLIGENT TECHNIQUES—A REVIEW,\" EUR. J. OPER. RES.,VOL. 180, NO. 1, PP. 1–28, 2007.","[19] A. MARTIN, T. M. LAKSHMI, AND V. P. VENKATESAN, \"AN ANALYSIS ON QUAL-ITATIVE BANKRUPTCY PREDICTION RULES USING ANT-MINER,\" INT. J. INTELL. SYST.APPL., VOL. 6, NO. 1, PP. 36–44, DEC. 2013.","[20] A. MARTIN, M. MANJULA, AND V. P. VENKATESAN, \"A BUSINESS INTELLIGENCEMODEL TO PREDICT BANKRUPTCY USING FINANCIAL DOMAIN ONTOLOGY WITH ASSO-CIATION RULE MINING ALGORITHM,\" INT. J. COMPUT. SCI., VOL. 8, NO. 3,PP. 211–218, 2011.","[21] M. ANANDARAJAN, P. LEE, AND A. ANANDARAJAN, \"BANKRUPTCY PREDICTIONOF FINANCIALLY STRESSED FIRMS: AN EXAMINATION OF THE PREDICTIVE ACCURACYOF ARTIFICIAL NEURAL NETWORKS,\" INTELL. SYST. ACCOUNT. FINANC. MANAGE.,VOL. 10, NO. 2, PP. 69–81, 2001.","[22] X. XU AND Y. WANG, \"FINANCIAL FAILURE PREDICTION USING EFFICIENCY ASA PREDICTOR,\" EXPERT SYST. APPL., VOL. 36, NO. 1, PP. 366–373, 2009.","[23] S. CHO, H. HONG, AND B.-C. HA, \"A HYBRID APPROACH BASED ON THE COMBI-NATION OF VARIABLE SELECTION USING DECISION TREES AND CASE-BASED REASONINGUSING THE MAHALANOBIS DISTANCE: FOR BANKRUPTCY PREDICTION,\" EXPERT SYST.APPL., VOL. 37, NO. 4, PP. 3482–3488, 2010.","[24] B. HOOGS, T. KIEHL, C. LACOMB, AND D. SENTURK, \"A GENETIC ALGORITHMAPPROACH TO DETECTING TEMPORAL PATTERNS INDICATIVE OF FINANCIAL STATE-MENT FRAUD,\" INTELL. SYST. ACCOUNT. FINANC. MANAGE., VOL. 15, NOS. 1–2,PP. 41–56, 2007.","[25] S.-H. MINA, J. LEEB, AND I. HANB, \"HYBRID GENETIC ALGORITHMS AND SUP-PORT VECTOR MACHINES FOR BANKRUPTCY PREDICTION,\" EXPERT SYST. APPL.,VOL. 31, NO. 3, PP. 652–660, 2006.","[26] Z. HUIMIN, A. P. SINHA, AND W. GE, \"EFFECTS OF FEATURE CONSTRUC-TION ON CLASSIFICATION PERFORMANCE: AN EMPIRICAL STUDY IN BANK FAILUREPREDICTION,\" EXPERT SYST. APPL., VOL. 36, NO. 2, PP. 2633–2644, 2009.","[27] A. F. ATIYA, \"BANKRUPTCY PREDICTION FOR CREDIT RISK USING NEURAL NETWORKS:A SURVEY AND NEW RESULTS,\" IEEE TRANS. NEURAL NETW., VOL. 12, NO. 4,PP. 929–935, JUL. 2001.","[28] V. K. KOUMOUSIS AND C. P. KATSARAS, \"A SAW-TOOTH GENETIC ALGORITHMCOMBINING THE EFFECTS OF VARIABLE POPULATION SIZE AND REINITIALIZATIONTO ENHANCE PERFORMANCE,\" IEEE TRANS. EVOL. COMPUT., VOL. 10, NO. 1,PP. 19–28, FEB. 2006.","[29] T. E. MCKEE AND T. LENSBERG, \"GENETIC PROGRAMMING AND ROUGH SETS:A HYBRID APPROACH TO BANKRUPTCY CLASSIFICATION,\" EUR. J. OPER. RES.,VOL. 138, NO. 2, PP. 436–451, 2002.","[30] M.-J. KIM AND D.-K. KANG, \"ENSEMBLE WITH NEURAL NETWORKSFOR BANKRUPTCY PREDICTION,\" EXPERT SYST. APPL., VOL. 37, NO. 4,PP. 3373–3379, 2010.","[31] H.-J. CHEN, S. Y. HUANG, AND C.-S. LIN, \"ALTERNATIVE DIAGNOSIS OF CORPO-RATE BANKRUPTCY: A NEURO FUZZY APPROACH,\" EXPERT SYST. APPL., VOL. 36,NO. 4, PP. 7710–7720, 2009.","[32] H. AHN AND K.-J. KIM, \"BANKRUPTCY PREDICTION MODELING WITH HYBRIDCASE-BASED REASONING AND GENETIC ALGORITHMS APPROACH,\" APPL. SOFTCOMPUT., VOL. 9, NO. 2, PP. 599–607, 2009.","[33] K.-S. SHIN AND Y.-J. LEE, \"A GENETIC ALGORITHM APPLICATION IN BANKRUPTCYPREDICTION MODELLING,\" EXPERT SYST. APPL., VOL. 23, NO. 3, PP. 321–328,2002.","[34] A. MARTIN, V. GAYATHRI, G. SARANYA, P. GAYATHRI, AND V. P. VENKATESAN,\"A HYBRID MODEL FOR BANKRUPTCY PREDICTION USING GENETIC ALGORITHM,FUZZY C-MEANS AND MARS,\" INT. J. SOFT COMPUT., VOL. 2, NO. 1, PP. 12–24,2011.","[35] A. MARTIN, T. M. LAKSHMI, AND V. P. VENKATESAN, \"TO FIND MOSTIMPACT FINANCIAL FEATURES ON BANKRUPTCY MODELS USING GENETIC ALGO-RITHM,\" IN PROC. INT. CONF. ADV. ENG. TECHNOL., NAGAPATTINAM, INDIA, 2011,PP. 174–179.[36] N. CHEN, B. RIBEIRO, A. S. VIEIRA, J. DUARTE, AND J. C. NEVES, \"A GENETICALGORITHM-BASED APPROACH TO COST-SENSITIVE BANKRUPTCY PREDICTION,\"","[36] N. CHEN, B. RIBEIRO, A. S. VIEIRA, J. DUARTE, AND J. C. NEVES, \"A GENETICALGORITHM-BASED APPROACH TO COST-SENSITIVE BANKRUPTCY PREDICTION,\"EXPERT SYST. APPL., VOL. 38, NO. 10, PP. 12939–12945, 2011.","[37] A. MARTIN, R. UTHRA, A. KAVITHA, B. DIVYA, AND V. P. VENKATESAN,\"A BUSINESS INTELLIGENCE MODEL FOR PREDICTING BANKRUPTCY USING CBRWITH ESSENTIAL FEATURES,\" INT. J. INF. TECHNOL. ENG., VOL. 3, NO. 1–2,PP. 91–97, 2012.","[38] P. RAVISANKAR, V. RAVI, AND I. BOSE, \"FAILURE PREDICTION OF DOTCOM COM-PANIES USING NEURAL NETWORK–GENETIC PROGRAMMING HYBRIDS,\" INF. SCI.,VOL. 180, NO. 8, PP. 1257–1267, 2010.","[39] P. G. ESPEJO, S. VENTURA, AND F. HERRERA, \"A SURVEY ON THE APPLICA-TION OF GENETIC PROGRAMMING TO CLASSIFICATION,\" IEEE TRANS. SYST., MAN,CYBERN. C, APPL. REV., VOL. 40, NO. 2, PP. 121–144, MAR. 2010.","[40] H. LI, J. SUN, AND B.-L. SUN, \"FINANCIAL DISTRESS PREDICTION BASED ONOR-CBR IN THE PRINCIPLE OF K-NEAREST NEIGHBOURS,\" EXPERT SYST. APPL.,VOL. 36, NO. 1, PP. 643–659, 2009.","[41] H. LI, H.-B. HUANG, J. SUN, AND C. LIN, \"ON SENSITIVITY OF CASE-BASED REA-SONING TO OPTIMAL FEATURE SUBSETS IN BUSINESS FAILURE PREDICTION,\" EXPERTSYST. APPL., VOL. 37, NO. 7, PP. 4811–4821, 2010.","[42] H. LI AND J. SUN, \"CASE-BASED REASONING ENSEMBLE FOR BUSINESSFAILURE PREDICTION: A COMPUTATIONAL APPROACH FROM MULTIPLE CASEREPRESENTATIONS,\" EXPERT SYST. APPL., VOL. 39, NO. 3, PP. 3298–3310, 2012.","[43] Z. YANG, W. YOU, AND G. JI, \"USING PARTIAL LEAST SQUARES AND SUPPORTVECTOR MACHINES FOR BANKRUPTCY PREDICTION,\" EXPERT SYST. APPL., VOL. 38,NO. 7, PP. 8336–8342, 2011.","[44] U. SHETTY, T. P. M. PAKKALA, AND T. MALLIKARJUNAPPA, \"A MODIFIED DIREC-TIONAL DISTANCE FORMULATION OF DEA TO ASSESS BANKRUPTCY: AN APPLICATIONTO IT/ITES COMPANIES IN INDIA,\" EXPERT SYST. APPL., VOL. 39, NO. 2,PP. 1988–1997, 2012.","[45] H. LI AND J. SUN, \"PRINCIPAL COMPONENT CASE-BASED REASONING ENSEM-BLE FOR BUSINESS FAILURE PREDICTION,\" INF. MANAGE., VOL. 48, NO. 6,PP. 220–227, 2011.","[46] Y.-C. HU AND C.-J. CHEN, \"A PROMETHEE-BASED CLASSIFICATION METHODUSING CONCORDANCE AND DISCORDANCE RELATIONS AND ITS APPLICATION TOBANKRUPTCY PREDICTION,\" INF. SCI., VOL. 181, NO. 22, PP. 4959–4968, 2011.","[47] H. LI AND J. SUN, \"EMPIRICAL RESEARCH OF HYBRIDIZING PRINCIPAL COMPONENTANALYSIS WITH MULTIVARIATE DISCRIMINANT ANALYSIS AND LOGISTIC REGRESSIONFOR BUSINESS FAILURE PREDICTION,\" EXPERT SYST. APPL., VOL. 38, NO. 5,PP. 6244–6253, 2011.","[48] Z. XIAO, X. L. YANG, Y. PANG, AND X. DANG, \"THE PREDICTION FOR LISTEDCOMPANIES' FINANCIAL DISTRESS BY USING MULTIPLE PREDICTION METHODS WITHROUGH SET AND DEMPSTER–SHAFER EVIDENCE THEORY,\" KNOWL.-BASED SYST.,VOL. 26, PP. 196–206, FEB. 2011.","[49] H. LI AND J. SUN, \"ON PERFORMANCE OF CASE-BASED REASONING IN CHINESEBUSINESS FAILURE PREDICTION FROM SENSITIVITY, SPECIFICITY, POSITIVE ANDNEGATIVE VALUES,\" APPL. SOFT COMPUT., VOL. 11, NO. 1, PP. 460–467, 2011.","[50] C.-F. TSAI, \"FEATURE SELECTION IN BANKRUPTCY PREDICTION,\" KNOWL.-BASEDSYST., VOL. 22, NO. 2, PP. 120–127, 2009.","[51] H. LI AND J. SUN, \"HYBRIDIZING PRINCIPLES OF THE ELECTRE METHODWITH CASE-BASED REASONING FOR DATA MINING: ELECTRE-CBR-I ANDELECTRE-CBR-II,\" EUR. J. OPER. RES., VOL. 197, NO. 1, PP. 214–224, 2009.","[52] S.-W. LIN, Y.-R. SHIUE, S.-C. CHEN, AND H.-M. CHENG, \"APPLYINGENHANCED DATA MINING APPROACHES IN PREDICTING BANK PERFORMANCE:A CASE OF TAIWANESE COMMERCIAL BANKS,\" EXPERT SYST. APPL., VOL. 36,NO. 9, PP. 11543–11551, 2009.","[53] H. J. MIN AND C. JEONG, \"A BINARY CLASSIFICATION METHOD FOR BANKRUPTCYPREDICTION,\" EXPERT SYST. APPL., VOL. 36, NO. 3, PP. 5256–5263, 2009.","[54] K.-S. SHIN, T. S. LEE, AND H.-J. KIM, \"AN APPLICATION OF SUPPORT VECTORMACHINES IN BANKRUPTCY PREDICTION MODEL,\" EXPERT SYST. APPL., VOL. 28,NO. 1, PP. 127–135, 2005.","[55] E. I. ALTMAN, \"FINANCIAL RATIOS DISCRIMINANT ANALYSIS AND THE PREDICTIONOF CORPORATE BANKRUPTCY,\" J. FINANC., VOL. 23, NO. 4, PP. 589–609, 1968.","[56] E. B. DEAKIN, \"A DISCRIMINANT ANALYSIS OF PREDICTORS OF BUSINESS FAILURE,\"J. ACCOUNT. RES., VOL. 10, NO. 1, PP. 167–179, 1972.","[57] R. O. EDMISTER, \"AN EMPIRICAL TEST OF FINANCIAL RATIO ANALYSIS FOR SMALLBUSINESS FAILURE PREDICTION,\" J. FINANC. QUANT. ANAL., VOL. 7, NO. 2,PP. 1477–1493, 1972.","[58] L. V. G. SPRINGATE, \"PREDICTING THE POSSIBILITY OF FAILURE IN A CANADIANFIRM,\" M.B.A. RES. PROJECT, SIMON FRASER UNIV., BURNABY, BC, CANADA,1978."],"terms":["RATIOS","BANKRUPTCY","OFFSPRING","MODEL","INFLUENCING","VALUE","RATIO","MODELS","THRESHOLD","FINANCIAL"]}]