{"nodes":[{"id":"n46.pdf","label":"","x":0.8168673518258418,"y":0.0707335759502814,"size":10,"color":"#666"},{"id":"n50.pdf","label":"FILTERING OF A DISCRETE-TIME HMM-DRIVEN MULTIVARIATE ORNSTEIN-UHLENBECK MODEL WITH ","x":0.3387852928453967,"y":0.21964131843576262,"size":10,"color":"#666"},{"id":"n13.pdf","label":"FEEDBACK CONTROLLERS AS FINANCIAL ADVISORS FOR LOW-INCOME INDIVIDUALS HUGO GONZALEZ VILLASANTI AND KEVIN M. PASSINO, FELLOW, IEEE ABSTRACT—FEEDBACK CONTROLLERS ARE INTRODUCED TO HELP MANAGE ","x":0.7810011676368129,"y":0.30539080474502356,"size":10,"color":"#666"},{"id":"n120.pdf","label":"SEQUENTIAL DETECTION OF MARKET SHOCKS ","x":0.2835607230880304,"y":0.42808260725146074,"size":10,"color":"#666"},{"id":"n21.pdf","label":"MULTIOBJECTIVE INVESTMENT POLICY FOR A NONLINEAR STOCHASTIC FINANCIAL SYSTEM: A FUZZY APPROACH ","x":0.19595611897944165,"y":0.5277383627389338,"size":10,"color":"#666"},{"id":"n48.pdf","label":"AN ENVIRONMENT FOR RAPID DERIVATIVES DESIGN AND EXPERIMENTATION ","x":0.6254396009111416,"y":0.6906950952935236,"size":10,"color":"#666"},{"id":"n49.pdf","label":"DATA-DRIVEN STOCHASTIC PRICING AND APPLICATION TO ELECTRICITY MARKET ","x":0.49516695251925746,"y":0.7295509675286445,"size":10,"color":"#666"},{"id":"n20.pdf","label":"MULTIOBJECTIVE EVOLUTIONARY OPTIMIZATION OF TYPE-2 FUZZY RULE-BASED SYSTEMS FOR FINANCIAL ","x":0.1138291521801178,"y":0.29240204136649783,"size":10,"color":"#666"},{"id":"n118.pdf","label":"FN-TOPSIS: FUZZY NETWORKS FOR RANKING TRADED EQUITIES ABDUL MALEK YAAKOB, ANTOANETA SERGUIEVA, SENIOR MEMBER, IEEE, AND ALEXANDER GEGOV, MEMBER, IEEE ","x":0.5546961286482102,"y":0.15373085761891758,"size":10,"color":"#666"},{"id":"n98.pdf","label":"OPTION PRICING WITH APPLICATION OF LEVY PROCESSES AND THE MINIMAL VARIANCE EQUIVALENT MARTINGALE ","x":0.0496851700430776,"y":0.1068342534858473,"size":10,"color":"#666"},{"id":"n17.pdf","label":"ESTIMATING TIPPING POINTS IN FEEDBACK-DRIVEN FINANCIAL NETWORKS ZVONKO KOSTANJČAR, MEMBER, IEEE, STJEPAN BEGUŠIĆ, HARRY EUGENE STANLEY, AND BORIS PODOBNIK ","x":0.590472883697903,"y":0.8415784654882628,"size":10,"color":"#666"},{"id":"n22.pdf","label":"FUZZY DYNAMICAL SYSTEM SCENARIO SIMULATION-BASED CROSS-BORDER FINANCIAL CONTAGION ANALYSIS: A ","x":0.7044214557748547,"y":0.3941201545408133,"size":10,"color":"#666"},{"id":"n29.pdf","label":"DETECTING WASH TRADE IN FINANCIAL MARKET USING DIGRAPHS AND DYNAMIC PROGRAMMING YI CAO, YUHUA LI, SENIOR MEMBER, IEEE, SONYA COLEMAN, MEMBER, IEEE, AMMAR BELATRECHE, MEMBER, IEEE, AND THOMAS MARTIN MCGINNITY, SENIOR MEMBER, IEEE ","x":0.9180059168959513,"y":0.2865878654277554,"size":10,"color":"#666"},{"id":"n19.pdf","label":"FINANCIAL STRESS THROUGH COMPLEXITY SCIENCE APIT HEMAKOM, STUDENT MEMBER, IEEE, THEERASAK CHANWIMALUEANG, STUDENT MEMBER, IEEE, ALICIA CARRIÓN, LISA AUFEGGER, ANTHONY G. CONSTANTINIDES, LIFE FELLOW, IEEE, AND DANILO P. MANDIC, FELLOW, IEEE ","x":0.9864298678709043,"y":0.6059981477922656,"size":10,"color":"#666"},{"id":"n23.pdf","label":"GAUSSIAN PROCESS REGRESSION STOCHASTIC VOLATILITY MODEL FOR FINANCIAL TIME SERIES ","x":0.0850345770536971,"y":0.5851433381318272,"size":10,"color":"#666"},{"id":"n31.pdf","label":"A GENETIC BANKRUPT RATIO ANALYSIS TOOL USING A GENETIC ALGORITHM TO IDENTIFY INFLUENCING ","x":0.2558100498511928,"y":0.5738244761198461,"size":10,"color":"#666"}],"edges":[]}